{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium carduifolium",
    "plant_slug": "acanthodium-carduifolium",
    "plant_name_scientific": "acanthodium carduifolium",
    "intro": "Acanthodium carduifolium, commonly known as the thorned leaf acanthodium, is a flowering plant native to southern Africa. It belongs to the family Asteraceae, characterized by its composite flower heads. The plant features narrow, spiny leaves that are arranged in a rosette pattern, providing structural support and protection. Its flowers are typically yellow or orange, forming dense clusters that attract pollinators such as bees and butterflies. The plant is drought-tolerant and thrives in well-drained soils, making it adaptable to arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium carduifolium is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky and arid environments, often growing on limestone or clay soils. This plant thrives in dry, sunny conditions and is well adapted to the climate of its native range. It is typically found in open habitats such as scrublands, slopes, and along coastal areas. Due to its specific ecological requirements, its distribution is relatively limited to these regions.",
    "distribution_introduced_art_desc": "Acanthodium carduifolium was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and agricultural fields. It thrives in temperate climates and is often found in regions with moderate rainfall. The plant spreads through its seeds, which are dispersed by wind and water. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded in recent years, leading to concerns about its ecological impact."
}
