{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium curtisii",
    "plant_slug": "acanthophippium-curtisii",
    "plant_name_scientific": "acanthophippium curtisii",
    "intro": "Acanthophippium curtisii, commonly known as the Curtis's thorned horse-tail, is a rare and unique plant species belonging to the family Equisetaceae. It is characterized by its slender, unbranched stems that are covered in small, scale-like structures. The plant produces spore-bearing cones at the tips of its stems, which are typically found in moist, shaded environments. Acanthophippium curtisii is native to specific regions in the United States, particularly in the southeastern states. Due to its limited distribution and habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium curtisii"
    },
    "taxonomy_art_desc": "Acanthophippium curtisii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, a group of plants that includes horsetails and includes both vascular and non-vascular plant species. Its subclass is Magnoliidae, which is a large group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Asparagales, a group of flowering plants that includes many familiar species like orchids, grasses, and lilies. Its family is Orchidaceae, commonly known as the orchid family, which consists of over 25,000 species known for their diverse and often complex flowers. Its genus is Acanthophippium, a group of flowering plants within the orchid family known for their unique floral structures and specific habitat preferences. Its species is Acanthophippium curtisii, a specific type of orchid found in certain regions, characterized by its distinctive morphology and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium curtisii is primarily native to Borneo. It is found in the tropical rainforests of this island, which is part of the Malay Archipelago. This plant thrives in humid and shaded environments, typically within the understorey of dense forests. Its distribution is limited to specific regions within Borneo, where the climate and soil conditions are suitable for its growth. Due to habitat loss, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Acanthophippium curtisii was mainly introduced to areas with specific soil and climate conditions that mimic its native habitat. It is typically found in regions with well-drained soils and moderate to high levels of sunlight. The plant has been introduced to several regions outside its native range for ornamental purposes due to its unique appearance. However, its introduction has raised concerns about potential ecological impacts in non-native environments. Careful monitoring is recommended to assess its spread and effects on local ecosystems."
}
