{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon puberulum subsp. longiscapum",
    "plant_slug": "acantholimon-puberulum-subsp-longiscapum",
    "plant_name_scientific": "acantholimon puberulum subsp. longiscapum",
    "intro": "Acantholimon puberulum subsp. longiscapum, commonly known as the long-stemmed sandthrift, is a flowering plant native to arid and semi-arid regions of the Mediterranean. It is a low-growing perennial with erect, branching stems that bear small, yellow flowers. The plant has hairy leaves and is adapted to survive in dry, sandy soils. It plays a role in stabilizing dunes and preventing erosion. Its botanical features make it an important species in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon puberulum"
    },
    "taxonomy_art_desc": "Acantholimon puberulum subsp. longiscapum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive vascular systems and often having a distinct sporophyte generation. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with showy flowers and a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flowers and often includes species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and a variety of growth forms. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon puberulum, a specific type within the genus Acantholimon, characterized by its hairy stems and distinctive floral morphology, and it has the subspecies longiscapum, which refers to its elongated flower stalks.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon puberulum subsp. longiscapum is primarily native to Turkey. This subspecies is found in specific regions within Turkey, particularly in the eastern and southeastern parts of the country. It typically grows in rocky and arid environments, often in mountainous areas. The plant is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to certain ecological niches within Turkey, reflecting its specialized requirements.",
    "distribution_introduced_art_desc": "Acantholimon puberulum subsp. longiscapum was mainly introduced to areas with well-drained soils and full sun exposure, typically found in coastal and inland regions. It thrives in environments with moderate temperatures and low to moderate precipitation. This subspecies is often found in disturbed soils, such as along roadsides and in open grasslands. Its introduction has been documented in several regions of California and parts of the Pacific Northwest. It is valued for its ornamental qualities and ability to stabilize soil in erosion-prone areas."
}
