{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon sclerophyllum",
    "plant_slug": "acantholimon-sclerophyllum",
    "plant_name_scientific": "acantholimon sclerophyllum",
    "intro": "Acantholimon sclerophyllum, commonly known as the hard-leaved sandthrift, is a flowering plant native to the Mediterranean region. It is characterized by its compact, evergreen growth habit and small, needle-like leaves that are typically gray-green in color. The plant produces clusters of tiny, pale blue or white flowers during the spring and early summer. It is well adapted to arid and rocky environments, thriving in full sun and poor soils. Acantholimon sclerophyllum is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon sclerophyllum"
    },
    "taxonomy_art_desc": "Acantholimon sclerophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many familiar species such as roses and magnolias, characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with distinctive blue or purple flowers and often found in rocky or coastal areas. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon sclerophyllum, a specific plant within the genus Acantholimon, known for its hardy nature and ability to thrive in dry, rocky habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon sclerophyllum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in rocky and arid environments, often growing at high altitudes. It is adapted to the harsh climatic conditions of its native habitat. The species is part of the Caryophyllaceae family and is known for its resilience in dry and nutrient-poor soils.",
    "distribution_introduced_art_desc": "Acantholimon sclerophyllum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is often found in disturbed sites such as roadsides, gravelly slopes, and open woodlands. This plant is adapted to dry conditions and can tolerate moderate salinity, making it suitable for coastal environments. It spreads primarily through its fibrous root system and can form dense colonies. Due to its hardy nature, it is sometimes used in landscaping for erosion control and as an ornamental plant."
}
