{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon trautvetteri",
    "plant_slug": "acantholimon-trautvetteri",
    "plant_name_scientific": "acantholimon trautvetteri",
    "intro": "Acantholimon trautvetteri, commonly known as the Trautvetter's sea holly, is a flowering plant native to the Mediterranean region. It belongs to the Plumbagaceae family and is characterized by its distinctive, spiky flower heads that resemble those of sea holly. The plant typically grows in rocky or coastal environments, thriving in well-drained soils. Its leaves are narrow and often covered in fine hairs, which help reduce water loss in arid conditions. Acantholimon trautvetteri is known for its resilience and is often cultivated in gardens for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon trautvetteri"
    },
    "taxonomy_art_desc": "Acantholimon trautvetteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and clubmosses, and is distinguished by the presence of true vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many of the earliest diverging lineages of angiosperms, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral morphology and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often showy flowers and specialized seed dispersal mechanisms. Its genus is Acantholimon, a group of flowering plants typically found in arid or saline environments, known for their succulent leaves and showy, often blue or purple flowers. Its species is Acantholimon trautvetteri, a specific plant within the genus Acantholimon, native to certain regions and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon trautvetteri is primarily native to the Transcaucasus. It is found in the mountainous regions of this area, which spans parts of southern Russia, Georgia, and Azerbaijan. This plant typically grows in rocky or gravelly soils in alpine and subalpine habitats. It is well adapted to the harsh climate and limited soil conditions of its native range. Its distribution is relatively restricted, making it a rare and localized species in the region.",
    "distribution_introduced_art_desc": "Acantholimon trautvetteri was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It was introduced as an ornamental plant due to its attractive, silvery foliage and delicate flowers. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in well-drained soils and full sun, making it adaptable to various environments. Its rapid spread has raised concerns among conservationists and land managers."
}
