{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax trichodon",
    "plant_slug": "acanthopanax-trichodon",
    "plant_name_scientific": "acanthopanax trichodon",
    "intro": "Acanthopanax trichodon, commonly known as the hairy five-lobed dogwood, is a flowering plant native to East Asia. It belongs to the family Cornaceae and is characterized by its distinctive, five-lobed leaves that are often covered in fine hairs. The plant produces small, greenish-yellow flowers that appear in clusters, typically in the spring. Its berries are small and red, developing in the summer and attracting various bird species. Acanthopanax trichodon is often found in moist, shaded areas such as woodlands and streamside habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax trichodon is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, particularly in the temperate climate zones of these countries. This plant thrives in well-drained soils and is often associated with rocky or wooded habitats. It is an important component of the understory vegetation in these ecosystems. Its native range reflects its adaptation to the diverse environmental conditions of East Asia.",
    "distribution_introduced_art_desc": "Acanthopanax trichodon was mainly introduced to new environments as an ornamental plant due to its attractive appearance and hardy nature. It is commonly found in regions with temperate climates, where it thrives in well-drained soils and full sun. The plant's rapid growth and ability to spread through both seeds and vegetative propagation have led to its establishment in several non-native areas. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems. Despite its aesthetic value, careful management is recommended to prevent unintended ecological impacts."
}
