{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholobivia incuiensis",
    "plant_slug": "acantholobivia-incuiensis",
    "plant_name_scientific": "acantholobivia incuiensis",
    "intro": "Acantholobivia incuiensis, commonly known as the Incuiensis Acantholobivia, is a rare and unique plant species native to specific regions of South America. It belongs to the Cactaceae family and is characterized by its distinctive spiny stems and modified leaves. The plant typically grows in arid or semi-arid environments, adapting to harsh conditions with its water-storing tissues. Its flowers are often brightly colored, attracting pollinators such as bees and birds. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholobivia incuiensis is primarily native to the arid regions of southern Africa, specifically Namibia and South Africa. It is found in the Namib Desert and the Succulent Karoo biome, where it thrives in harsh, dry conditions. This species is adapted to extreme temperatures and low rainfall, often growing on rocky outcrops or in sandy soils. It is a succulent plant, storing water in its thick, fleshy stems and leaves. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acantholobivia incuiensis was mainly introduced to the region of central Chile, where it has become established in both natural and cultivated environments. This plant is native to the Andean regions of South America but has been widely cultivated for its ornamental value. It thrives in well-drained soils and full sun, making it adaptable to a variety of garden settings. Due to its attractive foliage and resilience, it has been introduced to other parts of the world, including parts of California and Australia. However, its spread outside its native range has raised concerns about its potential impact on local ecosystems."
}
