{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya angustifolia",
    "plant_slug": "acanthobotrya-angustifolia",
    "plant_name_scientific": "acanthobotrya angustifolia",
    "intro": "Acanthobotrya angustifolia, commonly known as the narrow-leafed acanthobotrya, is a flowering plant native to southern Africa. It belongs to the family Apocynaceae and is characterized by its slender, evergreen leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and is often found in coastal or mountainous regions. It produces small, berry-like fruits that contain seeds dispersed by animals. Due to its ornamental value and ecological significance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya angustifolia is primarily native to the eastern and southern regions of Africa, including countries such as South Africa, Mozambique, Zimbabwe, and Tanzania. It is commonly found in dry, rocky, and coastal areas, often growing on cliffs or among shrubs. This plant thrives in arid and semi-arid environments, adapting well to poor soil conditions. It is a member of the Asteraceae family and is known for its distinctive, narrow leaves and small, yellowish flowers. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthobotrya angustifolia was mainly introduced to areas with sandy soils and coastal environments. It thrives in regions with moderate to high salinity and is often found in dune ecosystems. This plant is commonly spread through wind dispersal of its seeds. It has been reported in several coastal states along the Atlantic and Gulf coasts of the United States. Its introduction has led to concerns about its potential to outcompete native vegetation in these sensitive habitats."
}
