{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tchihatcheffii",
    "plant_slug": "acantholimon-tchihatcheffii",
    "plant_name_scientific": "acantholimon tchihatcheffii",
    "intro": "Acantholimon tchihatcheffii, commonly known as the Armenian thimbleweed, is a perennial flowering plant native to the Caucasus region. It belongs to the family Plumbagaceae and is characterized by its erect, sparsely branched stems and small, blue to purple flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid and semi-arid environments. Its leaves are usually narrow and covered in fine hairs, which help reduce water loss. It is often found in mountainous regions and is valued for its ornamental appearance and ecological resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tchihatcheffii is primarily native to the Caucasus region, including parts of southern Russia and northern Turkey. It is found in mountainous areas with rocky or gravelly soils, often in alpine or subalpine zones. This plant thrives in temperate climates with cool, moist conditions and is commonly found in meadows and slopes. It is well adapted to harsh environments and is often part of the vegetation in high-altitude regions. Its distribution is limited to specific habitats, making it a characteristic species of the Caucasus flora.",
    "distribution_introduced_art_desc": "Acantholimon tchihatcheffii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky or gravelly habitats, often growing on slopes or along coastal dunes. This plant is well adapted to dry conditions and can tolerate salt spray, making it suitable for coastal environments. It is often used in xeriscaping and as an ornamental plant due to its attractive blue-gray foliage and flowering spikes. Its introduction has been primarily for horticultural purposes in regions with similar climatic conditions."
}
