{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon echinus subsp. creticum",
    "plant_slug": "acantholimon-echinus-subsp-creticum",
    "plant_name_scientific": "acantholimon echinus subsp. creticum",
    "intro": "Acantholimon echinus subsp. creticum, commonly known as the Cretan thorned cinquefoil, is a flowering plant native to the Mediterranean region, particularly Crete. It belongs to the family Montiaceae and is characterized by its succulent, spiny stems and small, clustered flowers. The plant typically grows in rocky or arid environments, showcasing its adaptation to harsh conditions. Its leaves are fleshy and often covered in fine hairs, while the flowers are usually pink or purple in color. This subspecies is of interest to botanists due to its unique morphology and limited distribution.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon echinus subsp. creticum is primarily native to the eastern Mediterranean region, particularly in southern Turkey and Cyprus. It is commonly found in rocky and coastal areas, often growing on limestone substrates. This subspecies thrives in arid and semi-arid environments, preferring well-drained soils. It is typically found in open habitats such as cliffs, slopes, and coastal dunes. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acantholimon echinus subsp. creticum was mainly introduced to areas with well-drained soils and rocky or gravelly substrates, typically in arid or semi-arid environments. It thrives in regions with low precipitation and high solar exposure, making it suitable for dryland habitats. This subspecies is commonly found in coastal and inland dunes, as well as on limestone and sandstone formations. Its introduction has been noted in parts of the Mediterranean Basin, including southern Europe and North Africa. It is often used in ecological restoration projects due to its resilience and ability to stabilize soil in harsh conditions."
}
