{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon iconicum",
    "plant_slug": "acantholimon-iconicum",
    "plant_name_scientific": "acantholimon iconicum",
    "intro": "Acantholimon iconicum, commonly known as the iconic saxifrage, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves that help it retain water in arid environments. The plant produces small, star-shaped flowers that are typically blue or purple in color, blooming in the summer months. It thrives in rocky soils and is often found in alpine or subalpine habitats. Due to its unique appearance and ecological significance, it is a subject of interest for botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon iconicum"
    },
    "taxonomy_art_desc": "Acantholimon iconicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often blue or purple flowers and their ability to thrive in saline or rocky soils. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon iconicum, a specific plant within the genus Acantholimon, known for its unique floral characteristics and its adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon iconicum is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and southeastern areas. This plant thrives in rocky and arid environments, often growing on slopes and in mountainous regions. It is adapted to the dry and harsh conditions typical of its native habitat. Its distribution is relatively limited, making it a rare and localized species within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon iconicum was mainly introduced to the Mediterranean region as an ornamental plant due to its unique appearance and hardy nature. It has since been found growing in several areas of southern Europe, particularly in Spain and Italy. The plant thrives in well-drained soils and full sun, making it suitable for rock gardens and dry landscapes. Although it is not considered invasive, it has become a part of the local flora in some regions. Its introduction has contributed to the biodiversity of these areas, though it remains relatively rare."
}
