{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ferox",
    "plant_slug": "acantholimon-ferox",
    "plant_name_scientific": "acantholimon ferox",
    "intro": "Acantholimon ferox, commonly known as the ferocious acantholimon, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its robust, upright growth habit. The plant features lance-shaped leaves with a waxy coating, adapted to withstand arid conditions. Its flowers are typically blue or violet, appearing in clusters during the spring and summer months. Acantholimon ferox is valued for its ornamental appeal and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ferox is primarily native to the Mediterranean region, particularly in southern Europe and northern Africa. It is commonly found in rocky and coastal areas, including cliffs and slopes. This plant thrives in arid and semi-arid environments, often growing in well-drained soils. It is also present in parts of the Middle East and western Asia. Due to its hardy nature, it is adapted to withstand harsh climatic conditions.",
    "distribution_introduced_art_desc": "Acantholimon ferox was mainly introduced to areas with disturbed soils and rocky habitats, often as an ornamental or for erosion control. It is commonly found in regions with Mediterranean climates, including parts of California and the Mediterranean Basin. This plant thrives in full sun and well-drained soils, making it adaptable to various environmental conditions. Its introduction has led to its establishment in some non-native regions, where it can compete with native vegetation. However, it is generally not considered invasive and is managed as a non-native species in many areas."
}
