{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon embergeri",
    "plant_slug": "acantholimon-embergeri",
    "plant_name_scientific": "acantholimon embergeri",
    "intro": "Acantholimon embergeri, commonly known as the Emberger's thornscale, is a perennial flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves and clusters of small, pinkish-white flowers. The plant is adapted to arid and semi-arid environments, often growing in rocky soils at high elevations. It produces small, capsule-like fruits that contain numerous seeds, which are dispersed by wind. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon embergeri"
    },
    "taxonomy_art_desc": "Acantholimon embergeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid and rocky habitats, known for their succulent leaves and showy flowers. Its species is Acantholimon embergeri, a specific plant species within the genus Acantholimon, native to certain regions of the Mediterranean and characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon embergeri is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky or sandy soils, often in mountainous areas. It is well adapted to the harsh climate of its native habitat. Its distribution is limited to specific regions within Iran where the environmental conditions are suitable for its survival.",
    "distribution_introduced_art_desc": "Acantholimon embergeri was mainly introduced to areas with well-drained soils and full sun exposure, often in rocky or gravelly habitats. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant has been introduced to several regions outside its native range, including parts of California and the Pacific Northwest in the United States. It is valued for its ornamental appeal, with its blue to purple flowers and drought-tolerant nature. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
