{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophoenix rubra",
    "plant_slug": "acanthophoenix-rubra",
    "plant_name_scientific": "acanthophoenix rubra",
    "intro": "Acanthophoenix rubra, commonly known as the red palm, is a species of palm native to the island of Socotra. It is characterized by its distinctive red or orange-colored leaves and a slender, unbranched trunk. The plant has a unique morphology, with long, feather-like leaves that are often covered in a waxy cuticle. It thrives in arid and semi-arid environments, adapting to the harsh climate of its native habitat. Due to its limited distribution and ecological significance, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Arecales",
        "family": "Arecaceae",
        "genus": "Acanthophoenix",
        "species": "Acanthophoenix rubra"
    },
    "taxonomy_art_desc": "Acanthophoenix rubra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Arecales, which consists of palm-like plants with a single trunk and large, compound leaves. Its family is Arecaceae, commonly known as the palm family, which includes over 2,500 species of tropical and subtropical plants. Its genus is Acanthophoenix, a group of palms characterized by their spiny leaves and typically found in coastal or arid regions. Its species is Acanthophoenix rubra, a specific type of palm known for its distinctive red coloration and adapted to grow in specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mauritius",
        "Réunion"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophoenix rubra is primarily native to Mauritius and Réunion. It is a species of palm that thrives in the tropical climate of these islands. This plant is commonly found in coastal areas and dry forests, where it adapts well to the local environmental conditions. It plays an important ecological role in the native ecosystems of both islands. Due to its restricted distribution, it is considered a valuable component of the regional biodiversity.",
    "distribution_introduced_art_desc": "Acanthophoenix rubra was mainly introduced to the coastal regions of southern Africa, particularly in South Africa, where it has been cultivated for its ornamental value. It thrives in well-drained soils and full sun, making it suitable for garden landscapes and coastal gardens. The plant is also found in parts of Madagascar, where it grows in dry, rocky habitats. Due to its hardy nature, it has been introduced to other tropical and subtropical regions as a decorative and resilient species. However, its spread is limited by its specific environmental requirements and climate preferences."
}
