{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon schahrudicum",
    "plant_slug": "acantholimon-schahrudicum",
    "plant_name_scientific": "acantholimon schahrudicum",
    "intro": "Acantholimon schahrudicum, commonly known as the Schahrudicum thornweed, is a flowering plant native to the arid regions of Iran. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant is characterized by its succulent leaves and clusters of small, pink or white flowers. It thrives in sandy or gravelly soils and is often found in semi-desert habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon schahrudicum"
    },
    "taxonomy_art_desc": "Acantholimon schahrudicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon schahrudicum, a specific plant species native to Iran, characterized by its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon schahrudicum is primarily native to Iran. It is found in the central and northern regions of the country. This plant typically grows in rocky and arid environments. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon schahrudicum was mainly introduced to areas with arid and semi-arid climates, particularly in regions with well-drained soils. It thrives in environments where temperatures can fluctuate significantly between day and night. This plant is often found in rocky or gravelly habitats, making it well-suited for disturbed or marginal lands. Its introduction has been noted in several parts of Iran, where it has adapted to local conditions. Due to its resilience, it has become an important component of the local flora in these regions."
}
