{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium gougahense",
    "plant_slug": "acanthophippium-gougahense",
    "plant_name_scientific": "acanthophippium gougahense",
    "intro": "Acanthophippium gougahense, commonly known as the Gougahense acanthophippium, is a rare flowering plant native to specific regions in Africa. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that come in shades of red and purple. The plant typically grows in rocky or sandy soils and prefers arid or semi-arid environments. It has hairy stems and leaves that are often covered in fine, glandular structures. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium gougahense"
    },
    "taxonomy_art_desc": "Acanthophippium gougahense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which consists of vascular plants with a distinct evolutionary lineage that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Asparagales, a large group of monocot flowering plants that includes many ornamental and agricultural species such as orchids and asparagus. Its family is Orchidaceae, commonly known as orchids, which are a diverse group of flowering plants known for their intricate and often showy flowers. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, characterized by specific morphological traits and geographical distribution. Its species is Acanthophippium gougahense, a specific type of orchid found in certain regions, distinguished by its unique floral and vegetative characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast",
        "Malaya",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium gougahense is primarily native to China Southeast, Malaya, Thailand, and Vietnam. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid climates and is often associated with forested or shaded environments. The species is known for its unique morphological features and ecological significance in its native habitats. Its distribution is limited to these specific geographic regions, making it a regionally important plant species.",
    "distribution_introduced_art_desc": "Acanthophippium gougahense was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity. It thrives in environments with moderate to high sunlight exposure and well-drained soils. This plant is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. Its introduction has been linked to both natural dispersal and intentional planting for ornamental or agricultural purposes. However, its spread can sometimes lead to competition with native species in invaded areas."
}
