{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon pamiricum",
    "plant_slug": "acantholimon-pamiricum",
    "plant_name_scientific": "acantholimon pamiricum",
    "intro": "Acantholimon pamiricum, commonly known as the Pamir spurge, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Boraginaceae and is characterized by its hairy stems and showy, violet-blue flowers. The plant typically grows in rocky or alpine environments, adapting to harsh climatic conditions. It has small, ovate leaves that are often covered in fine pubescence. Acantholimon pamiricum is valued for its ornamental appeal and ecological role in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon pamiricum"
    },
    "taxonomy_art_desc": "Acantholimon pamiricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive flower structures and salt tolerance. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes plants with showy flowers and some medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and mountainous regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon pamiricum, a specific plant native to the Pamir Mountains, known for its unique adaptations to high-altitude environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon pamiricum is primarily native to Afghanistan and Tajikistan. This plant is found in the mountainous regions of these countries, particularly in the Pamir and Hindu Kush ranges. It thrives in high-altitude environments, often growing in rocky or alpine soils. The species is adapted to the cold and arid conditions of its native habitat. It plays a role in the local biodiversity of these regions.",
    "distribution_introduced_art_desc": "Acantholimon pamiricum was mainly introduced to areas with high altitudes and arid conditions, typically found in mountainous regions. It thrives in well-drained soils and is often found in rocky or gravelly habitats. This plant is adapted to withstand extreme temperatures and low precipitation, making it suitable for harsh environments. It is commonly found in the Pamir Mountains and surrounding regions of Central Asia. Its introduction has been noted in ecological studies focusing on alpine flora and plant adaptation strategies."
}
