{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis micrantha",
    "plant_slug": "acanthorhipsalis-micrantha",
    "plant_name_scientific": "acanthorhipsalis micrantha",
    "intro": "Acanthorhipsalis micrantha, commonly known as the small-flowered glochidion, is a species of flowering plant in the family Apocynaceae. It is native to tropical regions of South America, particularly Brazil, and is characterized by its succulent, branching stems and small, tubular flowers. The plant produces yellow or orange flowers that are typically clustered in inflorescences, and its leaves are usually opposite and ovate. It is often grown as a decorative plant due to its unique appearance and ability to thrive in well-drained soil. Acanthorhipsalis micrantha is also valued for its ornamental qualities and is sometimes used in horticultural displays.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis micrantha is primarily native to the tropical regions of South America, particularly Brazil, Colombia, and Ecuador. It is commonly found in humid lowland areas, often growing in shaded understorey environments within dense forests. This plant thrives in regions with high humidity and consistent rainfall, typically near riverbanks or in moist, well-drained soils. It is often associated with secondary growth and disturbed habitats, showing a degree of adaptability to changing environmental conditions. Due to its specific habitat requirements, it is not widely distributed beyond these geographic areas.",
    "distribution_introduced_art_desc": "Acanthorhipsalis micrantha was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and ease of cultivation. It was first documented in the early 20th century and has since become established in several regions. The plant is often found in disturbed habitats such as roadsides, gardens, and coastal areas. Its rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its invasive potential. Due to its ecological impact, it is now considered a noxious weed in some parts of its introduced range."
}
