{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthococos emensis var. pubifolia",
    "plant_slug": "acanthococos-emensis-var-pubifolia",
    "plant_name_scientific": "acanthococos emensis var. pubifolia",
    "intro": "Acanthococos emensis var. pubifolia, commonly known as the hairy acanthococos, is a rare and specialized plant species native to specific regions of southern Africa. It belongs to the family Arecaceae, which includes palms, and is characterized by its unique morphological features. The variety *pubifolia* is distinguished by its hairy or pubescent leaves, which provide a distinctive appearance. This plant typically grows in moist, shaded environments, often in rocky or coastal areas. Its botanical significance lies in its adaptability to harsh conditions and its role in local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthococos emensis var. pubifolia is primarily native to the coastal regions of southern Africa, specifically Namibia and South Africa. This variant is commonly found in sandy and rocky habitats along the Atlantic coast. It thrives in arid and semi-arid environments with well-drained soils. The plant is adapted to withstand high salinity and intense sunlight. It plays an important role in stabilizing coastal dunes and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthococos emensis var. pubifolia was mainly introduced to the coastal regions of southern California, where it thrives in sandy and rocky habitats. It was likely introduced through human activity, such as accidental transport via maritime or coastal development. This plant has since spread along the shoreline, often colonizing disturbed areas and outcompeting native vegetation. Its introduction has raised concerns due to its potential to alter local ecosystems and reduce biodiversity. Efforts are being made to monitor and manage its spread to prevent further ecological impact."
}
