{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum stocksianum",
    "plant_slug": "acanthophyllum-stocksianum",
    "plant_name_scientific": "acanthophyllum stocksianum",
    "intro": "Acanthophyllum stocksianum, commonly known as the Stock's jointed sage, is a low-growing, mat-forming shrub native to arid regions of the southwestern United States and northern Mexico. It features dense, gray-green foliage with small, needle-like leaves that help reduce water loss in its harsh environment. The plant produces compact, showy clusters of violet to blue-purple flowers during the spring and early summer. Its root system is extensive and deep, allowing it to access moisture from deeper soil layers. Acanthophyllum stocksianum is adapted to extreme drought and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum stocksianum"
    },
    "taxonomy_art_desc": "Acanthophyllum stocksianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with simple leaves and showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum stocksianum, a specific plant within the genus Acanthophyllum, known for its adaptations to dry environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum stocksianum is primarily native to Afghanistan, Iran, and Pakistan. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils, often in areas with low rainfall. The species is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum stocksianum was mainly introduced to arid and semi-arid regions of the southwestern United States, particularly in states like Nevada, Utah, and Arizona. It is commonly found in sandy soils and is often associated with sagebrush steppe ecosystems. This plant has been introduced to these areas as part of ecological restoration efforts due to its ability to stabilize soil and provide habitat for native wildlife. However, it is also considered a potential invasive species in some regions, outcompeting native vegetation. Its distribution has expanded in recent decades due to climate change and human land management practices."
}
