{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum verticillatum",
    "plant_slug": "acanthophyllum-verticillatum",
    "plant_name_scientific": "acanthophyllum verticillatum",
    "intro": "Acanthophyllum verticillatum, commonly known as the silky acanthophyllum, is a flowering plant native to arid regions of Central Asia. It is a shrub characterized by its dense, spiny foliage and small, pale yellow flowers. The plant has adapted to harsh desert conditions through its deep root system and succulent leaves. It plays an important role in stabilizing sandy soils and providing habitat for desert wildlife. Its ornamental value has also made it a subject of interest in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum verticillatum"
    },
    "taxonomy_art_desc": "Acanthophyllum verticillatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Caryophyllales, a group of flowering plants known for their diverse habitats and unique adaptations. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many ornamental and medicinal plants. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and spiny structures. Its species is Acanthophyllum verticillatum, a specific type of flowering plant known for its compact growth and adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum verticillatum is primarily native to Iran, Iraq, and Turkey. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils and is often part of the vegetation in desert and steppe ecosystems. The species is well adapted to the harsh climatic conditions of its native range. It plays an important role in stabilizing soils and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthophyllum verticillatum was mainly introduced to arid and semi-arid regions of northern Africa, the Middle East, and parts of Central Asia. It thrives in sandy or gravelly soils and is often found in coastal dunes and inland deserts. This plant is well adapted to high temperatures and low precipitation, making it a resilient species in harsh environments. It plays a role in stabilizing sand dunes and preventing soil erosion. However, its introduction has sometimes led to competition with native plant species in certain areas."
}
