{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale decempedalis",
    "plant_slug": "acanthopale-decempedalis",
    "plant_name_scientific": "acanthopale decempedalis",
    "intro": "Acanthopale decempedalis, commonly known as the ten-lobed acanthopale, is a flowering plant native to southern Africa. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows as a shrub or subshrub, with woody stems and small, narrow leaves. Its flowers are yellow and arranged in dense clusters, making it a distinctive and ornamental species. It is often found in rocky or sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopale",
        "species": "Acanthopale decempedalis"
    },
    "taxonomy_art_desc": "Acanthopale decempedalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a wide range of forms, including ferns and horsetails, and is known for its diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by its diverse floral structures. Its order is Lamiales, a group of flowering plants that includes well-known families like the mint family and the snapdragon family, and is characterized by specific floral and leaf structures. Its family is Acanthaceae, a family of flowering plants commonly known as the acanthus family, which includes many ornamental plants with showy flowers and spiny leaves. Its genus is Acanthopale, a genus within the Acanthaceae family that consists of flowering plants typically characterized by their distinctive floral morphology and often spiny or hairy structures. Its species is Acanthopale decempedalis, a specific plant within the genus Acanthopale, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "DR Congo",
        "Gulf of Guinea Is.",
        "Nigeria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale decempedalis is primarily native to Cameroon, DR Congo, Gulf of Guinea Is., and Nigeria. This plant is found in the tropical rainforests of these regions. It thrives in humid and warm climates with high rainfall. Its native distribution is concentrated in Central and West Africa. The plant is commonly found in forested areas and along riverbanks in these countries.",
    "distribution_introduced_art_desc": "Acanthopale decempedalis was mainly introduced to new habitats through human activities such as horticulture and land modification. It has been observed in regions with warm climates and well-drained soils, often thriving in disturbed environments. The plant's spread is facilitated by its ability to establish quickly and compete with native species. It is commonly found in areas with low moisture and full sun exposure. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
