{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus tetragonus var. micracanthus",
    "plant_slug": "acanthocereus-tetragonus-var-micracanthus",
    "plant_name_scientific": "acanthocereus tetragonus var. micracanthus",
    "intro": "Acanthocereus tetragonus var. micracanthus, commonly known as the small-spined night bloomer, is a species of cactus native to Mexico. It is characterized by its cylindrical stems that are covered with short, pale spines. The plant produces white, fragrant flowers that bloom at night, attracting nocturnal pollinators such as bats and moths. It thrives in well-drained soil and requires full sun exposure. Due to its unique appearance and nocturnal blooming habit, it is a popular choice for xeriscaping and desert gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus tetragonus var. micracanthus is primarily native to the southern United States, particularly Texas, and northern Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and limestone regions. This cactus species is commonly seen in desert scrublands and along the edges of Chihuahuan Desert habitats. It is well adapted to hot, dry climates with minimal rainfall. Due to its unique appearance and hardiness, it is sometimes cultivated in xeriscapic gardens in regions with similar climates.",
    "distribution_introduced_art_desc": "Acanthocereus tetragonus var. micracanthus was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert regions, particularly in areas with well-drained soils and full sun exposure. This plant is often cultivated for its ornamental value due to its distinctive spiny stems and vibrant flowers. It has been introduced to various botanical gardens and private collections across the United States. However, its spread in the wild is limited due to its specific environmental requirements."
}
