{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum albidum",
    "plant_slug": "acanthophyllum-albidum",
    "plant_name_scientific": "acanthophyllum albidum",
    "intro": "Acanthophyllum albidum, commonly known as the white thorned grass, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its spiny stems and small, gray-green leaves that are adapted to reduce water loss. The plant produces yellow flowers in dense clusters, typically during the summer months. It thrives in sandy or gravelly soils and is well-suited to harsh, dry environments. Acanthophyllum albidum plays a role in stabilizing desert soils and providing habitat for small desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum albidum"
    },
    "taxonomy_art_desc": "Acanthophyllum albidum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes species with specialized adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many herbaceous plants with showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum albidum, a specific type of flowering plant known for its white flowers and adaptation to dry, sandy habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum albidum is primarily native to Tadzhikistan and Uzbekistan. It is commonly found in arid and semi-arid regions within these countries. This plant thrives in sandy or gravelly soils, often in desert or steppe environments. It is well adapted to the harsh climatic conditions of Central Asia. Its distribution is closely linked to the ecological zones characterized by low precipitation and extreme temperature fluctuations.",
    "distribution_introduced_art_desc": "Acanthophyllum albidum was mainly introduced to arid and semi-arid regions of the Middle East, North Africa, and parts of the Mediterranean. It thrives in sandy and gravelly soils with low precipitation. The plant is commonly found in coastal dunes and inland deserts. It plays a role in stabilizing sand dunes and preventing soil erosion. Due to its hardy nature, it has been used in ecological restoration projects in degraded landscapes."
}
