{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon androsaceum var. latifolium",
    "plant_slug": "acantholimon-androsaceum-var-latifolium",
    "plant_name_scientific": "acantholimon androsaceum var. latifolium",
    "intro": "Acantholimon androsaceum var. latifolium, commonly known as the broad-leaved sandverbena, is a low-growing perennial plant native to the Mediterranean region. It features succulent, fleshy leaves that are typically broad and rounded, adapted to retain moisture in arid environments. The plant produces small, pink or purple flowers that bloom in spring, adding ornamental value to rocky or sandy soils. It thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Due to its hardy nature, it is often used in landscaping for its drought tolerance and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon androsaceum var. latifolium is primarily native to Turkey. This plant is found in specific regions within Turkey, particularly in areas with rocky or gravelly soils. It typically grows in alpine or subalpine environments, often in open habitats such as slopes and meadows. The species is adapted to the climatic conditions of its native range, including cold temperatures and well-drained soils. Its distribution is limited to certain parts of Turkey, reflecting its ecological preferences and historical range.",
    "distribution_introduced_art_desc": "Acantholimon androsaceum var. latifolium was mainly introduced to areas with well-drained soils and moderate moisture, typically found in open, sunny habitats such as rocky slopes and gravelly plains. It thrives in regions with temperate climates and is often found in areas with low to moderate nutrient levels. This plant is commonly associated with disturbed soils and can spread through vegetative reproduction. It is considered an invasive species in some regions due to its ability to outcompete native flora. Its introduction has led to concerns about ecological impact in certain ecosystems."
}
