{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon albanicum",
    "plant_slug": "acantholimon-albanicum",
    "plant_name_scientific": "acantholimon albanicum",
    "intro": "Acantholimon albanicum, commonly known as the Albanian thornweed, is a flowering plant native to the Balkan region. It belongs to the family Montiaceae and is characterized by its small, spiny stems and clustered flowers. The plant typically grows in rocky or dry habitats, showcasing its adaptability to arid conditions. Its flowers are usually pale blue or white, and it produces small, capsule-like fruits. Acantholimon albanicum is often found in mountainous areas and is of interest to botanists due to its unique morphology and limited distribution.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon albanicum"
    },
    "taxonomy_art_desc": "Acantholimon albanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse lineages, often with primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and xerophytic species, often with distinctive floral and leaf structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and specialized leaf structures. Its genus is Acantholimon, a genus of flowering plants in the Plumbaginaceae family, typically characterized by their succulent leaves and showy flowers. Its species is Acantholimon albanicum, a specific plant within the genus Acantholimon, native to the Balkans, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Albania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon albanicum is primarily native to Albania. It is found in the mountainous regions of the country, particularly in the southern and central areas. This plant typically grows in rocky and limestone soils at higher elevations. It is adapted to the temperate climate and seasonal rainfall patterns of Albania. Acantholimon albanicum is a rare species with a limited geographic range within the country.",
    "distribution_introduced_art_desc": "Acantholimon albanicum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive blue flowers and drought tolerance. It has since been reported in parts of southern Europe, including Spain and Italy, where it has established itself in disturbed soils and open habitats. Although not widely invasive, it has shown some ability to spread along roadsides and in urban areas. Its introduction has raised concerns about its potential impact on native flora in these regions. Further monitoring is needed to assess its ecological effects."
}
