{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium hoffmannseggianum",
    "plant_slug": "acanthodium-hoffmannseggianum",
    "plant_name_scientific": "acanthodium hoffmannseggianum",
    "intro": "Acanthodium hoffmannseggianum, commonly known as Hoffmannsegg's acanthodium, is a flowering plant native to the Canary Islands. It belongs to the family Asteraceae, characterized by its composite flower heads. The plant features narrow, grass-like leaves and produces small yellow flowers arranged in a cluster. It thrives in rocky and arid environments, showcasing adaptations to its native climate. Due to its limited distribution, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium hoffmannseggianum is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as South Africa, Zimbabwe, and Mozambique. It thrives in sandy or loamy soils and is commonly found in open woodlands and grasslands. This plant is also known to occur in parts of Madagascar and the Arabian Peninsula. It prefers areas with moderate to high rainfall and can tolerate periods of drought. Its native distribution is closely linked to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Acanthodium hoffmannseggianum was mainly introduced to the Mediterranean region as an ornamental plant due to its unique appearance and hardiness. It has since spread to other parts of Europe, particularly in southern areas with mild climates. The plant is often found in gardens and along roadsides where it thrives in well-drained soils. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. Despite its beauty, careful management is recommended to prevent its spread beyond cultivated areas."
}
