{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantacaryx pinguis",
    "plant_slug": "acantacaryx-pinguis",
    "plant_name_scientific": "acantacaryx pinguis",
    "intro": "Acantacaryx pinguis, commonly known as the fat-leafed acanthacaryx, is a unique plant species characterized by its thick, fleshy leaves that store water, adapting it to arid environments. It belongs to the family Acanthaceae, which includes a variety of flowering plants with showy bracts. The plant typically grows in tropical and subtropical regions, where it thrives in well-drained soils and full sunlight. Its flowers are small and clustered, often in vibrant colors that attract pollinators like bees and butterflies. Due to its slow growth and specific habitat requirements, it is considered a rare and valuable species in botanical gardens and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantacaryx pinguis is primarily native to the tropical rainforests of Southeast Asia, particularly in regions such as Malaysia, Indonesia, and the Philippines. This plant thrives in humid, shaded environments with rich, well-drained soil. It is commonly found in lowland and hillside areas where the climate remains consistently warm and moist. Due to its specific habitat requirements, it is not widely distributed beyond these regions. Conservation efforts are ongoing to protect its natural habitat from deforestation and land conversion.",
    "distribution_introduced_art_desc": "Acantacaryx pinguis was mainly introduced to areas with disturbed soils and wetlands, where it thrives in moist, nutrient-rich environments. It is commonly found in riparian zones and along the edges of ponds and lakes. This plant spreads through rhizomes, allowing it to colonize new areas rapidly. Its introduction has led to the displacement of native vegetation in some regions. Due to its aggressive growth, it is considered a potential invasive species in certain ecosystems."
}
