{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum tadshikistanicum",
    "plant_slug": "acanthophyllum-tadshikistanicum",
    "plant_name_scientific": "acanthophyllum tadshikistanicum",
    "intro": "Acanthophyllum tadshikistanicum, commonly known as the Tadjikistan spiny dwarf shrub, is a low-growing perennial plant native to Central Asia. It belongs to the Amaranthaceae family and is characterized by its dense, spiny foliage and compact growth habit. The plant is adapted to arid and semi-arid environments, often found in rocky or sandy soils. Its small, usually green or pale yellow flowers appear in clusters, and it plays a role in stabilizing soil in its native habitat. Due to its resilience, it is sometimes used in ecological restoration projects in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum tadshikistanicum"
    },
    "taxonomy_art_desc": "Acanthophyllum tadshikistanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert-adapted species, often with specialized adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum tadshikistanicum, a specific plant species native to Tajikistan, adapted to its local environment with features such as spiny foliage and drought resistance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum tadshikistanicum is primarily native to Afghanistan and Tadzhikistan. This plant is typically found in arid and semi-arid regions, often in rocky or sandy soils. It thrives in harsh environmental conditions, making it well-adapted to the mountainous and desert landscapes of these countries. The species is part of the Amaranthaceae family and is commonly found in steppes and dry grasslands. Its distribution is closely linked to the specific climatic and geological features of its native habitats.",
    "distribution_introduced_art_desc": "Acanthophyllum tadshikistanicum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in mountainous areas with well-drained soils. It is commonly found in the Tianshan, Pamir, and Karakoram mountain ranges, where it thrives in harsh, cold climates. This plant is adapted to low precipitation and high solar radiation, making it a resilient species in these environments. It plays a crucial role in stabilizing soil and preventing erosion in these fragile ecosystems. Its distribution is largely limited to specific altitudinal zones, typically between 2,000 and 4,000 meters above sea level."
}
