{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax senticosus var. subinermis",
    "plant_slug": "acanthopanax-senticosus-var-subinermis",
    "plant_name_scientific": "acanthopanax senticosus var. subinermis",
    "intro": "Acanthopanax senticosus var. subinermis, commonly known as the Siberian ginseng or Eleuthero, is a deciduous shrub native to the temperate regions of East Asia. It is characterized by its compound leaves and small, yellowish-green flowers that appear in clusters. The plant produces red berries that are edible but not commonly consumed by humans. It thrives in well-drained soils and is often found in forested areas. This species is valued for its adaptogenic properties and is used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax senticosus var. subinermis is primarily native to the mountainous regions of northeastern India, particularly in the states of Arunachal Pradesh and Sikkim. It is also found in parts of Bhutan and northern Myanmar. This variety thrives in temperate to subtropical climates at high altitudes. It is commonly found in forests and shrublands, often growing on rocky slopes or in mixed vegetation. Its distribution is closely associated with the Himalayan foothills and adjacent mountain ranges.",
    "distribution_introduced_art_desc": "Acanthopanax senticosus var. subinermis was mainly introduced to regions with temperate climates, where it thrives in forested areas and mountainous terrain. This variant is particularly adapted to cooler and more humid environments compared to its parent species. It is often found in the understory of mixed deciduous and coniferous forests. The introduction of this plant has been documented in parts of East Asia, including China, Korea, and Japan. Due to its medicinal properties, it has also been cultivated in some areas for traditional herbal use."
}
