{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kutschanense",
    "plant_slug": "acantholimon-kutschanense",
    "plant_name_scientific": "acantholimon kutschanense",
    "intro": "Acantholimon kutschanense, commonly known as the Kutschan's thornsteppe, is a flowering plant belonging to the family Caryophyllaceae. It is native to the arid and semi-arid regions of Central Asia, particularly in Kazakhstan and southern Russia. The plant is characterized by its low-growing habit, with succulent, fleshy leaves that help it retain water in dry environments. Its flowers are typically small and pink or purple, appearing in dense clusters during the summer months. Acantholimon kutschanense is well adapted to harsh, nutrient-poor soils and can thrive in environments with limited rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kutschanense"
    },
    "taxonomy_art_desc": "Acantholimon kutschanense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex cellular structures and the presence of chloroplasts. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and often possessing rhizomes. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants that typically have succulent stems and are often found in arid or rocky habitats. Its species is Acantholimon kutschanense, a specific type of flowering plant known for its unique morphological features and adapted to specific ecological niches.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kutschanense is primarily native to Iran. It is found in the mountainous regions of the country, particularly in the Zagros and Alborz mountain ranges. This plant thrives in rocky and arid environments, often growing in areas with poor soil conditions. It is adapted to the dry and cold climate of its native habitat. Due to its specific ecological requirements, its distribution is limited to certain high-altitude regions in Iran.",
    "distribution_introduced_art_desc": "Acantholimon kutschanense was mainly introduced to areas with sandy or gravelly soils in arid or semi-arid regions. It is commonly found in coastal dunes, inland salt flats, and disturbed sites such as roadsides and agricultural fields. This plant is well adapted to harsh environmental conditions, including high salinity and low moisture availability. Its introduction has been largely unintentional through human activities such as transportation and land development. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
