{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis monacantha",
    "plant_slug": "acanthorhipsalis-monacantha",
    "plant_name_scientific": "acanthorhipsalis monacantha",
    "intro": "Acanthorhipsalis monacantha, commonly known as the Monacantha String of Hearts, is a succulent plant native to South America. It features fleshy, heart-shaped leaves that are typically green with a subtle reddish tinge. The plant produces small, bell-shaped flowers in shades of white or pale pink during the spring and summer months. It thrives in bright, indirect light and requires well-draining soil to prevent root rot. Its unique appearance and relatively low maintenance make it a popular choice for indoor gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis monacantha is primarily native to the tropical regions of South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans the eastern coast of Brazil. This plant thrives in humid, shaded environments within the understory of dense tropical forests. It is also known to occur in parts of Paraguay and Argentina. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis monacantha was mainly introduced to regions with warm, dry climates where it can thrive in rocky or coastal environments. It is commonly found in areas with low rainfall and high sunlight exposure, such as parts of southern Africa and the Mediterranean. This plant is often cultivated as an ornamental due to its attractive, spiny stems and flowers. It has been reported to spread aggressively in some invaded areas, posing a threat to native vegetation. Its introduction is often associated with horticultural trade and accidental dispersal through human activities."
}
