{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza chuco",
    "plant_slug": "acanthorhiza-chuco",
    "plant_name_scientific": "acanthorhiza chuco",
    "intro": "Acanthorhiza chuco, commonly known as the Mexican fireplant, is a flowering plant native to Mexico and parts of Central America. It belongs to the family Acanthaceae and is characterized by its striking red and orange flowers that bloom in summer. The plant typically grows in rocky or disturbed soils and is often found in arid or semi-arid regions. Its leaves are opposite and lance-shaped, while its stems are hairy and often branched. Acanthorhiza chuco is also known for its medicinal properties and has been used in traditional herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza chuco is primarily native to South America, specifically the Andean regions of Peru, Bolivia, and Ecuador. It is commonly found in high-altitude grasslands and rocky areas within these countries. This plant thrives in temperate climates with well-drained soils. Its distribution is limited to specific ecological niches in the Andes. It is not found outside of this geographic range.",
    "distribution_introduced_art_desc": "Acanthorhiza chuco was mainly introduced to new environments through human activities such as horticultural trade and accidental transport. It has been reported in several regions outside its native range, including parts of South America and the Caribbean. The plant thrives in disturbed habitats, making it a potential invasive species in some areas. Its rapid growth and adaptability contribute to its successful establishment in non-native locations. However, its ecological impact remains under study due to limited long-term data."
}
