{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon sackenii",
    "plant_slug": "acantholimon-sackenii",
    "plant_name_scientific": "acantholimon sackenii",
    "intro": "Acantholimon sackenii, commonly known as the Sacken's thornscale, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its succulent, fleshy leaves and small, blue or violet flowers. The plant typically grows in rocky or sandy soils and is adapted to dry, coastal environments. It has a compact growth habit and is often found in coastal dunes or cliffs. Due to its unique appearance and limited distribution, it is considered a rare and specialized species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon sackenii"
    },
    "taxonomy_art_desc": "Acantholimon sackenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often found in arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many shrubs and herbs. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon sackenii, a specific type of flowering plant native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon sackenii is primarily native to Kirgizstan and Tadzhikistan. This plant is typically found in rocky or mountainous regions within these countries. It thrives in arid and semi-arid environments, often growing on slopes or in crevices. The species is well adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific ecological niches in the highlands of these regions.",
    "distribution_introduced_art_desc": "Acantholimon sackenii was mainly introduced to areas with well-drained soils and full sun exposure, often in dry, rocky habitats. It is commonly found in Mediterranean climates where it thrives in warm, dry conditions with minimal rainfall. This plant is typically spread through seeds dispersed by wind, animals, or human activity. It has been reported in several regions outside its native range, including parts of California and the Mediterranean Basin. Due to its hardy nature, it can become invasive in certain environments if not managed properly."
}
