{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon aegaeum",
    "plant_slug": "acantholimon-aegaeum",
    "plant_name_scientific": "acantholimon aegaeum",
    "intro": "Acantholimon aegaeum, commonly known as the Aegean sandthrift, is a flowering plant native to the rocky and sandy soils of the Aegean region. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant produces small, white or pink flowers that bloom in early spring, often in clusters at the ends of its stems. It has narrow, linear leaves that are adapted to withstand arid conditions and strong coastal winds. Acantholimon aegaeum is well-suited to coastal environments and is often found in dunes and rocky outcrops.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon aegaeum"
    },
    "taxonomy_art_desc": "Acantholimon aegaeum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by small flowers and often containing toxic compounds. Its genus is Acantholimon, a genus of flowering plants commonly found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon aegaeum, a specific plant within the genus Acantholimon, native to certain regions of Europe and characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "East Aegean Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon aegaeum is primarily native to the East Aegean Is. This plant is found in specific regions of the eastern part of the Aegean Sea, including several islands. It thrives in rocky and coastal environments, often growing on limestone substrates. The species is adapted to the Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Due to its limited range, it is considered a rare and endemic plant in this region.",
    "distribution_introduced_art_desc": "Acantholimon aegaeum was mainly introduced to New Zealand as an ornamental plant due to its attractive, flowering stems and foliage. It was likely brought there during the 19th or early 20th century by European settlers who were interested in cultivating exotic plants. Despite its ornamental value, it has since become naturalized in certain regions, particularly in coastal and disturbed habitats. The plant is now considered a potential weed in some areas, although its impact on native ecosystems is still being studied. Its distribution in New Zealand is limited compared to its native range in the Mediterranean."
}
