{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum microcephalum var. gracilentum",
    "plant_slug": "acanthophyllum-microcephalum-var-gracilentum",
    "plant_name_scientific": "acanthophyllum microcephalum var. gracilentum",
    "intro": "Acanthophyllum microcephalum var. gracilentum, commonly known as the slender sandmat, is a low-growing shrub native to arid regions of central Asia. It is characterized by its dense, mat-forming growth habit and small, spiny leaves that help reduce water loss. The plant produces yellow flowers in summer, which are clustered in small inflorescences. It thrives in sandy or gravelly soils and is adapted to withstand extreme drought conditions. Its structure provides habitat for small desert animals and contributes to soil stabilization in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum microcephalum var. gracilentum is primarily native to the arid and semi-arid regions of central and western North America. It is commonly found in the Great Basin, Mojave Desert, and parts of the Sonoran Desert. This plant thrives in sandy or gravelly soils and is often found in open, disturbed habitats. It is well adapted to drought conditions and can survive in areas with low precipitation. Its distribution is closely linked to specific ecological zones characterized by extreme temperature fluctuations and limited water availability.",
    "distribution_introduced_art_desc": "Acanthophyllum microcephalum var. gracilentum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of the southwestern United States and northern Mexico. This plant is well adapted to low precipitation and high temperatures, making it a resilient species in harsh environments. Its introduction has been primarily for stabilizing dunes and preventing soil erosion. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
