{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon androsaceum var. androsaceum",
    "plant_slug": "acantholimon-androsaceum-var-androsaceum",
    "plant_name_scientific": "acantholimon androsaceum var. androsaceum",
    "intro": "Acantholimon androsaceum var. androsaceum, commonly known as the Androsaceum thymeleaf, is a low-growing perennial plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its compact, mat-forming growth habit. The plant features small, fleshy, opposite leaves that are often covered in a whitish, powdery coating, which helps reduce water loss. Its flowers are typically blue or purple, appearing in clusters and blooming in late spring to early summer. It is well adapted to rocky and arid environments, making it a hardy and drought-tolerant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon androsaceum"
    },
    "taxonomy_art_desc": "Acantholimon androsaceum var. androsaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or violet flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon androsaceum, a specific plant within the genus known for its distinctive morphology and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kriti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon androsaceum var. androsaceum is primarily native to Kriti. This plant is found in the mountainous regions of this area, where it thrives in rocky and well-drained soils. It is adapted to the cool and humid climate typical of Kriti's high-altitude environments. The species is often found in alpine meadows and open slopes. Its distribution is limited to specific microhabitats within Kriti, making it a rare and localized plant.",
    "distribution_introduced_art_desc": "Acantholimon androsaceum var. androsaceum was mainly introduced to the Pacific Northwest region of the United States. It has been documented in several states including Oregon, Washington, and California. This plant is typically found in moist, coastal areas and rocky habitats. It is considered an invasive species in some areas due to its rapid spread and ability to outcompete native vegetation. Conservation efforts are ongoing to manage its distribution and prevent further ecological disruption."
}
