{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon aulieatense",
    "plant_slug": "acantholimon-aulieatense",
    "plant_name_scientific": "acantholimon aulieatense",
    "intro": "Acantholimon aulieatense, commonly known as the Aulieat Mountains lousewort, is a perennial flowering plant native to the arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its small, fleshy leaves and clusters of pink or purple flowers. The plant thrives in rocky, well-drained soils and is adapted to withstand extreme temperatures and limited water availability. It plays a role in stabilizing soil in its native habitat and is of interest to botanists due to its unique ecological adaptations. Acantholimon aulieatense is also valued for its ornamental appeal in dry garden settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon aulieatense"
    },
    "taxonomy_art_desc": "Acantholimon aulieatense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many familiar species, characterized by their diverse flower structures and evolutionary relationships. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes flowering plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon aulieatense, a specific plant within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon aulieatense is primarily native to Kazakhstan and Kirgizstan. It is commonly found in the mountainous regions of these countries. This plant thrives in dry, rocky habitats and is often associated with alpine environments. It is a member of the Plumbagaceae family and is known for its hardy nature. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon aulieatense was mainly introduced to areas with well-drained sandy or gravelly soils, often in open, sunny habitats. It is typically found in coastal dunes, sandplains, and rocky outcrops where it can thrive in dry, nutrient-poor conditions. The plant is adapted to withstand harsh environmental conditions, including high salinity and strong winds. Its introduction has been documented in several regions of Australia, particularly in the southern and western parts. It is considered a rare and localized species, often growing in isolated populations."
}
