{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon mirandum",
    "plant_slug": "acantholimon-mirandum",
    "plant_name_scientific": "acantholimon mirandum",
    "intro": "Acantholimon mirandum, commonly known as the miracle thimblecush, is a flowering plant native to the high alpine regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its compact, cushion-like growth form and produces small, pink to purple flowers during the summer months. Its leaves are typically narrow and covered in fine hairs, which help reduce water loss in its harsh environment. Acantholimon mirandum is valued for its ornamental appeal and its ability to thrive in poor, rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon mirandum is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal sage scrub and chaparral habitats. This plant thrives in well-drained soils and is adapted to the Mediterranean climate of these regions. It is often seen growing in open areas with partial shade. Due to its specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon mirandum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in rocky and coastal areas, thriving in well-drained soils. This plant is often cultivated in gardens for its attractive silvery foliage and delicate blue flowers. It prefers full sun and is drought-tolerant, making it suitable for xeriscaping. However, it is considered an invasive species in some areas where it outcompetes native vegetation."
}
