{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum fontanesii f. alpinum",
    "plant_slug": "acanthophyllum-fontanesii-f-alpinum",
    "plant_name_scientific": "acanthophyllum fontanesii f. alpinum",
    "intro": "Acanthophyllum fontanesii f. alpinum, commonly known as the alpine acanthophyllum, is a flowering plant belonging to the Amaranthaceae family. It is a low-growing shrub characterized by its dense, spiny foliage and small, clustered flowers. Native to the mountainous regions of Central Asia, this plant thrives in arid and semi-arid environments. Its adaptations include reduced leaf size and thick cuticles to minimize water loss. It plays a vital role in stabilizing soils and providing habitat for small desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum fontanesii f. alpinum is primarily native to the mountainous regions of Central Asia, including parts of Kazakhstan, Kyrgyzstan, and Tajikistan. It thrives in arid and semi-arid environments, often found in rocky or sandy soils at high elevations. This subspecies is adapted to harsh climatic conditions, such as strong winds and low precipitation. It is commonly found in steppes and mountain steppes, where it plays a role in stabilizing soil and supporting local biodiversity. Its distribution is closely linked to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Acanthophyllum fontanesii f. alpinum was mainly introduced to alpine and arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and China. It is adapted to harsh environmental conditions such as low temperatures, strong winds, and poor soil. This subspecies is often found in rocky or sandy soils at high elevations. Its introduction has been associated with human activities, including land use changes and ecological restoration efforts. It plays a role in stabilizing soil and preventing erosion in its native habitats."
}
