{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon speciosissimum",
    "plant_slug": "acantholimon-speciosissimum",
    "plant_name_scientific": "acantholimon speciosissimum",
    "intro": "Acantholimon speciosissimum, commonly known as the showy acantholimon, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many showy flowering plants. The plant is characterized by its upright stems and clusters of small, pink or purple flowers that bloom in late summer. It thrives in well-drained soils and prefers full sun to partial shade. Due to its ornamental value and limited distribution, it is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon speciosissimum"
    },
    "taxonomy_art_desc": "Acantholimon speciosissimum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes herbs and shrubs. Its genus is Acantholimon, a genus of flowering plants native to arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon speciosissimum, a specific type of plant within the genus Acantholimon known for its ornamental value and unique floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon speciosissimum is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at high altitudes. The species is adapted to the harsh climatic conditions of the region. It is an important component of the local flora and is typically found in dry, gravelly soils.",
    "distribution_introduced_art_desc": "Acantholimon speciosissimum was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal dunes and sandy soils where it thrives in well-drained conditions. This plant is often associated with disturbed sites and can spread rapidly in areas with frequent wind or human activity. Due to its invasive potential, it is considered a noxious weed in several regions. Its introduction has led to concerns about its impact on native plant communities and ecosystem balance."
}
