{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ebracteatus var. xiamenensis",
    "plant_slug": "acanthus-ebracteatus-var-xiamenensis",
    "plant_name_scientific": "acanthus ebracteatus var. xiamenensis",
    "intro": "Acanthus ebracteatus var. xiamenensis, commonly known as the Xiamen acanthus, is a rare and ornamental plant native to China. It is characterized by its distinctive, palmate leaves that are often covered in a dense layer of soft, velvety hairs. The plant produces showy, spire-like inflorescences with small, pale blue to purple flowers. It thrives in moist, well-drained soils and prefers partial to full shade. Due to its limited distribution and unique appearance, it is often cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ebracteatus var. xiamenensis is primarily native to southern China, particularly the coastal regions of Fujian Province. This species is also found in parts of Guangdong and Guangxi, where it thrives in moist, shaded environments. It is commonly associated with rocky shores and coastal cliffs, where it withstands saline and humid conditions. The plant is valued for its ornamental foliage and has been introduced to other parts of Southeast Asia. Its limited native range highlights its ecological specificity and vulnerability to habitat loss.",
    "distribution_introduced_art_desc": "Acanthus ebracteatus var. xiamenensis was mainly introduced to coastal regions of southern China, particularly in the Xiamen area. It is commonly found in rocky shores and tidal zones where it thrives in saline and humid conditions. This variety is valued for its ornamental leaves and is often used in horticultural landscapes. Its introduction has expanded its natural range beyond its original habitat. However, it is considered an invasive species in some areas, posing a threat to native vegetation."
}
