{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon histrix",
    "plant_slug": "acantholimon-histrix",
    "plant_name_scientific": "acantholimon histrix",
    "intro": "Acantholimon histrix, commonly known as the roughleaf stonecrop, is a perennial plant native to the mountainous regions of Central Asia. It belongs to the family Crassulaceae and is characterized by its compact, mat-forming growth habit. The plant features fleshy, often hairy leaves that are adapted to arid and rocky environments. Its small, star-shaped flowers are typically pink or purple, blooming in the summer months. Acantholimon histrix is valued for its ornamental appeal and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon histrix is primarily native to the Mediterranean region, particularly in parts of southern Europe, North Africa, and the Middle East. It thrives in rocky and coastal areas, often found on slopes and cliffs where the climate is dry and sunny. This plant is well adapted to harsh environments, with its succulent leaves helping it retain moisture. It is commonly seen in countries such as Spain, Italy, and Morocco. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acantholimon histrix was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dune environments. It thrives in well-drained, arid conditions and is commonly found in regions with mild, dry summers and cool, wet winters. This plant is typically introduced to disturbed sites such as roadsides, construction areas, and agricultural fields. It has a low-growing habit with dense, spiny foliage that helps it retain moisture and resist grazing. Due to its hardy nature, it can spread rapidly and establish itself in new habitats."
}
