{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum fontanesii subsp. schugnanicum",
    "plant_slug": "acanthophyllum-fontanesii-subsp-schugnanicum",
    "plant_name_scientific": "acanthophyllum fontanesii subsp. schugnanicum",
    "intro": "Acanthophyllum fontanesii subsp. schugnanicum, commonly known as the Schugnan sandthorn, is a shrub native to the arid regions of Central Asia. It is characterized by its dense, spiny foliage and small, often inconspicuous flowers. The plant thrives in sandy and rocky soils, demonstrating high adaptability to harsh environmental conditions. Its structure helps it retain moisture and protect against wind erosion. It plays a role in stabilizing desert ecosystems and is of interest for its ecological and potential medicinal values.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum fontanesii subsp. schugnanicum is primarily native to the mountainous regions of Central Asia, specifically Kazakhstan and southern regions of Russia. It thrives in arid and semi-arid environments, often found in steppes and rocky slopes. This subspecies is adapted to harsh climatic conditions, including low precipitation and extreme temperature fluctuations. It is commonly associated with sandy or gravelly soils in these regions. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum fontanesii subsp. schugnanicum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan and southern Russia. It thrives in sandy and gravelly soils, often found in steppe and desert ecosystems. This subspecies is adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion in its native habitat. However, its introduction to new areas may have ecological implications due to its potential to outcompete native vegetation."
}
