{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gabrieljaniae",
    "plant_slug": "acantholimon-gabrieljaniae",
    "plant_name_scientific": "acantholimon gabrieljaniae",
    "intro": "Acantholimon gabrieljaniae, commonly known as Gabrieljaniae's thorned bladderwort, is a rare flowering plant native to the Mediterranean region. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves and small, delicate flowers. The plant is adapted to arid environments, with a deep root system that helps it retain moisture. It typically grows in rocky or sandy soils and is often found in coastal areas. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon gabrieljaniae"
    },
    "taxonomy_art_desc": "Acantholimon gabrieljaniae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their spiny or prickly stems and flowers. Its species is Acantholimon gabrieljaniae, a specific type of plant within the genus Acantholimon, named in honor of Gabrieljaniae, and is known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gabrieljaniae is primarily native to the Transcaucasus. This region encompasses parts of modern-day Georgia, Armenia, and Azerbaijan. The plant is typically found in rocky or mountainous areas within this geographic range. It thrives in dry, sunny conditions with well-drained soils. Due to its limited distribution, it is considered a rare and endemic species in the Transcaucasus.",
    "distribution_introduced_art_desc": "Acantholimon gabrieljaniae was mainly introduced to areas with rocky or gravelly soils, often in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure. This plant is commonly found in coastal and inland dunes, as well as on disturbed sites. Its introduction has been noted in several Mediterranean and coastal regions of southern Europe. It is valued for its ornamental appeal and ability to stabilize soil in harsh conditions."
}
