{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthonema strigosum",
    "plant_slug": "acanthonema-strigosum",
    "plant_name_scientific": "acanthonema strigosum",
    "intro": "Acanthonema strigosum, commonly known as the hairy acanthonema, is a flowering plant native to southern Africa. It belongs to the family Acanthaceae and is characterized by its hairy stems and leaves. The plant produces small, clustered flowers that are typically pale green or white in color. It thrives in moist, shaded environments and is often found in woodland areas. Due to its unique appearance and habitat, it is of interest to botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthonema strigosum is primarily native to the eastern United States, particularly in the southeastern regions. It is commonly found in wetland habitats such as bogs, marshes, and swampy areas. This plant thrives in acidic soils and is often associated with pine forests. Its distribution extends from North Carolina to Florida and westward into parts of Georgia and Alabama. It is an important component of the local flora in these wetland ecosystems.",
    "distribution_introduced_art_desc": "Acanthonema strigosum was mainly introduced to areas with moist, acidic soils and shaded environments, often found in forest understories. It is commonly associated with disturbed sites such as abandoned fields and along stream banks. The plant thrives in regions with high humidity and moderate temperatures. Its introduction has been documented in several parts of North America, particularly in the eastern United States. Due to its adaptability, it has become a common sight in both natural and human-altered landscapes."
}
