{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon karamanicum",
    "plant_slug": "acantholimon-karamanicum",
    "plant_name_scientific": "acantholimon karamanicum",
    "intro": "Acantholimon karamanicum, commonly known as the Karaman's thornweed, is a flowering plant native to Turkey. It belongs to the family Plumbagaceae and is characterized by its succulent, branched stems and small, blue to purple flowers. The plant typically grows in rocky or sandy soils and is adapted to arid environments. It has hairy leaves that help reduce water loss, and its flowering period occurs in the spring and early summer. This species is of interest to botanists due to its unique morphology and ecological adaptations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon karamanicum"
    },
    "taxonomy_art_desc": "Acantholimon karamanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral structures and often contains plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and specialized root systems. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon karamanicum, a specific plant within the genus Acantholimon, native to certain regions of Turkey, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon karamanicum is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky or semi-arid environments. It is adapted to the local climate and soil conditions of its native habitat. Its distribution is limited to certain ecological niches within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon karamanicum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It has been cultivated in gardens and landscapes across southern Europe, particularly in countries like Spain, Italy, and Greece. Despite its aesthetic appeal, it has shown limited naturalization and is not considered invasive in most areas. The plant prefers well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Its introduction has primarily been through horticultural trade rather than natural dispersal."
}
