{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia punenis",
    "plant_slug": "acantholippia-punenis",
    "plant_name_scientific": "acantholippia punenis",
    "intro": "[WRONG START] Acantholippia punensis, commonly known as the Puné thornbush, is a shrub native to the Andean region of South America. It is characterized by its woody stems covered in sharp, spiny projections, which serve as a defense mechanism against herbivores. The plant produces small, clustered flowers that are typically yellow or greenish-yellow, followed by small, oval-shaped fruits. It thrives in dry, rocky habitats and is adapted to the harsh conditions of high-altitude environments. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "[WRONG START] Acantholippia punensis is primarily native to the western United States, specifically California and parts of Nevada. It is commonly found in dry, rocky habitats such as chaparral and coastal sage scrub. This plant thrives in well-drained soils and is adapted to the Mediterranean climate of the region. It is often seen in areas with full sun exposure and limited moisture. Acantholippia punensis plays an important role in the local ecosystem by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acantholippia punenis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and forest edges. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This plant is often found in Mediterranean climates due to its preference for dry, warm conditions. Its introduction has led to its establishment in several regions outside its native range. However, its impact on local ecosystems remains largely unknown."
}
