{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum mite",
    "plant_slug": "acanthophyllum-mite",
    "plant_name_scientific": "acanthophyllum mite",
    "intro": "Acanthophyllum mite, commonly known as the saxifrage mite, is a small arachnid belonging to the family Tarsonemidae. It is primarily found in arid and semi-arid environments, where it feeds on the leaves and stems of plants in the genus Acanthophyllum. These mites play a role in the ecological dynamics of their habitat by contributing to nutrient cycling through their feeding activities. They are often associated with specific plant species, indicating a degree of host specificity. Their presence can influence the growth and health of the host plants, making them an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum mite is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It thrives in sandy and gravelly soils, often found in steppes and deserts where water is scarce. This plant is well adapted to harsh environmental conditions, with deep root systems that allow it to access underground moisture. It plays an important ecological role in stabilizing soil and providing habitat for various desert organisms. Its distribution is closely linked to the availability of suitable dryland habitats across these regions.",
    "distribution_introduced_art_desc": "Acanthophyllum mite was mainly introduced to areas with arid and semi-arid climates where it can thrive in sandy or gravelly soils. It is commonly found in regions such as the southwestern United States, northern Mexico, and parts of Australia. This plant is often used for soil stabilization and erosion control due to its extensive root system. It prefers full sun and has low water requirements, making it suitable for xeriscaping. Its introduction has been both intentional and accidental, often through human activity or seed dispersal by animals."
}
