{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon quettensis",
    "plant_slug": "acantholimon-quettensis",
    "plant_name_scientific": "acantholimon quettensis",
    "intro": "Acantholimon quettensis, commonly known as the Quett's sea holly, is a flowering plant native to the coastal regions of southern California. It belongs to the family Plumbagaceae and is characterized by its striking blue or violet flowers that bloom in late summer. The plant has silver-gray foliage with a rough texture, adapted to the salty, windy conditions of its coastal habitat. It thrives in well-drained soils and is often found in dunes or along rocky shores. Acantholimon quettensis is a rare and endangered species, requiring conservation efforts to protect its natural habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon quettensis"
    },
    "taxonomy_art_desc": "Acantholimon quettensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex cellular structures and ability to photosynthesize. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their showy flowers and diverse leaf structures. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments, such as succulence and salt tolerance. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with distinctive flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon quettensis, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon quettensis is primarily native to Pakistan. This species is found in the arid and semi-arid regions of the country. It typically grows in rocky or sandy soils, often in mountainous areas. The plant is adapted to the harsh environmental conditions of its native habitat. Its distribution is limited to specific localities within Pakistan.",
    "distribution_introduced_art_desc": "Acantholimon quettensis was mainly introduced to areas with well-drained sandy or gravelly soils, often found in coastal or inland desert environments. It thrives in regions with low precipitation and high sunlight exposure, making it well-suited for arid and semi-arid climates. This plant is typically found in disturbed soils, such as those near roadsides or in areas with human activity. It has been documented in several countries across the Mediterranean and parts of Central Asia. Its introduction has been linked to both natural dispersal and human-assisted spread."
}
