{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus niger",
    "plant_slug": "acanthus-niger",
    "plant_name_scientific": "acanthus niger",
    "intro": "Acanthus niger, commonly known as black acanthus, is a striking plant native to southern Africa. It is characterized by its large, glossy, dark green leaves that are deeply lobed and often have a velvety texture. The plant produces tall spikes of small, pale yellow flowers that bloom in late summer. Acanthus niger is a perennial shrub that thrives in full sun to partial shade and well-drained soil. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus niger is primarily native to southern Africa, specifically South Africa. It is commonly found in the coastal regions and along the edges of forests in the eastern and southern parts of the country. This plant thrives in moist, sandy soils and is often seen in areas with partial shade. It is a herbaceous perennial that grows to a height of about 1 to 2 meters. Acanthus niger is known for its striking violet-blue flowers that bloom in summer.",
    "distribution_introduced_art_desc": "Acanthus niger was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its striking foliage and unique appearance. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments, making it a common sight in forested areas and along stream banks. Its rapid growth and ability to spread through rhizomes have raised concerns among conservationists."
}
