{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon diapensioides",
    "plant_slug": "acantholimon-diapensioides",
    "plant_name_scientific": "acantholimon diapensioides",
    "intro": "Acantholimon diapensioides, commonly known as the rock spurge, is a flowering plant native to the Mediterranean region. It is a perennial herb that typically grows in rocky or gravelly soils, often in dry, sunny environments. The plant features small, fleshy leaves and produces clusters of yellowish-white flowers. It is part of the family Montiaceae and is adapted to arid conditions. Due to its hardy nature, it is sometimes cultivated in gardens for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon diapensioides"
    },
    "taxonomy_art_desc": "Acantholimon diapensioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their showy flowers and sometimes medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in rocky and coastal areas, characterized by their succulent leaves and showy flowers. Its species is Acantholimon diapensioides, a specific plant within the genus Acantholimon, known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Kazakhstan",
        "Kirgizstan",
        "Pakistan",
        "Tadzhikistan",
        "Xinjiang"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon diapensioides is primarily native to Afghanistan, Kazakhstan, Kirgizstan, Pakistan, Tadzhikistan, and Xinjiang. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in rocky soils and is often seen in mountainous and steppe environments. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in its native habitats.",
    "distribution_introduced_art_desc": "Acantholimon diapensioides was mainly introduced to areas with well-drained soils and full sun exposure, typically in disturbed or open habitats. It is commonly found in regions with Mediterranean climates, such as parts of California and the Pacific Northwest. This plant has been reported in several states including Oregon, Washington, and California. It is often associated with rocky slopes and gravelly soils where it can establish itself readily. Due to its hardy nature, it has become naturalized in some areas outside its native range."
}
