{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon wilhelminae",
    "plant_slug": "acantholimon-wilhelminae",
    "plant_name_scientific": "acantholimon wilhelminae",
    "intro": "Acantholimon wilhelminae, commonly known as the Wilhelmine's thornscale, is a flowering plant native to the rocky and arid regions of the Mediterranean. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and showy, blue to violet flowers. The plant typically grows in well-drained soils and thrives in full sun, making it well adapted to harsh, dry environments. It is known for its ornamental value and is often cultivated in rock gardens and xeriscapes. Due to its limited distribution, it is considered a rare and endangered species in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon wilhelminae"
    },
    "taxonomy_art_desc": "Acantholimon wilhelminae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and complex vascular tissues. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes flowering plants often found in sandy or saline soils. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon wilhelminae, a specific type of plant native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon wilhelminae is primarily native to Iran. It is found in the mountainous regions of the country, particularly in the Zagros and Alborz mountain ranges. This plant thrives in rocky and arid environments, often growing in open habitats with well-drained soils. It is adapted to the harsh climatic conditions of its native range, including high altitudes and limited water availability. Due to its restricted distribution, it is considered a rare and endemic species within Iran.",
    "distribution_introduced_art_desc": "Acantholimon wilhelminae was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in rocky outcrops, gravelly slopes, and disturbed soils where it can thrive with minimal water. This plant is often associated with Mediterranean climates but has been introduced to other regions with similar conditions. Its introduction has been primarily through human activity, such as landscaping and accidental seed dispersal. Due to its hardy nature, it has become established in several non-native locations, sometimes outcompeting native vegetation."
}
