{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dioscoridis var. grandiflorus",
    "plant_slug": "acanthus-dioscoridis-var-grandiflorus",
    "plant_name_scientific": "acanthus dioscoridis var. grandiflorus",
    "intro": "Acanthus dioscoridis var. grandiflorus, commonly known as the large-flowered spiny acanthus, is a striking ornamental plant native to southern Europe and parts of North Africa. It is characterized by its tall, upright growth habit and large, palmately lobed leaves with spiny margins. The plant produces showy, spire-like inflorescences with violet-blue flowers that bloom in summer. It thrives in full sun to partial shade and requires well-drained soil. Due to its ornamental value, it is often cultivated in gardens and used in horticultural displays.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dioscoridis var. grandiflorus is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It thrives in rocky coastal areas and dry, sunny habitats. This variety is known for its large, showy leaves and is often found in calcareous soils. It is commonly associated with cliffs, sea shores, and rocky outcrops. The plant is also cultivated in gardens for its ornamental value.",
    "distribution_introduced_art_desc": "Acanthus dioscoridis var. grandiflorus was mainly introduced to ornamental horticulture and garden design due to its striking foliage and showy flowers. It is commonly cultivated in regions with temperate climates where it thrives in well-drained soil and full sun. This plant is valued for its architectural form and ability to add visual interest to landscapes. However, it can become invasive in certain environments if not properly managed. Its introduction has led to both aesthetic appreciation and ecological concerns in some areas."
}
