{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scabrellum var. kandilum",
    "plant_slug": "acantholimon-scabrellum-var-kandilum",
    "plant_name_scientific": "acantholimon scabrellum var. kandilum",
    "intro": "Acantholimon scabrellum var. kandilum, commonly known as the Kandil's thorned saxifrage, is a perennial flowering plant native to the mountainous regions of Turkey. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves and small, star-shaped flowers. The plant typically grows in rocky or gravelly soils at high altitudes, adapting to harsh, arid environments. It is noted for its resilience to drought and cold temperatures, making it a hardy species. Its unique morphology and ecological niche make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon scabrellum"
    },
    "taxonomy_art_desc": "Acantholimon scabrellum var. kandilum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes many succulent and halophytic species, often with distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their medicinal properties and distinctive flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky environments, characterized by their spiny stems and small, often blue or purple flowers. Its species is Acantholimon scabrellum, a specific type within the genus known for its unique morphological features and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iraq"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scabrellum var. kandilum is primarily native to Iraq. This plant is typically found in arid and semi-arid regions of the country. It thrives in rocky and sandy soils, often in mountainous areas. The species is adapted to the harsh climate conditions of the region. It plays a role in the local flora and is part of the natural vegetation of Iraq.",
    "distribution_introduced_art_desc": "Acantholimon scabrellum var. kandilum was mainly introduced to rocky and gravelly slopes in arid and semi-arid regions. It thrives in well-drained soils and is commonly found in mountainous areas with high elevation. This plant is often used for erosion control due to its hardy nature and ability to withstand harsh environmental conditions. It is also valued for its ornamental appearance, with its distinctive leaves and flowers. Its introduction has helped stabilize soil in regions prone to degradation."
}
