{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus oaxacensis",
    "plant_slug": "acanthocereus-oaxacensis",
    "plant_name_scientific": "acanthocereus oaxacensis",
    "intro": "Acanthocereus oaxacensis, commonly known as the Oaxaca cactus, is a columnar cactus native to Mexico. It features spiny, ribbed stems that are typically green and covered with white, woolly hairs. The plant produces vibrant yellow flowers that bloom at night, attracting nocturnal pollinators. It is well adapted to arid environments and requires minimal water. Its structure and growth habits make it a striking addition to desert gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus oaxacensis"
    },
    "taxonomy_art_desc": "Acanthocereus oaxacensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, which comprises flowering plants with a wide range of morphologies, including many cacti and flowering plants adapted to arid environments. Its family is Cactaceae, commonly known as cacti, which are succulent plants typically found in arid regions and characterized by their spines and water-storing stems. Its genus is Acanthocereus, a group of cacti native to Mexico and Central America, known for their cylindrical stems and nocturnal blooming flowers. Its species is Acanthocereus oaxacensis, a specific type of cactus found in Oaxaca, Mexico, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus oaxacensis is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the state of Oaxaca. It thrives in rocky soils and is commonly associated with desert scrub ecosystems. The plant is well adapted to the hot and dry climate of its native habitat. It is often seen growing on limestone outcrops and in mountainous areas within its range.",
    "distribution_introduced_art_desc": "Acanthocereus oaxacensis was mainly introduced to the United States, particularly in the southwestern states such as Texas and Arizona. It was brought in for its ornamental value due to its unique appearance and ability to thrive in arid conditions. This cactus is often cultivated in gardens and as a houseplant because of its striking spines and blooming flowers. However, it has raised concerns due to its potential to become invasive in certain environments. Its introduction has led to increased awareness about the ecological impacts of non-native plant species."
}
