{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus canoensis",
    "plant_slug": "acanthocereus-canoensis",
    "plant_name_scientific": "acanthocereus canoensis",
    "intro": "Acanthocereus canoensis, commonly known as the Sonoran prickly pear, is a cactus native to the Sonoran Desert. It is characterized by its ribbed stems and clusters of bright yellow flowers that bloom in the spring. The plant produces edible fruits, known as tunas, which are used in local cuisines. It has spiny areoles and is adapted to arid environments with minimal water requirements. Its structure and adaptations make it a resilient and ecologically significant species in its habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus canoensis"
    },
    "taxonomy_art_desc": "Acanthocereus canoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and other plants with diverse morphological adaptations. Its family is Cactaceae, commonly known as cacti, which are typically found in arid environments and are characterized by spines and succulent stems. Its genus is Acanthocereus, a group of cacti native to the Americas, known for their columnar stems and nocturnal blooming flowers. Its species is Acanthocereus canoensis, a specific type of cactus found in Mexico, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Honduras"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus canoensis is primarily native to Honduras. This cactus species is found in the dry forests and scrublands of the country. It thrives in arid and semi-arid environments, often growing on rocky soils. The plant is adapted to the tropical and subtropical climates of Central America. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acanthocereus canoensis was mainly introduced to areas with arid or semi-arid climates, particularly in regions with well-drained soils. It is commonly found in the southwestern United States, including parts of Texas, New Mexico, and Arizona. This plant thrives in full sun and is often cultivated as an ornamental due to its distinctive spiny appearance. It is also adapted to survive in harsh desert conditions with minimal water requirements. The distribution of Acanthocereus canoensis has expanded due to human activity and intentional planting in similar environments."
}
