{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon polystachyum",
    "plant_slug": "acantholimon-polystachyum",
    "plant_name_scientific": "acantholimon polystachyum",
    "intro": "Acantholimon polystachyum, commonly known as the coastal fescue, is a flowering plant native to coastal regions of southern South America. It is characterized by its grass-like appearance, with slender, erect stems and small, spike-like inflorescences. The plant produces tiny, blue to purple flowers that bloom in late summer, attracting various pollinators. It thrives in sandy or gravelly soils and is adapted to saline and windy coastal environments. Acantholimon polystachyum is often used in coastal restoration projects due to its ability to stabilize dunes and prevent erosion.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon polystachyum"
    },
    "taxonomy_art_desc": "Acantholimon polystachyum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the magnolia family. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flower structures and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon polystachyum, a specific plant within the genus Acantholimon, known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon polystachyum is primarily native to Afghanistan and Pakistan. It is commonly found in the mountainous regions of these countries. This plant thrives in rocky and arid environments. It is often associated with high-altitude habitats. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acantholimon polystachyum was mainly introduced to New Zealand. It is considered an invasive species in the region. The plant spreads rapidly and can outcompete native vegetation. It is commonly found in coastal and lowland areas. Efforts are being made to control its spread to protect local ecosystems."
}
