{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon latifolium",
    "plant_slug": "acantholimon-latifolium",
    "plant_name_scientific": "acantholimon latifolium",
    "intro": "Acantholimon latifolium, commonly known as the broadleaf sandthorn, is a flowering plant native to the Mediterranean region. It is a low-growing perennial shrub that typically reaches a height of about 30 centimeters. The plant produces small, yellow flowers that bloom in the spring, and its leaves are characterized by their broad, fleshy shape. It thrives in sandy or gravelly soils and is often found in coastal areas. The plant is adapted to withstand drought and salt spray, making it well-suited for coastal environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon latifolium is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal and inland regions, including the Sierra Nevada foothills and the Pacific Coast. This plant thrives in sandy or gravelly soils and is often associated with open habitats such as dunes, grasslands, and rocky outcrops. It is well adapted to the Mediterranean climate characterized by dry summers and mild, wet winters. Due to its specific habitat requirements, it is considered a rare and endangered species in some areas.",
    "distribution_introduced_art_desc": "Acantholimon latifolium was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed soils, such as roadsides, gravelly slopes, and open woodlands. This plant thrives in environments with low to moderate rainfall and can tolerate some drought conditions. Its introduction has been documented in several regions of California, particularly in the western United States. It is often used in xeriscaping due to its drought resistance and ornamental value."
}
