{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scorpius var. incomtum",
    "plant_slug": "acantholimon-scorpius-var-incomtum",
    "plant_name_scientific": "acantholimon scorpius var. incomtum",
    "intro": "Acantholimon scorpius var. incomtum, commonly known as the coastal flax or sea flax, is a perennial flowering plant native to the coastal regions of southern California and Baja California. It is characterized by its slender, grass-like leaves and spikes of small, blue to purple flowers that bloom in late spring to early summer. The plant thrives in sandy or gravelly soils and is adapted to coastal climates with strong winds and salt spray. It plays an important role in stabilizing dune ecosystems and providing habitat for native wildlife. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scorpius var. incomtum is primarily native to the arid and semi-arid regions of Central Asia, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in rocky and gravelly soils, often found in steppe and desert environments. This plant is well adapted to harsh climatic conditions, including extreme temperature fluctuations and limited precipitation. It is commonly encountered in open habitats with poor soil quality, where it forms part of the local vegetation. Its distribution is closely tied to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Acantholimon scorpius var. incomtum was mainly introduced to areas with dry, sandy soils and rocky habitats, often found in coastal regions. It is commonly found in disturbed sites such as roadsides, dunes, and open grasslands. This plant thrives in environments with low precipitation and high sunlight exposure. It is often mistaken for native species due to its similar appearance. Its introduction has led to concerns about its potential impact on local flora in invaded areas."
}
