{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum pungens var. subglabrusculum",
    "plant_slug": "acanthophyllum-pungens-var-subglabrusculum",
    "plant_name_scientific": "acanthophyllum pungens var. subglabrusculum",
    "intro": "Acanthophyllum pungens var. subglabrusculum, commonly known as the sandmat, is a low-growing perennial shrub native to arid and semi-arid regions of the western United States. It is characterized by its dense, mat-like growth habit and small, spiny leaves that help reduce water loss in harsh environments. The plant produces yellow flowers in late spring, which attract pollinators such as bees and butterflies. It is well adapted to sandy soils and can thrive in areas with minimal rainfall. Its hardy nature makes it an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum pungens var. subglabrusculum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant thrives in sandy and gravelly soils, often found in steppe and desert environments. It is well adapted to harsh climatic conditions, such as high temperatures and low precipitation. The variety is characterized by its sparse, spiny foliage and is commonly found in low vegetation communities. Due to its ecological significance, it plays a role in stabilizing desert soils and providing habitat for small fauna.",
    "distribution_introduced_art_desc": "Acanthophyllum pungens var. subglabrusculum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of central and western North America, particularly in the Great Basin and Mojave Desert. This plant is adapted to withstand extreme temperatures and low precipitation, making it a hardy species in harsh environments. Its introduction has been largely due to its use in erosion control and as a component of native plant communities. However, it is considered a non-native species in many of the regions where it is now established."
}
