{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon mirum",
    "plant_slug": "acantholimon-mirum",
    "plant_name_scientific": "acantholimon mirum",
    "intro": "Acantholimon mirum, commonly known as the strange sandspurry, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant is characterized by its spiny, succulent stems and small, clustered flowers that bloom in shades of pink and white. It thrives in sandy or gravelly soils and is often found in coastal dunes or inland deserts. Due to its unique morphology and limited distribution, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon mirum is primarily native to the Mediterranean region, particularly in parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky and coastal areas, as well as in dry, sandy soils. This plant thrives in temperate climates with mild, wet winters and warm, dry summers. It is often associated with limestone and calcareous substrates. Due to its limited distribution, it is considered a rare and endemic species in certain areas.",
    "distribution_introduced_art_desc": "Acantholimon mirum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed soils, such as roadsides, fields, and rocky slopes. This plant thrives in environments with moderate to high levels of sunlight and can tolerate periods of drought. Its introduction has been documented in several regions of California and parts of the Pacific Northwest. It is often considered a weed in agricultural and natural areas due to its rapid growth and spread."
}
