{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon schizostegium",
    "plant_slug": "acantholimon-schizostegium",
    "plant_name_scientific": "acantholimon schizostegium",
    "intro": "Acantholimon schizostegium, commonly known as the rock spurge, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves and small, star-shaped flowers. The plant typically grows in rocky or sandy soils and is adapted to dry, arid environments. It produces a capsule fruit containing numerous tiny seeds, which are dispersed by wind. Acantholimon schizostegium is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon schizostegium"
    },
    "taxonomy_art_desc": "Acantholimon schizostegium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flowers and often contains plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry habitats and known for their often showy flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon schizostegium, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon schizostegium is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant typically grows in rocky and arid environments, adapting to the harsh climatic conditions of the region. It is a member of the Plumbagaceae family and is known for its hardy nature. Its distribution is limited to specific habitats within Afghanistan, making it a unique and localized species.",
    "distribution_introduced_art_desc": "Acantholimon schizostegium was mainly introduced to areas with well-drained sandy or gravelly soils, often in arid or semi-arid environments. It thrives in regions with low humidity and moderate to high levels of sunlight. This plant is commonly found in coastal dunes, rocky outcrops, and disturbed sites. Its introduction has been documented in several parts of the Mediterranean and along the western coasts of North America. Due to its hardy nature, it has become established in some non-native habitats where it can outcompete native vegetation."
}
