{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon calvertii var. calvertii",
    "plant_slug": "acantholimon-calvertii-var-calvertii",
    "plant_name_scientific": "acantholimon calvertii var. calvertii",
    "intro": "Acantholimon calvertii var. calvertii, commonly known as the Calvert’s thornweed, is a perennial flowering plant native to the western United States. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its low-growing habit, with narrow leaves and clusters of small, pinkish-white flowers. It thrives in dry, sandy soils and is often found in rocky habitats. Due to its limited distribution and specific environmental requirements, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon calvertii"
    },
    "taxonomy_art_desc": "Acantholimon calvertii var. calvertii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, characterized by their spiny or prickly structures. Its species is Acantholimon calvertii, a specific variety within the genus known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon calvertii var. calvertii is primarily native to Transcaucasus, Turkey. This plant is found in the mountainous regions of these areas, where it thrives in rocky and arid environments. It is commonly associated with limestone and calcareous soils. The species is adapted to the harsh climate conditions of its native range. Its distribution is limited to specific habitats within Transcaucasus and parts of Turkey.",
    "distribution_introduced_art_desc": "Acantholimon calvertii var. calvertii was mainly introduced to areas with well-drained soils and full sun exposure, typically found in coastal and inland regions. It is commonly found in disturbed soils such as roadsides, gravelly slopes, and open habitats. This plant thrives in temperate climates with moderate rainfall and is often associated with sandy or rocky substrates. Its introduction has been noted in several states along the West Coast of the United States. It is considered a non-native species that has established itself in these environments."
}
