{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale albosetulosa",
    "plant_slug": "acanthopale-albosetulosa",
    "plant_name_scientific": "acanthopale albosetulosa",
    "intro": "Acanthopale albosetulosa, commonly known as the white-fringed acanthopale, is a flowering plant belonging to the family Apocynaceae. It is native to tropical regions of Africa and is characterized by its slender, branching stems and small, opposite leaves. The plant produces clusters of fragrant, white or pale yellow flowers that bloom during the dry season. Its flowers are typically surrounded by specialized bracts, which are often white or cream in color. Acanthopale albosetulosa is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale albosetulosa is primarily native to the tropical and subtropical regions of southern Africa, particularly in countries such as South Africa, Namibia, and Botswana. It is commonly found in savanna woodlands and grasslands with well-drained soils. This plant thrives in areas with a warm climate and moderate rainfall. It is often associated with rocky outcrops and dry riverbeds. Due to its specific habitat requirements, its distribution is relatively localized within these regions.",
    "distribution_introduced_art_desc": "Acanthopale albosetulosa was mainly introduced to areas with sandy soils and coastal environments. It thrives in regions with moderate rainfall and full sun exposure. This plant is often found in disturbed habitats such as dunes, roadsides, and agricultural fields. Its introduction has led to its spread in several regions outside its native range. It is considered an invasive species in some areas due to its rapid growth and competitive nature."
}
