{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostachys ananassoides",
    "plant_slug": "acanthostachys-ananassoides",
    "plant_name_scientific": "acanthostachys ananassoides",
    "intro": "Acanthostachys ananassoides, commonly known as the pineapple lily, is a tropical plant native to Southeast Asia. It is a herbaceous perennial that produces striking, spiky inflorescences resembling a pineapple. The plant features sword-shaped leaves with a waxy, glossy surface. It thrives in warm, humid climates and requires well-drained soil. Acanthostachys ananassoides is often cultivated for its ornamental value and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostachys ananassoides is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and moist, shaded environments. This plant thrives in humid climates with high rainfall and is often associated with disturbed or secondary growth areas. It is also occasionally found in parts of northern Australia. Its distribution is limited to these specific ecological zones where it can receive the necessary light and moisture for growth.",
    "distribution_introduced_art_desc": "Acanthostachys ananassoides was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and ease of cultivation. It is commonly found in gardens and greenhouses where it thrives in warm, humid climates with well-drained soil. The plant's introduction has led to its establishment in some areas outside its native range, raising concerns about its potential invasiveness. Its rapid growth and ability to spread through rhizomes make it a potential weed in certain environments. Proper management is recommended to prevent its unintended spread in natural ecosystems."
}
