{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus hungaricus",
    "plant_slug": "acanthus-hungaricus",
    "plant_name_scientific": "acanthus hungaricus",
    "intro": "Acanthus hungaricus, commonly known as the Hungarian acanthus, is a perennial plant native to Central Europe. It belongs to the Amaryllidaceae family and is characterized by its striking, palmate leaves and showy, spire-like inflorescences. The plant typically grows to a height of 1 to 2 meters, with lance-shaped leaves that are often covered in a waxy coating. Its flowers, which bloom in late spring to early summer, are usually white or pale blue and are surrounded by modified leaves called bracts. Acanthus hungaricus is often cultivated in gardens for its ornamental value and architectural foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus hungaricus"
    },
    "taxonomy_art_desc": "Acanthus hungaricus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Lamiales, a group of flowering plants that includes plants with showy flowers and often aromatic compounds. Its family is Acanthaceae, commonly known as the spurred-nettle family, characterized by opposite leaves and showy, often two-lipped flowers. Its genus is Acanthus, a group of flowering plants known for their spiny leaves and ornamental, often large and showy flowers. Its species is Acanthus hungaricus, a specific type of Acanthus native to Hungary, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Albania",
        "Bulgaria",
        "Greece",
        "NW. Balkan Pen.",
        "Romania",
        "Türkey-in-Europe"
    ],
    "distribution_introduced": [
        "Czechia-Slovakia"
    ],
    "distribution_native_art_desc": "Acanthus hungaricus is primarily native to Albania, Bulgaria, Greece, NW. Balkan Pen., Romania, and Turkey-in-Europe. This plant is commonly found in rocky soils and coastal areas across these regions. It thrives in Mediterranean climates with warm, dry summers and mild, wet winters. Acanthus hungaricus is often associated with limestone formations and can be seen growing on cliffs or in rocky habitats. Its distribution is largely confined to the southeastern European region.",
    "distribution_introduced_art_desc": "Acanthus hungaricus was mainly introduced to Czechia-Slovakia as an ornamental plant due to its attractive foliage and architectural appearance. It has been cultivated in gardens and public spaces, particularly in regions with temperate climates. The plant is considered non-native to the area and has established populations in certain parts of the country. Its introduction has raised concerns about its potential impact on local ecosystems. Despite its ornamental value, it is important to monitor its spread to prevent ecological disruption."
}
