{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon senganense subsp. tehranense",
    "plant_slug": "acantholimon-senganense-subsp-tehranense",
    "plant_name_scientific": "acantholimon senganense subsp. tehranense",
    "intro": "Acantholimon senganense subsp. tehranense, commonly known as the Tehran stonecress, is a perennial herb native to the high-altitude regions of Iran. It belongs to the family Montiaceae and is characterized by its basal rosette of narrow, fleshy leaves. The plant produces small, white to pale pink flowers arranged in dense clusters during the summer months. It thrives in rocky and arid environments, demonstrating remarkable drought tolerance. Its unique morphology and habitat make it an important species for ecological studies in semi-arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon senganense"
    },
    "taxonomy_art_desc": "Acantholimon senganense subsp. tehranense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants such as carnations and spinach, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon senganense, a specific type within the genus Acantholimon, which is further divided into subspecies like tehranense, often adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon senganense subsp. tehranense is primarily native to Iran. This subspecies is found in specific regions of Iran, particularly in the central and western parts of the country. It thrives in rocky and semi-arid environments, often growing on slopes and in dry grasslands. The plant is adapted to the local climate and soil conditions of its native habitat. Its distribution is limited to these specific areas within Iran.",
    "distribution_introduced_art_desc": "Acantholimon senganense subsp. tehranense was mainly introduced to arid and semi-arid regions of Iran, particularly in the central and western parts of the country. It thrives in rocky and gravelly soils, often found in mountainous areas with limited water availability. This subspecies is well adapted to high temperatures and low precipitation, making it suitable for restoration projects in degraded landscapes. Its introduction has been noted in ecological studies focusing on drought-resistant plant species. However, its distribution remains limited to specific geographic areas with suitable environmental conditions."
}
