{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis houlletiana",
    "plant_slug": "acanthorhipsalis-houlletiana",
    "plant_name_scientific": "acanthorhipsalis houlletiana",
    "intro": "Acanthorhipsalis houlletiana, commonly known as the Houllet's cactus, is a species of flowering plant native to South America. It belongs to the Cactaceae family and is characterized by its spiny stems and clusters of small, white flowers. The plant typically grows in arid or semi-arid environments, where it thrives in well-drained soil. Its foliage is often reduced to spines, with the majority of its photosynthetic function carried out by its stems. This species is valued for its ornamental appeal and is cultivated in cactus gardens worldwide.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis houlletiana is primarily native to the Caribbean region, specifically the islands of the Greater Antilles. It is found in countries such as Cuba, Hispaniola, and Jamaica. This plant thrives in tropical and subtropical environments, often growing in shaded or semi-shaded areas within forest understories. It is commonly associated with rocky or limestone soils, which are prevalent in its native habitat. Due to its specific ecological requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis houlletiana was mainly introduced to regions with warm, humid climates where it can thrive in partial shade to full sun. It is commonly found in tropical and subtropical areas, particularly in parts of Southeast Asia and the Pacific Islands. This plant is often cultivated for its ornamental value due to its unique foliage and ability to tolerate a range of soil conditions. It has been introduced to various horticultural markets, especially in regions with mild winters. However, its introduction has raised concerns about its potential impact on local ecosystems if it becomes invasive."
}
