{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon anatolicum",
    "plant_slug": "acantholimon-anatolicum",
    "plant_name_scientific": "acantholimon anatolicum",
    "intro": "Acantholimon anatolicum, commonly known as Anatolian thimbleweed, is a flowering plant native to Turkey. It belongs to the family Plumbagaceae and is characterized by its erect, branched stems and small, blue to violet flowers. The plant typically grows in rocky or sandy soils and is adapted to arid environments. Its leaves are usually narrow and hairy, helping to reduce water loss. It plays a role in stabilizing soil in its native habitat and is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon anatolicum"
    },
    "taxonomy_art_desc": "Acantholimon anatolicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often show adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon anatolicum, a specific plant native to Turkey, known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon anatolicum is primarily native to Turkey. It is found in the eastern and central regions of the country, particularly in the Taurus and Pontic Mountains. This plant typically grows in rocky and limestone areas, often in semi-arid or mountainous environments. It is well adapted to the local climate and soil conditions. Its distribution is limited to specific ecological niches within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon anatolicum was mainly introduced to areas with well-drained sandy or gravelly soils, often found in coastal and inland regions. It thrives in temperate climates with moderate rainfall and full sun exposure. This plant is commonly found in disturbed sites such as roadsides, fields, and waste areas. It is known for its drought tolerance and ability to colonize open, sunny habitats. Its distribution is largely limited by soil type and climate conditions, making it a characteristic species of Mediterranean and semi-arid environments."
}
