{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon marmoreum",
    "plant_slug": "acantholimon-marmoreum",
    "plant_name_scientific": "acantholimon marmoreum",
    "intro": "Acantholimon marmoreum, commonly known as the marble rockweed, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features slender, succulent stems and small, blue to violet flowers that bloom in summer. Its leaves are often covered in a waxy coating, which helps reduce water loss in its harsh environment. Acantholimon marmoreum is adapted to rocky and sandy soils, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon marmoreum is primarily native to the Mediterranean region, particularly in parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky and coastal areas, often growing in dry, well-drained soils. This plant thrives in environments with mild winters and warm, sunny summers. It is often associated with Mediterranean maquis and scrubland vegetation. Its distribution is closely linked to the specific climatic and geological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon marmoreum was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for its ornamental value due to its attractive, succulent-like foliage and flowering capabilities. This plant thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. However, it has become invasive in some areas, outcompeting native vegetation. Its spread has raised concerns among land managers and conservationists."
}
