{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon avenaceum f. simplicior",
    "plant_slug": "acantholimon-avenaceum-f-simplicior",
    "plant_name_scientific": "acantholimon avenaceum f. simplicior",
    "intro": "Acantholimon avenaceum f. simplicior, commonly known as the simpleleaf stonecrop, is a low-growing perennial plant native to the arid regions of central Asia. It features succulent, fleshy leaves that are typically gray-green in color, adapted to store water and reduce transpiration. The plant produces small, star-shaped flowers in shades of blue or purple during the summer months. It thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. This subspecies is notable for its compact growth habit and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon avenaceum f. simplicior is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Tajikistan. This plant thrives in rocky and gravelly soils, often found in mountainous and steppe environments. It is adapted to withstand extreme temperature fluctuations and limited water availability. The subspecies is particularly common in the Tian Shan and Pamir mountain ranges. Due to its specific habitat requirements, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acantholimon avenaceum f. simplicior was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as coastal dunes, rocky slopes, and disturbed ground. It thrives in regions with moderate to high levels of sunlight and is adapted to arid or semi-arid climates. This plant is commonly found in Mediterranean-type ecosystems, where it plays a role in stabilizing soils and providing habitat for small invertebrates. Its introduction has been primarily through human activity, such as landscaping and restoration projects. However, it is considered a non-invasive species that does not typically outcompete native flora in its introduced range."
}
