{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon mobayenii",
    "plant_slug": "acantholimon-mobayenii",
    "plant_name_scientific": "acantholimon mobayenii",
    "intro": "Acantholimon mobayenii, commonly known as the Persian thornweed, is a flowering plant native to the arid regions of central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves and spiny stems. The plant produces small, white or pink flowers that bloom in late summer. It is adapted to survive in harsh, dry environments with minimal water. Acantholimon mobayenii is often found in rocky soils and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon mobayenii"
    },
    "taxonomy_art_desc": "Acantholimon mobayenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the lead plant family, which includes plants with showy flowers and often found in arid environments. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon mobayenii, a specific type of plant within the genus Acantholimon, native to certain regions of the Middle East and known for its unique adaptations to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon mobayenii is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky and sandy soils, often in mountainous areas. Its distribution is limited to specific habitats within Iran, where it thrives in dry and harsh conditions. The plant is part of the Caryophyllaceae family and is adapted to the local climate and soil types.",
    "distribution_introduced_art_desc": "Acantholimon mobayenii was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as coastal dunes, rocky slopes, and disturbed sites. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant is typically found in southern California, parts of Nevada, and Baja California, where it has adapted to the arid and semi-arid environments. Its introduction has been largely limited to its native range, though it has occasionally spread to nearby areas with similar ecological conditions. Due to its hardy nature, it is sometimes cultivated in gardens and landscapes that mimic its natural habitat."
}
