{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus arborescens",
    "plant_slug": "acanthus-arborescens",
    "plant_name_scientific": "acanthus arborescens",
    "intro": "Acanthus arborescens, commonly known as the tree acanthus, is a striking perennial plant native to the Mediterranean region. It features large, palmately lobed leaves that are often covered in a dense layer of soft, white to grayish hairs. The plant produces showy, spire-like inflorescences with purple to violet flowers that bloom in late spring to early summer. Its robust growth habit and ornamental foliage make it a popular choice for garden landscapes. However, it is important to note that it can be invasive in certain regions if not properly managed.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus arborescens is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in coastal areas and rocky habitats, often found along the shores of the Mediterranean Sea. This plant is well adapted to saline and dry conditions, making it a common sight in coastal landscapes. It is also found in the Canary Islands and parts of southern Italy. Its native range includes regions with a climate characterized by warm, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acanthus arborescens was mainly introduced to ornamental horticulture and landscaping due to its striking, palm-like foliage and showy flowers. It is commonly found in gardens and cultivated areas where it is valued for its aesthetic appeal. The plant has been widely distributed in temperate regions of Europe, North America, and parts of Asia. Its introduction has led to its establishment in some natural habitats, raising concerns about its potential invasiveness. Despite its ornamental popularity, it is generally considered a non-native species in most regions where it is cultivated."
}
