{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus neoguineensis",
    "plant_slug": "acanthus-neoguineensis",
    "plant_name_scientific": "acanthus neoguineensis",
    "intro": "Acanthus neoguineensis, commonly known as the New Guinea acanthus, is a striking member of the Acanthaceae family. It is native to the tropical regions of New Guinea and surrounding areas, where it thrives in humid, shaded environments. The plant is characterized by its large, velvety leaves that are often adorned with intricate patterns and deep veins. Its showy, spiky flowers, which range in color from white to purple, bloom in clusters during the wet season. Acanthus neoguineensis is valued both for its ornamental beauty and its role in traditional medicine in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus neoguineensis is primarily native to the tropical regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, shaded environments with rich, well-drained soil. It is often associated with coastal and riverine habitats. Its native distribution is largely confined to the islands of New Guinea and surrounding archipelagos.",
    "distribution_introduced_art_desc": "Acanthus neoguineensis was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and floral displays. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and public spaces. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of garden environments. Its introduction has been largely confined to regions with a warm climate, where it can grow year-round. However, it is not typically considered invasive in its introduced range."
}
