{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon koelzii",
    "plant_slug": "acantholimon-koelzii",
    "plant_name_scientific": "acantholimon koelzii",
    "intro": "Acantholimon koelzii, commonly known as the Koelz's thornweed, is a flowering plant native to the high-altitude regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its spiny stems and small, blue to purple flowers. The plant typically grows in rocky or sandy soils and is adapted to cold, arid environments. It is a perennial herb that produces small, capsule-like fruits containing seeds. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon koelzii"
    },
    "taxonomy_art_desc": "Acantholimon koelzii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive flowers and often specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon koelzii, a specific plant within the genus Acantholimon, known for its unique morphology and adaptation to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon koelzii is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant typically grows in rocky or gravelly soils at higher elevations. It is adapted to the arid and semi-arid climates of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon koelzii was mainly introduced to gardens and horticultural collections due to its ornamental value and unique appearance. It is commonly cultivated in regions with temperate climates where it thrives in well-drained soils. This plant is often used in rock gardens and as a border plant because of its compact growth habit and attractive foliage. It requires full sun to partial shade and is relatively low maintenance once established. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
