{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon androsaceum var. purpurascens",
    "plant_slug": "acantholimon-androsaceum-var-purpurascens",
    "plant_name_scientific": "acantholimon androsaceum var. purpurascens",
    "intro": "Acantholimon androsaceum var. purpurascens, commonly known as the purple-flowered sand-rose, is a low-growing perennial plant native to the Mediterranean region. It features succulent, fleshy leaves that help it retain moisture in arid conditions. The plant produces small, showy flowers in shades of pink to purple, typically blooming in spring. It thrives in well-drained soils and full sun, making it a hardy choice for rock gardens. Its unique appearance and drought tolerance make it a desirable addition to xeriscaping and coastal landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon androsaceum var. purpurascens is primarily native to the Mediterranean region, specifically the eastern part of the Mediterranean Basin. It is found in countries such as Turkey, Syria, Lebanon, and parts of Israel. This plant typically grows in rocky or limestone soils in dry, sunny environments. It is often found in coastal areas and mountainous regions with limited moisture. Its distribution is restricted to specific microhabitats, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acantholimon androsaceum var. purpurascens was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal grasslands and sandy soils along the Pacific coast. This plant is often associated with disturbed habitats such as roadsides and dunes. It thrives in areas with mild, wet winters and dry summers. Due to its ornamental value, it has been cultivated in some regions for landscaping purposes."
}
