{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dusenii",
    "plant_slug": "acanthus-dusenii",
    "plant_name_scientific": "acanthus dusenii",
    "intro": "Acanthus dusenii, commonly known as the Sierra acanthus, is a species of flowering plant native to the western United States. It belongs to the Acanthaceae family and is characterized by its striking, palmate leaves and showy, spires of violet-blue flowers. This plant typically grows in rocky habitats and is adapted to arid or semi-arid environments. It is often found in California and parts of Nevada, thriving in well-drained soils. Due to its ornamental value and ecological significance, it is sometimes cultivated in gardens and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dusenii is primarily native to the mountainous regions of western China, specifically in the Sichuan and Yunnan provinces. It grows in rocky, well-drained soils at high elevations, often in forested or alpine environments. This species is adapted to the cool and moist conditions found in these regions. It is a rare and endemic plant, found only in specific areas of the Tibetan Plateau. Due to its limited distribution, it is considered a vulnerable species.",
    "distribution_introduced_art_desc": "Acanthus dusenii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded environments such as forest floors and along stream banks. This plant is often seen in gardens and naturalized areas due to its ornamental value. It has spread beyond its original introduction range, becoming a common sight in wetland habitats. However, its presence is sometimes considered a weed in certain ecological contexts."
}
