{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum fontanesii",
    "plant_slug": "acanthophyllum-fontanesii",
    "plant_name_scientific": "acanthophyllum fontanesii",
    "intro": "Acanthophyllum fontanesii, commonly known as the desert sandburs, is a flowering plant native to arid and semi-arid regions of North America. It is a member of the Amaranthaceae family and is characterized by its spiny, bristly seed heads that are adapted for wind dispersal. The plant typically grows in sandy or gravelly soils and is well-suited to harsh, dry environments. Its leaves are usually small and succulent, helping to conserve water in low-resource conditions. Acanthophyllum fontanesii plays a role in stabilizing dunes and providing habitat for small desert organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum fontanesii is primarily native to the arid and semi-arid regions of Central Asia, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils within the steppes and desert landscapes of these areas. This plant is well adapted to the harsh environmental conditions, including high temperatures and low precipitation. It often grows in association with other xerophytic species, forming part of the local vegetation community. Its distribution is closely linked to the availability of suitable habitats in these dry regions.",
    "distribution_introduced_art_desc": "Acanthophyllum fontanesii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in ecological restoration projects due to its ability to thrive in harsh environmental conditions. This plant is particularly effective in areas with low rainfall and poor soil quality. Its deep root system helps retain moisture and improve soil structure. However, it is important to manage its spread to avoid potential invasiveness in non-target habitats."
}
