{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthyllis numidica",
    "plant_slug": "acanthyllis-numidica",
    "plant_name_scientific": "acanthyllis numidica",
    "intro": "Acanthyllis numidica, commonly known as the Numidian thornveld, is a flowering plant native to southern Africa. It belongs to the Fabaceae family, which includes legumes, and is characterized by its small, pea-like flowers. The plant typically grows in dry, sandy soils and is adapted to arid environments. It has hairy stems and leaves, and its flowers are often pink or purple in color. Acanthyllis numidica is an important component of the local flora and plays a role in supporting pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthyllis numidica is primarily native to North Africa, particularly countries such as Algeria, Tunisia, and Morocco. It is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. This plant thrives in Mediterranean climates and is adapted to withstand drought conditions. It is typically found in open habitats like steppes, coastal dunes, and limestone areas. Its distribution is also occasionally reported in southern Europe, though it is more prominently associated with its native range in North Africa.",
    "distribution_introduced_art_desc": "Acanthyllis numidica was mainly introduced to new habitats outside its native range, often through human activity such as trade or accidental transport. It has been reported in several regions including parts of Europe, North Africa, and the Middle East. This plant is typically found in disturbed soils and open areas, which facilitates its spread. Its introduction may lead to competition with native species and alter local ecosystems. Due to its adaptability, it has become a concern in some areas where it invades natural habitats."
}
