{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum polyrhaphium",
    "plant_slug": "acanthophyllum-polyrhaphium",
    "plant_name_scientific": "acanthophyllum polyrhaphium",
    "intro": "Acanthophyllum polyrhaphium, commonly known as the desert holly, is a shrub native to arid regions of Central Asia. It is characterized by its spiny, fleshy leaves and small, yellow flowers that bloom in the summer. The plant is adapted to survive in harsh, dry environments with minimal water availability. Its root system is deep and extensive, allowing it to access groundwater. It plays an important ecological role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum polyrhaphium is primarily native to Afghanistan. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in sandy and rocky soils, often in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is largely restricted to specific ecological zones within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum polyrhaphium was mainly introduced to areas with arid and semi-arid climates, particularly in regions with well-drained sandy or gravelly soils. It is commonly found in desert environments where it plays a role in stabilizing dunes and preventing soil erosion. This plant is adapted to withstand high temperatures and low precipitation, making it a valuable species for ecological restoration projects. Its introduction has been noted in several parts of the Middle East and Central Asia. However, it is important to monitor its spread to prevent potential competition with native flora."
}
