{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium glabrum",
    "plant_slug": "acanthodium-glabrum",
    "plant_name_scientific": "acanthodium glabrum",
    "intro": "Acanthodium glabrum, commonly known as the smooth acanthodium, is a flowering plant species belonging to the Asteraceae family. It is characterized by its small, daisy-like flowers with yellow disc flowers and white to pale pink ray florets. The plant typically grows in dry, sandy soils and is native to parts of southern Africa. It has hairy stems and narrow, grass-like leaves that are usually arranged in a rosette pattern. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium glabrum is primarily native to the western United States, particularly in California and Nevada. It thrives in arid and semi-arid environments, often found in rocky soils and open areas. This plant is commonly associated with coastal scrub and chaparral habitats. It is well adapted to withstand drought conditions and high temperatures. Its distribution is limited to specific regions where its ecological requirements are met.",
    "distribution_introduced_art_desc": "Acanthodium glabrum was mainly introduced to new environments through human activity, such as accidental transport via contaminated soil or machinery. It is commonly found in disturbed areas like roadsides, fields, and along riverbanks. This plant has adapted well to a variety of soil types and can thrive in both full sun and partial shade. Its rapid growth and ability to spread vegetatively make it a potential invasive species in some regions. However, its impact on native ecosystems is still being studied."
}
