{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon lycaonicum subsp. cappadocicum",
    "plant_slug": "acantholimon-lycaonicum-subsp-cappadocicum",
    "plant_name_scientific": "acantholimon lycaonicum subsp. cappadocicum",
    "intro": "Acantholimon lycaonicum subsp. cappadocicum, commonly known as Cappadocian sandthrift, is a perennial flowering plant native to Turkey. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features silver-gray foliage and produces small, yellowish flowers during the summer months. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. This subspecies is valued for its ornamental appeal and ability to stabilize soils in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon lycaonicum"
    },
    "taxonomy_art_desc": "Acantholimon lycaonicum subsp. cappadocicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and multicellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments, such as cacti and amaranths. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes herbs and shrubs often found in rocky or sandy soils, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon lycaonicum, a specific plant within this genus native to certain regions of Turkey, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon lycaonicum subsp. cappadocicum is primarily native to Turkey. This subspecies is found in the central and eastern regions of the country. It thrives in rocky and arid environments, particularly in the Cappadocia area. The plant is adapted to the semi-arid climate and well-drained soils of its native habitat. It is a member of the Plumbagaceae family and is known for its resilience in harsh conditions.",
    "distribution_introduced_art_desc": "Acantholimon lycaonicum subsp. cappadocicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in dry to semi-arid environments. It is commonly found in rocky or gravelly habitats, often growing on slopes or among shrubs. This subspecies is adapted to withstand drought conditions and has a low-growing, mat-forming structure. It is valued for its ornamental appeal and ability to thrive in xerophytic landscapes. Due to its resilience, it has been introduced to various regions outside its native range for landscaping and erosion control purposes."
}
