{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon vvedenskyi",
    "plant_slug": "acantholimon-vvedenskyi",
    "plant_name_scientific": "acantholimon vvedenskyi",
    "intro": "Acantholimon vvedenskyi, commonly known as the Vvedensky's thornweed, is a perennial flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its upright growth habit and dense, spiny foliage. The plant produces small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon vvedenskyi"
    },
    "taxonomy_art_desc": "Acantholimon vvedenskyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex cellular structures and ability to photosynthesize. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often possessing spore-producing structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their specialized floral structures and adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry and saline environments, known for their often colorful flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon vvedenskyi, a specific plant species native to certain regions of Russia, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon vvedenskyi is primarily native to Uzbekistan. This species is found in the arid and semi-arid regions of the country. It typically grows in rocky or sandy soils, often in mountainous or steppe areas. The plant is adapted to the harsh climate conditions of Central Asia. Its distribution is limited to specific habitats within Uzbekistan.",
    "distribution_introduced_art_desc": "Acantholimon vvedenskyi was mainly introduced to the Mediterranean region as an ornamental plant due to its unique appearance and drought tolerance. It is commonly found in gardens and landscaped areas where it thrives in well-drained soils and full sun. This species has been reported in several European countries, including Spain, Italy, and France. Its introduction has raised concerns about its potential to invade native habitats and compete with local flora. Despite its aesthetic appeal, it is considered a non-native species with limited ecological impact in most regions."
}
