{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum raphiophyllum",
    "plant_slug": "acanthophyllum-raphiophyllum",
    "plant_name_scientific": "acanthophyllum raphiophyllum",
    "intro": "Acanthophyllum raphiophyllum, commonly known as the red sand verbena, is a flowering plant native to the arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its succulent, fleshy leaves and vibrant red or pink flowers. The plant is well adapted to harsh, dry environments, storing water in its thick stems and leaves. It typically grows in sandy or gravelly soils and is often found in desert or semi-desert habitats. Its striking appearance makes it a notable species in its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum raphiophyllum"
    },
    "taxonomy_art_desc": "Acanthophyllum raphiophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their distinctive whorled leaves and jointed stems. Its subclass is Magnoliidae, a large group of flowering plants that includes many familiar species, characterized by their diverse flower structures and evolutionary relationships. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contain specialized pigments like betalains. Its family is Caryophyllaceae, commonly known as the carnation family, which includes a variety of flowering plants with often showy, clustered flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their small, spiny leaves and compact growth forms. Its species is Acanthophyllum raphiophyllum, a specific plant within this genus known for its adaptations to harsh, dry environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum raphiophyllum is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions within the country. This plant thrives in sandy or gravelly soils, often in desert or steppe environments. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to specific ecological zones in Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum raphiophyllum was mainly introduced to regions with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in desert environments, particularly in areas with low precipitation and high temperatures. This plant is often used for soil stabilization due to its extensive root system and ability to prevent erosion. It is also valued for its hardy nature, making it suitable for restoration projects in degraded landscapes. Its introduction has helped in reclaiming land in parts of North Africa and the Middle East."
}
