{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium andreaeanum",
    "plant_slug": "acanthocalycium-andreaeanum",
    "plant_name_scientific": "acanthocalycium andreaeanum",
    "intro": "Acanthocalycium andreaeanum, commonly known as the Andean prickly pear, is a species of cactus native to the Andes Mountains. It is characterized by its dense, spiny stems and clusters of yellow flowers that bloom in the spring. The plant has a compact growth habit and is well adapted to high-altitude environments with cool temperatures. Its leaves are modified into spines, reducing water loss in arid conditions. It is a popular choice for rock gardens and xeriscaping due to its hardiness and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium andreaeanum is primarily native to the western United States, specifically California and Nevada. It is found in regions with arid and semi-arid climates, particularly in the Mojave Desert and surrounding areas. This species typically grows in rocky soils and is often associated with limestone formations. It is a member of the Cactaceae family and is known for its distinctive spiny stems and small, yellow flowers. Due to its limited habitat, it is considered a rare and endangered species within its native range.",
    "distribution_introduced_art_desc": "Acanthocalycium andreaeanum was mainly introduced to the United States, particularly in regions with arid or semi-arid climates. It is commonly found in states such as Arizona, Nevada, and California, where it thrives in well-drained sandy soils. This species is often cultivated in desert gardens and rockeries due to its unique appearance and low maintenance requirements. It has also been reported in parts of southern Utah and western Texas. Despite its ornamental value, it is considered a non-native species in these areas."
}
