{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium vitiense",
    "plant_slug": "acanthophippium-vitiense",
    "plant_name_scientific": "acanthophippium vitiense",
    "intro": "Acanthophippium vitiense, commonly known as the Vitiense Ctenanthus, is a flowering plant native to tropical regions of the Pacific. It belongs to the family Rubiaceae, which includes coffee and gardenias. The plant is characterized by its evergreen foliage and clusters of small, fragrant white flowers. It thrives in humid, shaded environments and is often found in coastal areas. Due to its ornamental value, it is cultivated in some tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium vitiense is primarily native to the Pacific Islands, particularly Tonga and Fiji. It is commonly found in coastal areas and lowland forests, where it thrives in moist, well-drained soils. This plant is often associated with humid tropical climates and is typically found in shaded undergrowth. Its distribution is limited to specific regions within the South Pacific, where it plays a role in local ecosystems. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthophippium vitiense was mainly introduced to new habitats through human activities such as horticulture and land clearing. It has been found growing in disturbed areas, including roadsides and abandoned fields. The plant's ability to thrive in poor soil conditions has contributed to its spread in non-native regions. It is often considered an invasive species in areas where it has become established. Its introduction has raised concerns about its impact on local ecosystems and native plant species."
}
