{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthinophyllum spruceanum",
    "plant_slug": "acanthinophyllum-spruceanum",
    "plant_name_scientific": "acanthinophyllum spruceanum",
    "intro": "Acanthinophyllum spruceanum, commonly known as the Spruce's acanthinophyllum, is a flowering plant belonging to the family Acanthaceae. It is characterized by its distinctive foliage, featuring lance-shaped leaves with a slightly hairy surface. The plant produces clusters of small, tubular flowers that are typically pink or purple in color. It thrives in tropical and subtropical regions, often found in moist, shaded environments. Due to its ornamental value, it is occasionally cultivated in botanical gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthinophyllum spruceanum is primarily native to the southern regions of South America, particularly in Brazil, Paraguay, and Argentina. It is commonly found in subtropical and tropical climates, often growing in areas with well-drained soils. This plant thrives in open woodlands and grasslands, where it can receive adequate sunlight. It is adapted to seasonal rainfall patterns and can tolerate periods of drought. Due to its specific habitat requirements, its distribution is relatively limited to these geographic regions.",
    "distribution_introduced_art_desc": "Acanthinophyllum spruceanum was mainly introduced to the coastal regions of southern Africa, particularly in South Africa and Namibia. It thrives in sandy and gravelly soils along the shoreline, where it forms dense mats that stabilize dunes and prevent erosion. This plant is commonly found in areas with high salinity and strong winds, making it well adapted to harsh coastal environments. It is often used in restoration projects due to its ability to colonize disturbed sites quickly. However, its spread can sometimes lead to the displacement of native vegetation if not managed properly."
}
