{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum hispidum",
    "plant_slug": "acanthospermum-hispidum",
    "plant_name_scientific": "acanthospermum hispidum",
    "intro": "Acanthospermum hispidum, commonly known as the hairy acanthospermum, is a flowering plant native to tropical and subtropical regions. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant has hairy stems and leaves, which contribute to its common name. It produces small, yellowish flowers that are typically arranged in clusters. Acanthospermum hispidum is often found in disturbed soils and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthospermum",
        "species": "Acanthospermum hispidum"
    },
    "taxonomy_art_desc": "Acanthospermum hispidum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall and complex reproductive structures. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Asterales, which consists of flowering plants with showy flowers, often with a composite structure, and includes economically important plants like sunflowers and daisies. Its family is Asteraceae, commonly known as the sunflower family, characterized by their composite flower heads and a wide variety of ecological and economic significance. Its genus is Acanthospermum, a group of flowering plants typically found in tropical and subtropical regions, known for their hairy stems and small flowers. Its species is Acanthospermum hispidum, a specific plant within this genus characterized by its hairy appearance and adaptation to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "El Salvador",
        "French Guiana",
        "Guatemala",
        "Guyana",
        "Haiti",
        "Honduras",
        "Leeward Is.",
        "Netherlands Antilles",
        "Nicaragua",
        "Paraguay",
        "Peru",
        "Puerto Rico",
        "Suriname",
        "Trinidad-Tobago",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_introduced": [
        "Alabama",
        "Angola",
        "Assam",
        "Bangladesh",
        "Belgium",
        "Benin",
        "Botswana",
        "Burkina",
        "Cameroon",
        "Cape Verde",
        "Central African Republic",
        "Chad",
        "China South-Central",
        "China Southeast",
        "Comoros",
        "Congo",
        "DR Congo",
        "East Himalaya",
        "Egypt",
        "Equatorial Guinea",
        "Eritrea",
        "Ethiopia",
        "Florida",
        "Gabon",
        "Georgia",
        "Guinea",
        "Guinea-Bissau",
        "Gulf of Guinea Is.",
        "Hawaii",
        "India",
        "Ivory Coast",
        "KwaZulu-Natal",
        "Laccadive Is.",
        "Liberia",
        "Madagascar",
        "Maldives",
        "Mali",
        "Marquesas",
        "Mauritania",
        "Mauritius",
        "Mozambique",
        "Namibia",
        "Nepal",
        "New Guinea",
        "New Jersey",
        "New South Wales",
        "New York",
        "Nigeria",
        "Northern Provinces",
        "Northern Territory",
        "Oman",
        "Ontario",
        "Oregon",
        "Philippines",
        "Primorye",
        "Queensland",
        "Rodrigues",
        "Réunion",
        "Socotra",
        "South Carolina",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Thailand",
        "Togo",
        "Virginia",
        "West Himalaya",
        "Western Australia",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acanthospermum hispidum is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Colombia, Costa Rica, Cuba, Dominican Republic, El Salvador, French Guiana, Guatemala, Guyana, Haiti, Honduras, Leeward Is., Netherlands Antilles, Nicaragua, Paraguay, Peru, Puerto Rico, Suriname, Trinidad-Tobago, Venezuela, and Windward Is. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in open habitats such as grasslands, disturbed soils, and along roadsides. It is often associated with disturbed or secondary vegetation. Its wide distribution suggests adaptability to various environmental conditions within its native range.",
    "distribution_introduced_art_desc": "Acanthospermum hispidum was mainly introduced to regions across Africa, Asia, and the Americas, including countries such as Alabama, Angola, Bangladesh, Belgium, and Florida. It has been reported in diverse habitats ranging from coastal areas to inland regions, indicating its adaptability to various environmental conditions. The plant's introduction spans multiple continents, suggesting either natural dispersal or human-assisted spread through trade or horticultural activities. It is particularly common in tropical and subtropical zones, where it thrives in disturbed soils and open habitats. This widespread distribution highlights its ecological significance and potential impact on local ecosystems."
}
