{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum bracteatum var. kandaharicum",
    "plant_slug": "acanthophyllum-bracteatum-var-kandaharicum",
    "plant_name_scientific": "acanthophyllum bracteatum var. kandaharicum",
    "intro": "Acanthophyllum bracteatum var. kandaharicum, commonly known as the Kandahar spiny bush, is a low-growing shrub native to arid and semi-arid regions of Central Asia. It features dense clusters of spiny, leaf-like structures that help reduce water loss and protect against herbivory. The plant produces small, pale yellow flowers during the summer months, which are adapted for pollination by wind and insects. Its root system is extensive, allowing it to access deep groundwater in nutrient-poor soils. This species is well-suited for xerophytic environments and plays a role in stabilizing sandy soils in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum bracteatum var. kandaharicum is primarily native to Central Asia, particularly Afghanistan and parts of Pakistan. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. This plant is well adapted to the harsh climate of its native region, with drought-resistant features. It is commonly found in mountainous areas and along the edges of deserts. Its distribution is closely linked to the specific ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acanthophyllum bracteatum var. kandaharicum was mainly introduced to areas with arid and semi-arid climates, particularly in regions of Central Asia and parts of the Middle East. It thrives in sandy and gravelly soils, often found in desert and steppe environments. This plant is commonly used for dune stabilization due to its extensive root system and ability to withstand harsh environmental conditions. It has been introduced for ecological restoration and land rehabilitation projects in several countries. Its introduction has helped in preventing soil erosion and maintaining biodiversity in degraded landscapes."
}
