{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax bockii",
    "plant_slug": "acanthopanax-bockii",
    "plant_name_scientific": "acanthopanax bockii",
    "intro": "Acanthopanax bockii, commonly known as the Bock's spurgewood, is a deciduous shrub native to the mountainous regions of East Asia. It belongs to the family Euphorbiaceae and is characterized by its compound leaves and clusters of small, yellowish flowers. The plant produces woody, branched stems that can grow up to several meters in height. It thrives in temperate climates and is often found in forested areas with well-drained soil. Acanthopanax bockii is valued for its ornamental qualities and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax bockii is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in forested areas, particularly in temperate and subtropical regions. This plant thrives in moist, well-drained soils and is often associated with mountainous habitats. It is known for its climbing habit and is sometimes used in traditional medicine. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthopanax bockii was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It thrives in regions with moderate rainfall and sufficient sunlight. This plant is commonly used in traditional medicine for its purported health benefits. Its introduction has been documented in several parts of Asia, including China and Korea. However, its spread is limited due to specific environmental requirements."
}
