{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocaulon pruriens",
    "plant_slug": "acanthocaulon-pruriens",
    "plant_name_scientific": "acanthocaulon pruriens",
    "intro": "Acanthocaulon pruriens, commonly known as the itching bush, is a shrub native to tropical regions of Africa and Asia. It belongs to the family Rubiaceae and is characterized by its small, clustered flowers and hairy, sometimes prickly leaves. The plant is known for its medicinal properties, with various parts used in traditional medicine to treat ailments such as skin conditions and inflammation. It thrives in moist, shaded environments and is often found in forest understories. Its scientific name reflects its physical features, with \"acanthocaulon\" referring to its thorny stems and \"pruriens\" indicating its itchy or irritating properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocaulon pruriens is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, and parts of Southeast Asia. It thrives in humid environments, often found in dense forests and undergrowth. This plant is commonly associated with moist, shaded areas and is often seen growing on trees or shrubs. It is particularly prevalent in the Indian subcontinent, where it has been traditionally used in herbal medicine. Its distribution is closely linked to the availability of suitable microhabitats and climatic conditions.",
    "distribution_introduced_art_desc": "Acanthocaulon pruriens was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in the understory of forests or in grasslands where it can receive adequate light. Its introduction has been associated with human activities, including land clearing and accidental seed dispersal. Due to its adaptability, it has become a common weed in several parts of its introduced range."
}
