{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia salsoloides",
    "plant_slug": "acantholippia-salsoloides",
    "plant_name_scientific": "acantholippia salsoloides",
    "intro": "Acantholippia salsoloides, commonly known as desert sandmat, is a low-growing perennial plant native to arid and semi-arid regions of North America. It typically features succulent, fleshy leaves that help it retain moisture in harsh environments. The plant produces small, yellowish flowers that bloom in the spring, attracting various pollinators. Its root system is extensive, allowing it to access water from deeper soil layers. Acantholippia salsoloides is well adapted to sandy soils and can thrive in areas with minimal rainfall.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholippia salsoloides is primarily native to the western United States, particularly in California and Nevada. It is commonly found in arid and semi-arid regions, including deserts and coastal sage scrub habitats. This plant thrives in well-drained soils and is adapted to harsh environmental conditions. It is often seen in disturbed areas such as roadsides and open fields. Its distribution is closely tied to the specific ecological conditions of the western deserts.",
    "distribution_introduced_art_desc": "Acantholippia salsoloides was mainly introduced to areas with disturbed soils and arid or semi-arid climates, often as a result of human activities such as agriculture and land clearing. It is commonly found in regions with low precipitation and poor soil quality, where it can thrive in harsh environmental conditions. This plant is known for its ability to colonize open areas quickly, making it a potential invasive species in certain ecosystems. Its introduction has been documented in several parts of the world, including North America and Australia. Due to its adaptability, it can outcompete native vegetation, leading to changes in local biodiversity."
}
