{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax divaricatus var. inermis",
    "plant_slug": "acanthopanax-divaricatus-var-inermis",
    "plant_name_scientific": "acanthopanax divaricatus var. inermis",
    "intro": "Acanthopanax divaricatus var. inermis, commonly known as the unarmed Chinese dogwood, is a shrub native to eastern Asia. It is characterized by its compound leaves, which are typically pinnately arranged with serrated margins. The plant produces small, greenish-yellow flowers that are clustered in umbels, followed by red berries that are edible for some bird species. It thrives in moist, shaded environments and is often found in forest understories. This variety is distinguished by the absence of thorns on its stems, unlike its closely related species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax divaricatus var. inermis is primarily native to eastern Asia, including regions of China, Korea, and Japan. It is commonly found in mountainous areas with temperate climates. This variant thrives in forested habitats, often growing as a shrub or small tree. It is particularly prevalent in the provinces of Yunnan, Sichuan, and Zhejiang in China. The plant is well adapted to the cool, humid conditions of its native range.",
    "distribution_introduced_art_desc": "Acanthopanax divaricatus var. inermis was mainly introduced to regions with temperate to subtropical climates, where it thrives in moist, well-drained soils. It is commonly found in shaded to partially shaded areas, often growing in forests or along stream banks. This plant is valued for its ornamental qualities, including its attractive foliage and unique growth habit. It has been introduced to several parts of North America, particularly in the eastern United States. However, its spread is limited due to its specific environmental requirements and preference for cooler climates."
}
