{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon echinus",
    "plant_slug": "acantholimon-echinus",
    "plant_name_scientific": "acantholimon echinus",
    "intro": "Acantholimon echinus, commonly known as the spiked sandthrift, is a flowering plant native to the arid regions of the Mediterranean and parts of western Asia. It is a member of the Plumbagaceae family and is characterized by its low-growing, succulent habit. The plant produces small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its leaves are typically fleshy and covered in a fine layer of white hairs, which help reduce water loss in dry conditions. Acantholimon echinus is often found in sandy or gravelly soils and is well adapted to harsh, sunny environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon echinus is primarily native to the Mediterranean region, specifically the eastern part of the Iberian Peninsula. It is found in areas such as southern Spain, including the regions of Andalusia and Murcia. This plant thrives in rocky and coastal environments, often growing on limestone substrates. It is adapted to arid and semi-arid climates with low rainfall. Due to its limited distribution, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon echinus was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in coastal areas and disturbed sites such as roadsides and gravelly slopes. This plant thrives in sandy or gravelly soils and is often associated with maritime climates. It is considered an invasive species in some areas due to its rapid spread and ability to outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
