{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax gracilistylus var. pubescens",
    "plant_slug": "acanthopanax-gracilistylus-var-pubescens",
    "plant_name_scientific": "acanthopanax gracilistylus var. pubescens",
    "intro": "Acanthopanax gracilistylus var. pubescens, commonly known as the hairy horse chestnut, is a flowering plant native to Southeast Asia. It is a deciduous shrub or small tree that can grow up to 10 meters tall. The plant features compound leaves with serrated edges and produces yellowish-green flowers in clusters. Its fruit is a follicle that splits open to release small, winged seeds. This species is valued for its ornamental value and is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax gracilistylus var. pubescens is primarily native to the mountainous regions of southern China, particularly in Yunnan and Guizhou provinces. It thrives in humid, temperate climates at elevations ranging from 1,500 to 3,000 meters. This variant is commonly found in dense forests and secondary growth areas, often growing as a shrub or small tree. It is well adapted to the region's moist conditions and is part of the diverse flora of the eastern Himalayas. The plant plays an important ecological role in its native habitat, supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthopanax gracilistylus var. pubescens was mainly introduced to areas with temperate to subtropical climates, characterized by well-drained soils and moderate rainfall. It thrives in regions with ample sunlight and is often found in forest edges or disturbed sites. This plant is commonly used in horticulture for its ornamental value and hardy nature. It has been introduced to several regions outside its native range, including parts of North America and Europe. Its distribution is expanding due to its adaptability and aesthetic appeal in landscaping."
}
