{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon lycaonicum",
    "plant_slug": "acantholimon-lycaonicum",
    "plant_name_scientific": "acantholimon lycaonicum",
    "intro": "Acantholimon lycaonicum, commonly known as the Lycaonicum thimbleweed, is a perennial flowering plant native to the mountainous regions of central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit with silver-blue foliage. The plant produces small, clustered flowers that range in color from white to pale pink, typically blooming in late summer. It thrives in well-drained, rocky soils and is adapted to arid or semi-arid environments. Due to its ornamental value and ecological significance, it is occasionally cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon lycaonicum"
    },
    "taxonomy_art_desc": "Acantholimon lycaonicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and specialized adaptations to nutrient-poor soils. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon lycaonicum, a specific plant within the genus Acantholimon, native to certain regions of the Mediterranean, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon lycaonicum is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky and arid environments, often in mountainous regions. It is adapted to the dry and harsh conditions of its native habitat. Its distribution is limited to certain localities in Turkey, where it thrives in well-drained soils.",
    "distribution_introduced_art_desc": "Acantholimon lycaonicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or Mediterranean climates. It is often found in disturbed sites such as roadsides, gravelly slopes, and disturbed soils where it can establish quickly. This plant thrives in regions with mild winters and hot, dry summers, making it suitable for arid and semi-arid environments. Its introduction has been noted in several regions outside its native range, including parts of California and the western United States. However, it is generally considered a non-invasive species that does not pose significant ecological threats."
}
