{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax cuspidatus var. tienchuanensis",
    "plant_slug": "acanthopanax-cuspidatus-var-tienchuanensis",
    "plant_name_scientific": "acanthopanax cuspidatus var. tienchuanensis",
    "intro": "Acanthopanax cuspidatus var. tienchuanensis, commonly known as the Tienchuan Chinese dogwood, is a deciduous shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated margins. The plant produces small, greenish-yellow flowers that are clustered in umbels, followed by red berries that are edible. It thrives in temperate climates and is often found in mountainous regions with well-drained soil. This species is valued for its ornamental qualities and traditional medicinal uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax cuspidatus var. tienchuanensis is primarily native to the mountainous regions of southern China, particularly in Yunnan and Guizhou provinces. It thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,000 meters. This variant is commonly found in forests with well-drained soils and moderate humidity. It is often associated with secondary growth areas and is sometimes cultivated for its medicinal properties. The plant plays an important ecological role in its native habitat by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acanthopanax cuspidatus var. tienchuanensis was mainly introduced to regions with temperate climates and well-drained soils, particularly in mountainous areas of China. It thrives in humid environments with partial shade and is often found in forested regions. This variant is valued for its medicinal properties and is used in traditional Chinese medicine. It has also been cultivated in botanical gardens and research institutions for its ecological and pharmaceutical significance. Its introduction has contributed to the biodiversity of plant species in both native and non-native habitats."
}
