{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum stocksianum var. pubescens",
    "plant_slug": "acanthophyllum-stocksianum-var-pubescens",
    "plant_name_scientific": "acanthophyllum stocksianum var. pubescens",
    "intro": "Acanthophyllum stocksianum var. pubescens, commonly known as the pubescent acanthophyllum, is a succulent shrub native to arid regions of Central Asia. It is characterized by its dense, spiny foliage and thick, fleshy stems that store water, enabling it to survive in harsh, dry environments. The plant typically grows in sandy or gravelly soils and is adapted to high levels of sunlight and temperature fluctuations. Its flowers are small and usually pale green or yellow, appearing in clusters during the warmer months. This variety is notable for its hairy texture, which helps reduce water loss and protect against extreme weather conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum stocksianum var. pubescens is primarily native to the arid and semi-arid regions of Central Asia, particularly in Kazakhstan, Uzbekistan, and Turkmenistan. This plant thrives in sandy and gravelly soils, often found in desert steppe and dune environments. It is well adapted to extreme temperatures and low precipitation, making it a characteristic species of these harsh ecosystems. The variety is known for its dense, low-growing structure and is often used as a source of forage for local wildlife. Its distribution is closely linked to the specific climatic and soil conditions of the Central Asian deserts.",
    "distribution_introduced_art_desc": "Acanthophyllum stocksianum var. pubescens was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high solar exposure, such as deserts and coastal dunes. This plant is adapted to withstand extreme temperatures and limited water availability, making it a resilient species in harsh environments. Its introduction has been documented in several parts of the Middle East and North Africa. However, its spread is often limited by the availability of suitable habitat and soil conditions."
}
