{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon lycopodioides",
    "plant_slug": "acantholimon-lycopodioides",
    "plant_name_scientific": "acantholimon lycopodioides",
    "intro": "Acantholimon lycopodioides, commonly known as the creeping sandthrift, is a low-growing perennial plant native to the arid and semi-arid regions of the southwestern United States and northern Mexico. It belongs to the family Caryophyllaceae and is characterized by its dense, mat-forming growth habit with small, needle-like leaves. The plant produces clusters of tiny, pink or reddish flowers that bloom in early spring, attracting pollinators such as bees and butterflies. It is well adapted to harsh environments, with a deep root system that allows it to survive in poor, sandy soils. Due to its drought tolerance and ornamental value, it is sometimes used in xeriscaping and native plant gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon lycopodioides"
    },
    "taxonomy_art_desc": "Acantholimon lycopodioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their ability to perform photosynthesis and adapt to terrestrial environments. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their allies, known for their jointed stems and often ancient evolutionary traits. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their complex floral structures and varied habitats. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and spinach, often with specialized adaptations to saline or arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with distinctive blue or purple flowers and often adapted to poor soils. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their spiny or prickly leaves and small, often blue or purple flowers. Its species is Acantholimon lycopodioides, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Kazakhstan",
        "Pakistan",
        "Tadzhikistan",
        "West Himalaya",
        "Xinjiang"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon lycopodioides is primarily native to Afghanistan, Kazakhstan, Pakistan, Tadzhikistan, the West Himalaya, and Xinjiang. This plant is typically found in arid and semi-arid regions, often growing in rocky or sandy soils. It is well adapted to the harsh climatic conditions of its native range. The species is commonly observed in mountainous areas and along the edges of deserts. Its distribution reflects its preference for high-altitude and dry environments across Central Asia.",
    "distribution_introduced_art_desc": "Acantholimon lycopodioides was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as dunes, coastal bluffs, and disturbed sites. It thrives in regions with moderate to high levels of sunlight and is commonly found in Mediterranean-type climates. This plant is particularly adapted to dry conditions and can tolerate saline soils, making it a resilient species in coastal environments. It is often seen growing along the edges of salt marshes and in coastal dune systems. Its introduction has been noted in several regions where it has established itself as a pioneer species in ecological succession."
}
