{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale jogensis",
    "plant_slug": "acanthopale-jogensis",
    "plant_name_scientific": "acanthopale jogensis",
    "intro": "Acanthopale jogensis, commonly known as the Jog's spiny acanthus, is a rare flowering plant native to the Western Ghats of India. It belongs to the family Amaranthaceae and is characterized by its distinctive spiny leaves and showy inflorescences. The plant typically grows in moist, shaded habitats and has adapted to thrive in the humid subtropical climate of its native region. Its botanical features include alternate, ovate leaves with serrated margins and small, clustered flowers that bloom in late summer. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale jogensis is primarily native to the Western Ghats of India. It is found in the state of Karnataka, specifically in the Jog Falls region. This plant thrives in moist, tropical rainforest environments. It is often found growing in dense undergrowth along riverbanks and in humid, shaded areas. Its distribution is limited to this specific ecological niche within the Western Ghats.",
    "distribution_introduced_art_desc": "Acanthopale jogensis was mainly introduced to areas with moist, tropical climates where it can thrive in shaded undergrowth. It has been recorded in parts of Southeast Asia, particularly in Indonesia and the Philippines. The plant is often found in lowland rainforests and along riverbanks. Its introduction has raised concerns due to its potential to outcompete native species. Despite its ornamental value, it is considered a weed in some regions where it has spread beyond cultivated areas."
}
