{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dioscoridis",
    "plant_slug": "acanthus-dioscoridis",
    "plant_name_scientific": "acanthus dioscoridis",
    "intro": "Acanthus dioscoridis, commonly known as the Greek Acanthus, is a striking ornamental plant native to the Mediterranean region. It is characterized by its large, palmate leaves that are deeply lobed and often covered in a fine, fuzzy texture. The plant produces showy, spire-like inflorescences with violet to purple flowers that bloom in summer. Its historical significance is evident in its use in classical architecture and decorative arts. Botanically, it belongs to the Acanthaceae family and is known for its hardy nature and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus dioscoridis"
    },
    "taxonomy_art_desc": "Acanthus dioscoridis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs. Its family is Acanthaceae, a family of flowering plants known for their showy flowers and often used in ornamental horticulture. Its genus is Acanthus, a group of flowering plants commonly known for their spiny leaves and showy bracts. Its species is Acanthus dioscoridis, a specific type of Acanthus known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Lebanon-Syria",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dioscoridis is primarily native to Iran, Iraq, Lebanon-Syria, Transcaucasus, and Turkey. This plant is commonly found in regions with Mediterranean and temperate climates. It thrives in rocky soils and is often seen growing in mountainous areas. The species is known for its ornamental value and has been historically used in horticulture. Its native range reflects its adaptation to the diverse ecosystems of the Near East.",
    "distribution_introduced_art_desc": "Acanthus dioscoridis was mainly introduced to urban and disturbed areas, particularly along roadsides and in gardens. It is often found in regions with temperate climates and well-drained soils. The plant has been reported in several countries in Europe and parts of the Mediterranean. Its introduction is likely due to its ornamental value and adaptability to different environments. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation."
}
