{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon haesarensis",
    "plant_slug": "acantholimon-haesarensis",
    "plant_name_scientific": "acantholimon haesarensis",
    "intro": "Acantholimon haesarensis, commonly known as the Haesarensis thrift, is a flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its compact, low-growing habit. The plant produces small, blue or purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its foliage consists of narrow, gray-green leaves that are often covered in a fine, powdery coating. Acantholimon haesarensis is well adapted to dry, rocky soils and is often found in coastal and inland scrub habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon haesarensis"
    },
    "taxonomy_art_desc": "Acantholimon haesarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species, typically with showy flowers and a wide range of growth forms. Its order is Caryophyllales, a group of flowering plants that includes many familiar families such as the cacti and the amaranths, often characterized by their distinctive flower structures and adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes plants with showy flowers and often contain toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon haesarensis, a specific type of plant native to certain regions, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon haesarensis is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky or sandy soils in mountainous areas. It is well adapted to the harsh climatic conditions of its native habitat. The species is part of the Caryophyllaceae family and is known for its distinctive floral structure.",
    "distribution_introduced_art_desc": "Acantholimon haesarensis was mainly introduced to areas with well-drained, sandy or gravelly soils, typically in open habitats such as coastal dunes, rocky slopes, and disturbed sites. It thrives in regions with a Mediterranean climate characterized by dry summers and wet winters. This plant is often found in regions of southern Europe, including parts of Spain, France, and Italy, where it has been naturalized. It is commonly associated with coastal and maritime environments due to its tolerance for salt spray and poor soil conditions. Its introduction has been primarily through human activity, such as landscaping and accidental transport."
}
