{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon acerosum var. persicum",
    "plant_slug": "acantholimon-acerosum-var-persicum",
    "plant_name_scientific": "acantholimon acerosum var. persicum",
    "intro": "Acantholimon acerosum var. persicum, commonly known as the Persian thorned sandwort, is a flowering plant native to arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves adapted to conserve water. The plant produces small, pink or white flowers that bloom in early summer, often in clusters at the ends of stems. It thrives in sandy or gravelly soils and is well-suited to dry, sunny environments. Due to its hardy nature, it is occasionally cultivated in xeriscapic gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon acerosum var. persicum is primarily native to the arid and semi-arid regions of Central Asia, particularly in parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in rocky or gravelly soils and is commonly found in mountainous and steppe environments. This plant is adapted to withstand extreme temperature fluctuations and low precipitation, making it well-suited to its harsh native habitat. It is often seen growing in open areas with limited vegetation cover. Its distribution is closely linked to the specific ecological conditions of the Central Asian deserts and steppes.",
    "distribution_introduced_art_desc": "Acantholimon acerosum var. persicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, fields, and rocky outcrops. This plant has a low-growing habit and produces small, blue to purple flowers. It is often used in xeriscaping due to its drought tolerance and ornamental value. Its distribution has expanded in regions with similar climatic conditions to its native range."
}
