{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hystrix",
    "plant_slug": "acantholimon-hystrix",
    "plant_name_scientific": "acantholimon hystrix",
    "intro": "Acantholimon hystrix, commonly known as the spiked sandthrift, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its upright growth habit and dense, silver-gray foliage. The plant produces small, blue or purple flowers that bloom in the spring and summer months. It thrives in well-drained soils and is often found in rocky or sandy habitats. Acantholimon hystrix is valued for its ornamental appeal and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hystrix"
    },
    "taxonomy_art_desc": "Acantholimon hystrix belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Caryophyllales, which includes plants with a distinctive floral structure and often contains species that are adapted to arid environments. Its family is Plumbaginaceae, a group of flowering plants commonly found in dry habitats, characterized by their often showy flowers and specialized seed dispersal mechanisms. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon hystrix, a specific type of plant within the genus Acantholimon, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hystrix is primarily native to Afghanistan and Iran. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and gravelly soils, often in mountainous or coastal areas. The species is adapted to withstand harsh environmental conditions, including high temperatures and limited water availability. Its native distribution reflects its preference for specific ecological niches in Central Asia.",
    "distribution_introduced_art_desc": "Acantholimon hystrix was mainly introduced to areas with well-drained soils and moderate climates, often found in rocky or gravelly habitats. It is commonly found in regions such as California, Oregon, and Washington in the United States. This plant thrives in full sun to partial shade and is adapted to arid and semi-arid environments. It is often used in xeriscaping due to its low water requirements and drought tolerance. However, it can become invasive in certain areas if not managed properly."
}
