{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bodeanum",
    "plant_slug": "acantholimon-bodeanum",
    "plant_name_scientific": "acantholimon bodeanum",
    "intro": "Acantholimon bodeanum, commonly known as the Bodean's thornscale, is a flowering plant native to the Mediterranean region. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its succulent, fleshy leaves and clusters of small, pinkish-white flowers. It thrives in rocky and arid environments, showcasing its adaptability to harsh conditions. Due to its unique appearance and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bodeanum"
    },
    "taxonomy_art_desc": "Acantholimon bodeanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex life cycles and multicellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, known for their spiny leaves and showy flowers. Its species is Acantholimon bodeanum, a specific plant within the genus Acantholimon, native to certain regions of Europe and characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bodeanum is primarily native to Iran. It is found in specific regions within the country, particularly in the central and eastern parts. This plant thrives in rocky and arid environments, often growing on slopes and in mountainous areas. Its distribution is limited to certain ecological niches that provide the necessary conditions for its growth. It is an important part of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acantholimon bodeanum was mainly introduced to areas with well-drained soils and full sun exposure, often in coastal or inland regions with a Mediterranean climate. It is typically found in disturbed soils, such as along roadsides, in open woodlands, and in grasslands. This plant thrives in environments with low moisture and moderate temperatures. Its distribution is limited by its intolerance to heavy clay soils and high humidity. It is considered a rare and localized species in its native range."
}
