{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon armenum var. balansae",
    "plant_slug": "acantholimon-armenum-var-balansae",
    "plant_name_scientific": "acantholimon armenum var. balansae",
    "intro": "Acantholimon armenum var. balansae, commonly known as Armenian thimbleweed, is a perennial herbaceous plant native to the mountainous regions of Armenia and Turkey. It belongs to the family Caryophyllaceae, which includes flowering plants characterized by their showy flowers and often succulent leaves. The plant features slender, upright stems with opposite, lance-shaped leaves that are often covered in fine hairs. Its flowers are small, clustered in dense inflorescences, typically pink or purple, and bloom in late spring to early summer. It thrives in rocky, well-drained soils and is adapted to alpine and subalpine environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon armenum var. balansae is primarily native to the eastern part of the Mediterranean region, specifically in areas of Turkey and Syria. It is commonly found in rocky and arid environments, such as cliffs, slopes, and limestone formations. This variety thrives in regions with low rainfall and high sunlight exposure, typical of the Mediterranean climate. It is often associated with coastal and inland dry habitats. Due to its limited range, it is considered a rare and endemic plant in these areas.",
    "distribution_introduced_art_desc": "Acantholimon armenum var. balansae was mainly introduced to areas with well-drained, sandy or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low to moderate rainfall and full sun exposure. This variety is commonly found in coastal dunes, inland valleys, and rocky slopes. It is valued for its ornamental value and ability to stabilize soil in disturbed areas. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
