{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthotrichilia triacantha",
    "plant_slug": "acanthotrichilia-triacantha",
    "plant_name_scientific": "acanthotrichilia triacantha",
    "intro": "Acanthotrichilia triacantha, commonly known as the thorned acanthotrichilia, is a succulent plant native to southern Africa. It features a branching stem covered in sharp, spiny tubercles, which serve as a defense mechanism against herbivores. The plant produces small, star-shaped flowers in shades of yellow or orange, typically blooming in the spring. Its leaves are thick and fleshy, adapted to store water in arid environments. It thrives in well-drained soil and requires minimal water, making it suitable for xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthotrichilia triacantha is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops within these areas. This plant thrives in environments with low rainfall and high temperatures. It is often seen in shrublands and grasslands, adapting well to the harsh conditions of its native habitat. Its distribution is closely linked to the availability of well-drained soil and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acanthotrichilia triacantha was mainly introduced to new environments for its ornamental value due to its unique and striking appearance. It has been widely cultivated in gardens and landscapes across various regions, particularly in tropical and subtropical areas. The plant's ability to thrive in diverse soil conditions has contributed to its spread beyond its native range. However, its introduction has raised concerns about potential ecological impacts on local flora and fauna. Despite these concerns, it remains a popular choice for horticultural use due to its aesthetic appeal."
}
