{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon spinosum",
    "plant_slug": "acantholimon-spinosum",
    "plant_name_scientific": "acantholimon spinosum",
    "intro": "Acantholimon spinosum, commonly known as the spiny flax, is a flowering plant native to the Mediterranean region. It is characterized by its upright growth habit and spiny stems, which provide protection against herbivores. The plant produces small, blue or purple flowers that bloom in the summer months. Its leaves are narrow and grass-like, often covered in fine hairs. Acantholimon spinosum is typically found in rocky or sandy soils and is adapted to drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon spinosum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It is commonly found in rocky coastal areas, cliffs, and dry, sandy soils. This plant thrives in arid and semi-arid environments, often growing in regions with mild, wet winters and hot, dry summers. It is well adapted to withstand harsh conditions such as salt spray and limited water availability. Its distribution is closely associated with specific microhabitats that provide the necessary ecological balance for its survival.",
    "distribution_introduced_art_desc": "Acantholimon spinosum was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly found in disturbed areas such as roadsides, gravelly slopes, and abandoned fields. This plant thrives in arid and semi-arid environments due to its drought-tolerant nature. It has been used in restoration projects to reclaim land that has been affected by mining or agricultural activities. However, its invasive potential requires careful management to prevent it from outcompeting native flora."
}
