{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kurdicum",
    "plant_slug": "acantholimon-kurdicum",
    "plant_name_scientific": "acantholimon kurdicum",
    "intro": "Acantholimon kurdicum, commonly known as Kurdish thistle, is a perennial flowering plant native to the mountainous regions of Turkey and Iran. It belongs to the family Caryophyllaceae and is characterized by its basal rosette of silver-gray, hairy leaves. The plant produces tall, slender stems that bear clusters of small, pinkish-white flowers in late spring to early summer. It thrives in rocky, well-drained soils and is adapted to arid and semi-arid environments. Due to its ornamental value and ecological importance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kurdicum is primarily native to the mountainous regions of southeastern Turkey, northern Syria, and northern Iraq. It is commonly found in rocky and limestone soils at elevations ranging from 1,500 to 3,000 meters. This plant thrives in arid and semi-arid climates, often growing in open habitats such as slopes and grasslands. It is well adapted to the harsh environmental conditions of its native range. Due to its limited distribution, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acantholimon kurdicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky or gravelly habitats, often growing on slopes or along rocky outcrops. This plant is adapted to withstand drought conditions and has a low maintenance requirement, making it suitable for xeriscaping. It is also valued for its ornamental value due to its attractive, needle-like foliage and small, clustered flowers. However, its introduction may pose a risk of becoming invasive in certain environments if not managed properly."
}
