{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum lecocarpoides",
    "plant_slug": "acanthospermum-lecocarpoides",
    "plant_name_scientific": "acanthospermum lecocarpoides",
    "intro": "Acanthospermum lecocarpoides, commonly known as the hairy acanthosperm, is a flowering plant native to tropical regions of Africa. It belongs to the family Asteraceae, which is characterized by its composite flower heads. The plant features distinctive hairy leaves and produces small, yellowish flowers arranged in clusters. Its fruit is a capsule that contains several seeds, adapted for dispersal by wind. It is often found in disturbed soils and can thrive in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum lecocarpoides is primarily native to tropical and subtropical regions of South America, particularly Brazil, Paraguay, and Argentina. It is commonly found in open grasslands, savannas, and disturbed habitats. This plant thrives in areas with well-drained soils and full sun exposure. It is often associated with dry to moderately moist environments. Its native range extends into parts of Central America as well.",
    "distribution_introduced_art_desc": "Acanthospermum lecocarpoides was mainly introduced to new environments through human activities such as intentional planting for ornamental purposes or accidental transport via contaminated soil or seeds. It has established itself in various regions, particularly in tropical and subtropical areas where it thrives in disturbed soils and open habitats. The plant's rapid growth and ability to spread through both seeds and vegetative propagation contribute to its invasive potential. It is often found in disturbed areas like roadsides, agricultural fields, and urban landscapes. Due to its adaptability, it poses a challenge for local ecosystems and land management efforts."
}
