{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax sieboldianus var. variegatus",
    "plant_slug": "acanthopanax-sieboldianus-var-variegatus",
    "plant_name_scientific": "acanthopanax sieboldianus var. variegatus",
    "intro": "Acanthopanax sieboldianus var. variegatus, commonly known as the variegated five-leaf aralia, is a deciduous shrub native to East Asia. It is characterized by its compound leaves, which often display striking variegation of white and green. The plant produces small, greenish-yellow flowers in panicles, followed by red berries that are attractive to birds. It thrives in partial shade and well-drained soil, making it a popular choice for ornamental gardens. Its unique foliage and adaptability contribute to its appeal in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax sieboldianus var. variegatus is primarily native to eastern Asia, including regions of China, Korea, and Japan. It thrives in temperate climates and is commonly found in mountainous areas with well-drained soil. This variant is particularly associated with forests and rocky slopes, where it can grow as a shrub or small tree. Its natural range extends across parts of the Korean Peninsula and into the northeastern regions of China. The plant is adapted to cooler temperatures and is often found in humid, shaded environments.",
    "distribution_introduced_art_desc": "Acanthopanax sieboldianus var. variegatus was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It thrives in partial shade to full sun and is commonly found in gardens and landscaped areas. This plant has been introduced to parts of North America, particularly in the eastern United States, where it has established itself in naturalized settings. Its introduction has raised concerns due to its potential invasiveness in certain ecosystems. However, it is generally considered a low-risk species when properly managed."
}
