{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthotheca pinnatisecta",
    "plant_slug": "acanthotheca-pinnatisecta",
    "plant_name_scientific": "acanthotheca pinnatisecta",
    "intro": "Acanthotheca pinnatisecta, commonly known as the narrow-leaved acanthotheca, is a species of flowering plant in the family Acanthaceae. It is characterized by its delicate, finely dissected leaves that give it a feathery appearance. The plant produces small, tubular flowers that are typically arranged in clusters, often in shades of pink or purple. Native to tropical regions of Africa, it thrives in moist, shaded environments. Due to its ornamental value, it is occasionally cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthotheca pinnatisecta is primarily native to southern Africa, specifically South Africa. It is found in the coastal regions of the Eastern and Western Cape provinces. This plant thrives in sandy and rocky coastal habitats. It is commonly associated with the fynbos biome, which is known for its unique biodiversity. Its distribution is limited to specific areas where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acanthotheca pinnatisecta was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban environments where it can thrive in nutrient-rich conditions. This plant has been reported in several regions outside its native range, including parts of Europe and North America. Its rapid growth and adaptability make it a potential invasive species in some areas. However, its ecological impact remains under study due to limited long-term data."
}
