{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus acutangulus",
    "plant_slug": "acanthocereus-acutangulus",
    "plant_name_scientific": "acanthocereus acutangulus",
    "intro": "Acanthocereus acutangulus, commonly known as the night-blooming cereus, is a cacti species native to Mexico and parts of Central America. It is a columnar cactus with ribbed stems that can grow up to several meters in height. The plant produces large, fragrant white flowers that open at night, attracting nocturnal pollinators like bats and moths. Its leaves are reduced to spines, and it stores water in its thick stems, making it well adapted to arid environments. The plant is often cultivated for its striking floral display and resilience in dry conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus acutangulus is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in desert regions, particularly in Arizona, New Mexico, and parts of Texas. This species thrives in arid and semi-arid environments, often growing on rocky soils and in crevices. It is well adapted to the harsh conditions of the Sonoran and Chihuahuan Deserts. The plant is known for its spiny stems and small, night-blooming flowers.",
    "distribution_introduced_art_desc": "Acanthocereus acutangulus was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert regions, particularly in Arizona, New Mexico, and Texas. This plant thrives in well-drained soils and full sun, making it well-suited for arid environments. It is often cultivated as an ornamental plant due to its unique appearance and resilience. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
