{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus verticillatus",
    "plant_slug": "acanthocarpus-verticillatus",
    "plant_name_scientific": "acanthocarpus verticillatus",
    "intro": "Acanthocarpus verticillatus, commonly known as the whorled burr grass, is a perennial herb native to southern Africa. It is characterized by its upright growth habit and dense clusters of small, spiny fruits that form in whorls around the stem. The plant has narrow, linear leaves and produces yellow flowers that bloom in late spring. It thrives in dry, sandy soils and is often found in grasslands and along roadsides. Due to its hardy nature, it is sometimes considered a weed in agricultural areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus verticillatus"
    },
    "taxonomy_art_desc": "Acanthocarpus verticillatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Asparagales, a large group of flowering plants that includes grasses, lilies, and asparagus, characterized by their diverse growth forms and reproductive structures. Its family is Asparagaceae, which consists of flowering plants commonly known as the asparagus family, including many ornamental and edible plants. Its genus is Acanthocarpus, a group of flowering plants typically found in arid regions, characterized by their spiny fruits and grass-like leaves. Its species is Acanthocarpus verticillatus, a specific plant within this genus known for its distinctive verticillate inflorescence and adapted to grow in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus verticillatus is primarily native to Western Australia. It is commonly found in the southwestern and southeastern regions of the state. This plant thrives in a variety of habitats, including sandy soils and coastal areas. It is often seen in open vegetation types such as spinifex plains and coastal heath. Its distribution is largely confined to the native flora of Western Australia.",
    "distribution_introduced_art_desc": "Acanthocarpus verticillatus was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant forms dense mats that help prevent soil erosion and promote the growth of other vegetation. It is particularly valued in tropical and subtropical regions for its hardiness and rapid establishment. However, its introduction has sometimes led to unintended ecological impacts in non-native environments."
}
