{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon halophilum",
    "plant_slug": "acantholimon-halophilum",
    "plant_name_scientific": "acantholimon halophilum",
    "intro": "Acantholimon halophilum, commonly known as the saltbush, is a flowering plant native to arid and saline environments. It belongs to the family Caryophyllaceae and is characterized by its succulent leaves and showy, pink or purple flowers. The plant is highly adapted to salty soils, often found in coastal areas and salt marshes. Its ability to tolerate high salinity makes it an important species in ecological restoration projects. Acantholimon halophilum plays a crucial role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon halophilum"
    },
    "taxonomy_art_desc": "Acantholimon halophilum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like beets and cacti, often characterized by their unique adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes plants with showy flowers and often found in dry, saline environments. Its genus is Acantholimon, a genus of flowering plants typically found in arid and saline regions, characterized by their spiny leaves and small, often clustered flowers. Its species is Acantholimon halophilum, a specific type of plant adapted to salty environments, known for its resilience and ability to thrive in coastal or saline soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon halophilum is primarily native to Turkey. It is commonly found in coastal and saline environments across the country. This plant thrives in arid and semi-arid regions, particularly in areas with high salinity. It is often observed in dunes, salt marshes, and other saline habitats. Its distribution is closely tied to the unique ecological conditions of Turkey's coastal zones.",
    "distribution_introduced_art_desc": "Acantholimon halophilum was mainly introduced to coastal and saline environments where it thrives in high-salinity soils. It is commonly found in salt marshes, dunes, and other areas with limited freshwater availability. This plant has adapted to harsh conditions through specialized root systems and salt-excreting leaves. Its introduction has been documented in several regions with similar ecological conditions to its native habitat. It plays a role in stabilizing soil and providing habitat for small invertebrates in these extreme environments."
}
