{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis monacantha subsp. kimnachii",
    "plant_slug": "acanthorhipsalis-monacantha-subsp-kimnachii",
    "plant_name_scientific": "acanthorhipsalis monacantha subsp. kimnachii",
    "intro": "Acanthorhipsalis monacantha subsp. kimnachii, commonly known as the Kimnach's crown of thorns, is a unique member of the Apocynaceae family. It is native to Madagascar and is characterized by its spiny, leafless stems that bear clusters of small, fragrant flowers. The plant exhibits a branching growth habit, often forming dense, shrub-like structures. Its flowers are typically white or pale pink, and it produces small, berry-like fruits that are edible but have a mild, milky sap. This subspecies is valued for its ornamental appearance and is often cultivated as a houseplant due to its hardiness and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis monacantha subsp. kimnachii is primarily native to the eastern Andes of South America, specifically in countries such as Ecuador and Peru. This subspecies is found in cloud forests at elevations ranging from approximately 1,200 to 2,500 meters above sea level. It thrives in humid, shaded environments with well-drained soil. The plant is known for its distinctive rosette-shaped growth and vibrant, star-shaped flowers. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis monacantha subsp. kimnachii was mainly introduced to areas with warm, dry climates and well-draining soil, often found in rocky or coastal environments. It is commonly cultivated as an ornamental plant due to its unique, spiny foliage and drought tolerance. This subspecies is native to parts of southern Africa, particularly South Africa, where it grows in arid and semi-arid regions. It has been introduced to other regions with similar climatic conditions, including parts of the Mediterranean and the southwestern United States. However, its spread outside its native range is limited due to its specific environmental requirements."
}
