{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum humile var. normale",
    "plant_slug": "acanthospermum-humile-var-normale",
    "plant_name_scientific": "acanthospermum humile var. normale",
    "intro": "Acanthospermum humile var. normale, commonly known as the small burrweed, is a flowering plant native to tropical and subtropical regions. It belongs to the Asteraceae family, characterized by its composite flower heads. The plant produces small, spiny fruits that aid in seed dispersal by attaching to animal fur or clothing. Its leaves are typically narrow and hairy, adapted to reduce water loss in arid environments. It thrives in disturbed soils and is often found in roadside areas and dry grasslands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum humile var. normale is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in open grasslands, disturbed soils, and along roadsides. This plant thrives in areas with high sunlight exposure and well-drained soil. It is also present in parts of southern Arabia and the Indian subcontinent. Due to its adaptability, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acanthospermum humile var. normale was mainly introduced to the United States, particularly in the southern states, as an ornamental plant due to its attractive, small yellow flowers. It has since become naturalized in various regions, often found along roadsides and in disturbed soils. The plant is considered invasive in some areas because of its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its original introduction range, leading to concerns about its ecological impact. Despite its ornamental value, its spread requires careful management to prevent further encroachment on native ecosystems."
}
