{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon incomptum",
    "plant_slug": "acantholimon-incomptum",
    "plant_name_scientific": "acantholimon incomptum",
    "intro": "Acantholimon incomptum, commonly known as the slender sea holly, is a flowering plant native to the coastal regions of southern California and northern Baja California. It is characterized by its low-growing, mat-forming habit and features narrow, blue-gray leaves that are covered in fine, white hairs. The plant produces small, clustered flowers in shades of blue to purple, which bloom during the spring and summer months. It thrives in sandy or gravelly soils and is adapted to coastal climates with salt spray and strong winds. Acantholimon incomptum is an important species for stabilizing dune ecosystems and supporting local pollinator populations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon incomptum"
    },
    "taxonomy_art_desc": "Acantholimon incomptum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments, such as succulence and salt tolerance. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny or prickly leaves. Its species is Acantholimon incomptum, a specific plant within the genus Acantholimon, known for its distinctive morphology and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon incomptum is primarily native to Iran. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in rocky and sandy soils, often growing in mountainous areas. It is well adapted to the harsh climatic conditions of its native habitat. Its distribution is largely restricted to specific ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon incomptum was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as dunes, coastal bluffs, and disturbed sites. It thrives in regions with moderate to high levels of sunlight and is commonly found in coastal and inland areas of western North America. This plant is adapted to dry, arid conditions and can tolerate salt spray, making it suitable for coastal environments. It is often seen growing in association with other drought-tolerant species in these ecosystems. Its introduction has been noted in several states, including California, Oregon, and Washington, where it has established itself in natural and disturbed landscapes."
}
