{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tschimganicum",
    "plant_slug": "acantholimon-tschimganicum",
    "plant_name_scientific": "acantholimon tschimganicum",
    "intro": "Acantholimon tschimganicum, commonly known as the Tschimganica thistle, is a flowering plant native to Central Asia. It belongs to the family Caryophyllaceae and is characterized by its spiny leaves and showy, pinkish-purple flowers. The plant typically grows in rocky or sandy soils and thrives in arid or semi-arid environments. It is a perennial herb that produces small, capsule-like fruits containing seeds. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tschimganicum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and southern Siberia. It thrives in rocky and sandy soils, often found in mountainous and steppe landscapes. This species is adapted to harsh environmental conditions, such as low precipitation and extreme temperature fluctuations. It is commonly observed in regions with sparse vegetation, where it plays a role in stabilizing soil and supporting local biodiversity. The plant's native range reflects its evolutionary adaptation to the unique ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Acantholimon tschimganicum was mainly introduced to areas with dry, rocky soils and elevations ranging from 1,500 to 3,000 meters. It is commonly found in regions with a continental climate characterized by cold winters and warm, dry summers. This plant thrives in well-drained soils and is often associated with mountainous or alpine habitats. It is typically found in the Caucasus, Turkey, and parts of Central Asia. Due to its specific habitat requirements, it is not widely distributed and is considered a rare species in its native range."
}
