{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon xanthacanthum",
    "plant_slug": "acantholimon-xanthacanthum",
    "plant_name_scientific": "acantholimon xanthacanthum",
    "intro": "Acantholimon xanthacanthum, commonly known as the yellow-cup stonecress, is a flowering plant native to the arid regions of Central Asia. It is a low-growing perennial herb characterized by its small, fleshy leaves and yellow flowers that bloom in late spring. The plant thrives in rocky or sandy soils and is adapted to withstand drought conditions. Its flowers are typically arranged in clusters and are attractive to pollinators such as bees and butterflies. The species is valued for its ornamental appeal and resilience in challenging environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon xanthacanthum"
    },
    "taxonomy_art_desc": "Acantholimon xanthacanthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex cellular structures and ability to photosynthesize. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species, characterized by their diverse flower structures and complex reproductive systems. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes herbs and shrubs often found in dry habitats. Its genus is Acantholimon, a genus of flowering plants in the family Plumbaginaceae, typically characterized by their succulent leaves and showy flowers. Its species is Acantholimon xanthacanthum, a specific plant within the genus Acantholimon, known for its yellow flowers and adapted to rocky or arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon xanthacanthum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in rocky and gravelly soils at higher elevations. It is adapted to the arid and semi-arid climates of its native habitat. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon xanthacanthum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is often found in disturbed soils, such as roadsides, fields, and degraded habitats. This plant has been reported in several states across the western United States, including California, Nevada, and Utah. Its introduction is likely due to human activities such as landscaping and land development. It is considered a non-native species that can compete with native vegetation in certain environments."
}
