{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kotschyi subsp. laxispicatum",
    "plant_slug": "acantholimon-kotschyi-subsp-laxispicatum",
    "plant_name_scientific": "acantholimon kotschyi subsp. laxispicatum",
    "intro": "Acantholimon kotschyi subsp. laxispicatum, commonly known as the slender spike-heath, is a flowering plant native to the Mediterranean region. It is a perennial herb characterized by its low-growing habit and dense clusters of small, spike-like flowers. The plant typically thrives in rocky or sandy soils and is adapted to dry, sunny environments. Its leaves are usually narrow and covered in fine hairs, which help reduce water loss. The species is valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kotschyi subsp. laxispicatum is primarily native to the arid and semi-arid regions of the Middle East and Central Asia. This subspecies is found in countries such as Turkey, Syria, Lebanon, and parts of northern Iraq. It typically grows in rocky soils and dry habitats, often in mountainous or foothill areas. The plant is adapted to harsh environmental conditions, including high temperatures and low precipitation. Its distribution is limited to specific ecological niches that provide the necessary conditions for its survival.",
    "distribution_introduced_art_desc": "Acantholimon kotschyi subsp. laxispicatum was mainly introduced to areas with well-drained soils and full sun exposure, typically found in rocky or gravelly habitats. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This subspecies is often seen in coastal and inland areas where it thrives in disturbed soils and open landscapes. Its introduction has been noted in several regions outside its native range, including parts of California and the Mediterranean basin. It is valued for its ornamental qualities and ability to tolerate drought conditions."
}
