{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ophiocladus",
    "plant_slug": "acantholimon-ophiocladus",
    "plant_name_scientific": "acantholimon ophiocladus",
    "intro": "Acantholimon ophiocladus, commonly known as the coastal flax, is a flowering plant native to the coastal regions of southern California and Baja California. It is a member of the Plumbagaceae family and is characterized by its slender, erect stems and narrow, linear leaves. The plant produces small, blue to purple flowers that bloom in late spring to early summer. It thrives in sandy or gravelly soils and is adapted to coastal climates with salt spray and strong winds. Acantholimon ophiocladus is often found in dunes and coastal scrub habitats, where it plays a role in stabilizing sand dunes and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ophiocladus"
    },
    "taxonomy_art_desc": "Acantholimon ophiocladus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle involving both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, known for its typically shrubby or herbaceous plants with distinctive flowers and often containing secondary metabolites. Its genus is Acantholimon, a group of flowering plants commonly found in arid and semi-arid regions, characterized by their spiny or thorny stems. Its species is Acantholimon ophiocladus, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ophiocladus is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky and gravelly soils. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific areas within Iran.",
    "distribution_introduced_art_desc": "Acantholimon ophiocladus was mainly introduced to New Zealand. It was brought there as part of the broader introduction of flowering plants for horticultural and ornamental purposes. The plant is native to the Mediterranean region and has adapted well to the temperate climate of New Zealand. It is commonly found in coastal areas and is often cultivated in gardens. However, it is not considered invasive in its introduced range."
}
