{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthococos emensis",
    "plant_slug": "acanthococos-emensis",
    "plant_name_scientific": "acanthococos emensis",
    "intro": "Acanthococos emensis, commonly known as the Emelianov's spiny cactus, is a member of the Cactaceae family. It is native to arid regions of South America, particularly in Argentina and Chile. The plant is characterized by its spiny, cylindrical stems that store water, adapting to its harsh environment. Its flowers are typically yellow or orange, appearing during the warmer months. Acanthococos emensis thrives in well-drained soils and requires minimal water, making it a resilient species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthococos emensis is primarily native to the Canary Islands, specifically Tenerife and La Gomera. It is found in rocky coastal areas and cliffs, where it thrives in the harsh, arid conditions. This plant is adapted to the unique microclimate of these islands, characterized by strong winds and limited soil nutrients. It plays an important role in the local ecosystem by providing habitat and food for native wildlife. Due to its restricted range, it is considered a vulnerable species.",
    "distribution_introduced_art_desc": "Acanthococos emensis was mainly introduced to regions with warm, coastal climates where it can thrive in sandy or rocky soils. It is commonly found in areas with high salinity and moderate to high exposure to wind and sun. This plant is often used for dune stabilization due to its deep root system and ability to withstand harsh environmental conditions. It has been introduced to several parts of the Mediterranean and along the coasts of southern Europe. However, its spread is limited by its specific habitat requirements and climate preferences."
}
