{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus fimbriatus",
    "plant_slug": "acanthocarpus-fimbriatus",
    "plant_name_scientific": "acanthocarpus fimbriatus",
    "intro": "Acanthocarpus fimbriatus, commonly known as the serrated burr grass, is a perennial herbaceous plant native to southern Africa. It is characterized by its dense, tufted growth habit and distinctive, spiny seed heads that form in clusters. The plant has narrow, grass-like leaves and produces small, inconspicuous flowers that are typically green or pale yellow. It thrives in disturbed soils and is often found in open woodland or grassland habitats. The species is notable for its ability to form dense stands, which can impact local vegetation dynamics.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus fimbriatus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as South Africa, Kenya, Tanzania, and Madagascar. It thrives in open grasslands, savannas, and along roadsides in these areas. The plant is commonly found in regions with a warm climate and well-drained soils. It is often used in traditional medicine and as forage for livestock. Its distribution is closely linked to the ecological conditions of these African habitats.",
    "distribution_introduced_art_desc": "Acanthocarpus fimbriatus was mainly introduced to control erosion and forage production in degraded lands. It is commonly found in tropical and subtropical regions, particularly in areas with poor soil quality. This plant is known for its ability to thrive in harsh environments, making it a valuable species for rehabilitation projects. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Its distribution is primarily limited by climate conditions and human land-use practices."
}
