{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthococos sericea",
    "plant_slug": "acanthococos-sericea",
    "plant_name_scientific": "acanthococos sericea",
    "intro": "Acanthococos sericea, commonly known as the silky acanthococos, is a flowering plant native to parts of Southeast Asia. It belongs to the family Acanthocococaceae and is characterized by its soft, silvery foliage. The plant produces small, yellowish flowers that are clustered in inflorescences. It thrives in moist, shaded environments and is often found in forest understories. Its unique appearance and habitat make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthococos sericea is primarily native to the coastal regions of southern Africa, particularly in South Africa. It is commonly found in sandy or gravelly soils along the Atlantic coast. This plant thrives in arid and semi-arid environments, often growing in dunes or on rocky outcrops. It is well adapted to withstand high salinity and strong coastal winds. Its distribution is limited to specific microhabitats that provide the necessary conditions for its survival.",
    "distribution_introduced_art_desc": "Acanthococos sericea was mainly introduced to coastal areas and disturbed soils in the Pacific Northwest of the United States. It thrives in sandy or gravelly habitats and is often found along shorelines and dunes. This plant has become established in these regions due to its tolerance of salt spray and poor soil conditions. Its introduction has led to concerns about its potential to outcompete native vegetation in these sensitive ecosystems. Despite its invasive tendencies, it is sometimes used for erosion control in coastal restoration projects."
}
