{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum aphananthum",
    "plant_slug": "acanthophyllum-aphananthum",
    "plant_name_scientific": "acanthophyllum aphananthum",
    "intro": "Acanthophyllum aphananthum, commonly known as the sandmat, is a low-growing shrub native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its dense, cushion-like growth habit and small, scale-like leaves that help reduce water loss in harsh environments. The plant produces small, pale yellow flowers that bloom in late spring, adding a subtle floral display. It is well adapted to sandy soils and can thrive in areas with limited water availability. Due to its resilience, it is often used in ecological restoration projects in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum aphananthum"
    },
    "taxonomy_art_desc": "Acanthophyllum aphananthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with distinctive floral structures. Its family is Caryophyllaceae, commonly known as the carnation or pink family, which includes many flowering plants with showy, often pink or white flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny or thorny structures. Its species is Acanthophyllum aphananthum, a specific plant within this genus known for its small, inconspicuous flowers and adaptations to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum aphananthum is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions of the country. This plant thrives in sandy and rocky soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is largely restricted to specific ecological zones within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum aphananthum was mainly introduced to arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy and gravelly soils, often in areas with low precipitation. This plant is well adapted to harsh environmental conditions, making it a resilient species in its introduced range. It plays a role in stabilizing dunes and preventing soil erosion. Its distribution has been influenced by both natural dispersal and human activities."
}
