{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium spiniflorum",
    "plant_slug": "acanthocalycium-spiniflorum",
    "plant_name_scientific": "acanthocalycium spiniflorum",
    "intro": "Acanthocalycium spiniflorum, commonly known as the spiny-flowered cactus, is a species native to the arid regions of South America. It is a small, globular cactus with a dense covering of spines that provide protection from herbivores and intense sunlight. The plant produces yellow flowers during the spring and summer months, adding a striking contrast to its green body. Its succulent stems store water, allowing it to survive in dry environments. It is often cultivated as an ornamental plant due to its unique appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocalycium",
        "species": "Acanthocalycium spiniflorum"
    },
    "taxonomy_art_desc": "Acanthocalycium spiniflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, which consists of flowering plants often with a distinctive floral structure and includes many succulent species. Its family is Cactaceae, commonly known as cacti, which are primarily found in arid regions and are characterized by spines and succulent stems. Its genus is Acanthocalycium, a group of cacti native to South America, typically featuring spiny stems and flowers. Its species is Acanthocalycium spiniflorum, a specific type of cactus known for its spiny appearance and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium spiniflorum is primarily native to Argentina Northeast and Argentina Northwest. This species is found in the arid and semi-arid regions of these areas. It thrives in rocky and sandy soils, often in coastal or mountainous habitats. The plant is well adapted to the harsh climate conditions of its native range. It is a member of the Cactaceae family and is known for its distinctive spiny stems and flowers.",
    "distribution_introduced_art_desc": "Acanthocalycium spiniflorum was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high sunlight exposure, making it suitable for rock gardens and xeriscaping. This plant is often cultivated for its attractive, spiny stems and colorful flowers. Its introduction has been primarily for ornamental purposes in horticulture. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
