{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon acerosum subsp. brachystachyum",
    "plant_slug": "acantholimon-acerosum-subsp-brachystachyum",
    "plant_name_scientific": "acantholimon acerosum subsp. brachystachyum",
    "intro": "Acantholimon acerosum subsp. brachystachyum, commonly known as the short-stemmed sea holly, is a flowering plant native to the coastal regions of southern Africa. It is a perennial herb characterized by its robust, succulent stems and basal rosettes of thick, fleshy leaves. The plant produces small, blue to purple flowers arranged in dense, spike-like inflorescences, which bloom in spring. It is adapted to saline and sandy soils, making it a hardy species found in coastal dunes and cliffs. This subspecies is valued for its ornamental appeal and ecological role in stabilizing coastal ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon acerosum"
    },
    "taxonomy_art_desc": "Acantholimon acerosum subsp. brachystachyum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments and often have distinctive floral morphology. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny stems and small, clustered flowers. Its species is Acantholimon acerosum, a specific type within the genus known for its robust growth and specific habitat preferences, with the subspecies brachystachyum exhibiting distinct floral and morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon acerosum subsp. brachystachyum is primarily native to Turkey. This subspecies is found in the eastern and central regions of the country. It typically grows in rocky and arid environments. The plant is adapted to the harsh climatic conditions of its native habitat. It is commonly found in areas with poor soil and limited water availability.",
    "distribution_introduced_art_desc": "Acantholimon acerosum subsp. brachystachyum was mainly introduced to areas with dry, rocky soils and semi-arid climates. It is commonly found in regions with low precipitation and high sunlight exposure. This subspecies is often used in restoration projects due to its drought tolerance and ability to stabilize soils. It has been introduced to parts of the western United States and northern Mexico. Its distribution is largely limited to specific ecological niches where it can thrive without excessive moisture."
}
