{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum grandiflorum",
    "plant_slug": "acanthophyllum-grandiflorum",
    "plant_name_scientific": "acanthophyllum grandiflorum",
    "intro": "Acanthophyllum grandiflorum, commonly known as the large-flowered acanthophyllum, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its compact growth habit, with dense clusters of small, spiny leaves that help reduce water loss in harsh environments. The plant produces showy, pink or purple flowers in late spring, which attract pollinators such as bees and butterflies. Its root system is extensive and deep, allowing it to access groundwater in dry conditions. Acanthophyllum grandiflorum plays an important ecological role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum grandiflorum"
    },
    "taxonomy_art_desc": "Acanthophyllum grandiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes species like carnations and spinach, often characterized by their distinctive floral structures. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum grandiflorum, a specific type of plant within the genus Acanthophyllum, known for its large flowers and adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum grandiflorum is primarily native to Afghanistan and Pakistan. It is commonly found in arid and semi-arid regions within these countries. This plant thrives in sandy or gravelly soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is closely tied to the ecological zones of Central and South Asia.",
    "distribution_introduced_art_desc": "Acanthophyllum grandiflorum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often growing in dunes and along the edges of salt lakes. This plant is adapted to extreme temperatures and low precipitation, making it a hardy species in harsh environments. It plays a role in stabilizing dunes and preventing soil erosion. Due to its resilience, it has been introduced to other regions with similar climatic conditions for ecological restoration purposes."
}
