{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostachys calcicola",
    "plant_slug": "acanthostachys-calcicola",
    "plant_name_scientific": "acanthostachys calcicola",
    "intro": "Acanthostachys calcicola, commonly known as the limestone chaffflower, is a perennial herb native to arid and semi-arid regions of southern Africa. It is characterized by its tufted growth habit and produces small, spiky flowers that are typically greenish or pale yellow. The plant thrives in well-drained, calcareous soils and is often found in rocky or sandy habitats. Its leaves are narrow and grass-like, with a rough texture, and it is adapted to withstand drought conditions. Acanthostachys calcicola plays a role in stabilizing soil in its native environment and is of interest to botanists and ecologists studying xerophytic plants.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Bromeliaceae",
        "genus": "Acanthostachys",
        "species": "Acanthostachys calcicola"
    },
    "taxonomy_art_desc": "Acanthostachys calcicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, often characterized by their wind-pollinated flowers. Its family is Bromeliaceae, a family of tropical plants known for their rosette-shaped leaves and vibrant flowers, often found in wet or humid environments. Its genus is Acanthostachys, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiky or bristly structures. Its species is Acanthostachys calcicola, a specific plant species adapted to calcareous soils, known for its unique morphology and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostachys calcicola is primarily native to Brazil North. This plant is found in the northern regions of Brazil, where it thrives in specific ecological conditions. It is typically associated with rocky or calcareous soils in tropical and subtropical environments. The distribution of Acanthostachys calcicola is limited to these particular habitats within Brazil North. It plays a role in the local flora and may have ecological significance in its native range.",
    "distribution_introduced_art_desc": "Acanthostachys calcicola was mainly introduced to areas with calcareous soils, particularly in regions with a Mediterranean climate. It thrives in environments where there is ample sunlight and well-drained soil conditions. This plant is commonly found in disturbed areas such as roadsides, open woodlands, and rocky outcrops. Its introduction has been associated with human activities like land clearing and gardening. However, it is considered a potential invasive species in some regions due to its rapid growth and competitive nature."
}
