{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon sorchense",
    "plant_slug": "acantholimon-sorchense",
    "plant_name_scientific": "acantholimon sorchense",
    "intro": "Acantholimon sorchense, commonly known as the Sorchent's thistle, is a flowering plant native to the high altitudes of the Pyrenees and the Alps. It belongs to the family Caryophyllaceae, which includes many species of flowering plants with showy flowers. The plant is characterized by its upright growth habit, with narrow, grass-like leaves and spiky, violet-blue flowers that bloom in late summer. It thrives in rocky, well-drained soils and is adapted to cold, mountainous climates. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon sorchense"
    },
    "taxonomy_art_desc": "Acantholimon sorchense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a distinct life cycle that includes both spore-producing and seed-producing stages. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many species with specialized adaptations to arid environments. Its family is Plumbaginaceae, known for its distinctive flowers and often containing plants with medicinal or ornamental value. Its genus is Acantholimon, a group of flowering plants commonly found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon sorchense, a specific type of plant native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon sorchense is primarily native to Iran. This plant is found in specific regions of Iran, particularly in the northern and central parts of the country. It thrives in rocky and arid environments, often growing in mountainous areas. The species is adapted to the harsh climate conditions of its native habitat. Its distribution is relatively limited, making it a regionally significant plant in Iranian flora.",
    "distribution_introduced_art_desc": "Acantholimon sorchense was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed soils, such as roadsides, fields, and rocky outcrops. This plant has shown adaptability to various environmental conditions, which contributes to its spread in new habitats. Its introduction has been documented in several regions outside its native range, including parts of Europe and North America. Due to its resilience and ornamental value, it has been cultivated for horticultural purposes in some areas."
}
