{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ulicinum",
    "plant_slug": "acantholimon-ulicinum",
    "plant_name_scientific": "acantholimon ulicinum",
    "intro": "Acantholimon ulicinum, commonly known as the narrowleaf sandthrift, is a perennial flowering plant native to the western United States. It belongs to the family Caryophyllaceae and is characterized by its upright growth habit and narrow, linear leaves. The plant produces small, pink to purple flowers that bloom in late spring to early summer. It thrives in sandy or gravelly soils and is often found in dry, open habitats such as dunes and coastal bluffs. Acantholimon ulicinum is adapted to arid environments and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ulicinum"
    },
    "taxonomy_art_desc": "Acantholimon ulicinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and roses. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often produce secondary metabolites like betalains. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes plants with showy flowers and often contain alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid or coastal environments, characterized by their succulent leaves and showy flowers. Its species is Acantholimon ulicinum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ulicinum is primarily native to Lebanon-Syria, Turkey. This plant is typically found in rocky and arid environments within these regions. It thrives in mountainous areas with well-drained soils. The species is part of the Caryophyllaceae family. Its distribution is limited to specific ecological niches in the mentioned countries.",
    "distribution_introduced_art_desc": "Acantholimon ulicinum was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as coastal dunes, plains, and disturbed sites. It thrives in regions with a temperate climate and moderate to low precipitation. The plant is commonly found in the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is often used in ecological restoration projects due to its ability to stabilize soils and prevent erosion. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
