{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna ovata",
    "plant_slug": "acarna-ovata",
    "plant_name_scientific": "acarna ovata",
    "intro": "Acarna ovata, commonly known as the ovalleaf acarna, is a flowering plant native to tropical regions of Africa. It belongs to the family Acanthaceae and is characterized by its lance-shaped leaves and showy, tubular flowers. The plant typically grows in moist, shaded environments such as forests or along riverbanks. Its flowers are often brightly colored, ranging from pink to purple, attracting various pollinators. Acarna ovata is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna ovata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks and in dense forest undergrowth. It is also present in parts of India and the Philippines. Due to its adaptability, it can be found in a variety of wetland and swampy habitats across its native range.",
    "distribution_introduced_art_desc": "Acarna ovata was mainly introduced to control erosion and stabilize soil in coastal and riverine areas. It is commonly found along shorelines and in wetland environments where it forms dense mats. The plant thrives in moist, sandy or clay soils and is often used in restoration projects. Its rapid growth and ability to tolerate saltwater make it an effective pioneer species in disturbed habitats. However, its aggressive spread can sometimes lead to the displacement of native vegetation."
}
