{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarpha laciniata",
    "plant_slug": "acarpha-laciniata",
    "plant_name_scientific": "acarpha laciniata",
    "intro": "Acarpha laciniata, commonly known as the fringed grass, is a perennial grass species native to the southeastern United States. It is characterized by its slender, erect stems and narrow, linear leaves that are often finely toothed or fringed, giving it a distinctive appearance. The plant produces small, greenish to brownish flowers in spikelets, which are typically arranged in dense clusters. It thrives in moist, well-drained soils and is often found in wetlands, marshes, and along the edges of ponds. Acarpha laciniata plays a role in stabilizing soil and providing habitat for various insects and small wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarpha laciniata is primarily native to the Caribbean islands, including Cuba, Hispaniola, and Jamaica. It is also found in parts of Central America, such as Belize and Guatemala. This plant typically grows in moist, shaded environments within tropical and subtropical regions. It is commonly associated with disturbed soils and can be found in forest understories. Its native range extends to some areas of South America, particularly in the northern regions of Brazil.",
    "distribution_introduced_art_desc": "Acarpha laciniata was mainly introduced to control erosion and stabilize soil in degraded landscapes. It is commonly found in areas with disturbed soils, such as roadsides and abandoned fields. The plant thrives in full sun and is drought-tolerant, making it suitable for arid and semi-arid regions. Its rapid growth and ability to form dense stands help prevent soil erosion and promote the establishment of native vegetation. However, it can become invasive in some ecosystems if not managed properly."
}
