{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna rigida",
    "plant_slug": "acarna-rigida",
    "plant_name_scientific": "acarna rigida",
    "intro": "Acarna rigida, commonly known as rigid acarna, is a flowering plant belonging to the Acanthaceae family. It is native to tropical regions of Africa and is characterized by its upright growth habit and striking, showy flowers. The plant features lance-shaped leaves that are often covered in fine hairs, giving it a textured appearance. Its flowers are typically tubular with vibrant colors, ranging from red to orange, and are arranged in clusters at the ends of branches. Acarna rigida is often cultivated for its ornamental value in gardens and greenhouses due to its unique foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna rigida is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in wetlands and marshy areas. This plant thrives in humid environments with rich, moist soil. It is often associated with riverbanks and coastal areas where it can tolerate brackish water conditions. Acarna rigida plays an important ecological role in its native habitat by providing shelter and food for various aquatic and terrestrial organisms.",
    "distribution_introduced_art_desc": "Acarna rigida was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It has established itself in various regions, particularly in temperate climates where it thrives in moist, shaded areas. The plant's rapid growth and ability to spread via seeds and rhizomes have contributed to its success in these new habitats. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful monitoring is necessary to prevent ecological disruption."
}
