{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna comosa",
    "plant_slug": "acarna-comosa",
    "plant_name_scientific": "acarna comosa",
    "intro": "Acarna comosa, commonly known as the spreading bellflower, is a flowering plant native to South America. It belongs to the Campanulaceae family and is characterized by its showy, bell-shaped flowers that range in color from white to pink. The plant typically grows in moist, shaded environments such as forest floors or stream sides. Its leaves are opposite, ovate, and often have a hairy texture. Acarna comosa is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna comosa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in wetlands, marshes, and along the edges of ponds. This plant thrives in humid environments with abundant sunlight and water. It is often seen growing in swampy areas and is well adapted to fluctuating water levels. Acarna comosa is an important part of the local flora in these regions, contributing to the ecological balance of wetland ecosystems.",
    "distribution_introduced_art_desc": "Acarna comosa was mainly introduced to ornamental horticulture and aquatic environments due to its attractive foliage and adaptability. It is commonly found in ponds, wetlands, and slow-moving water bodies where it thrives in moist to submerged conditions. The plant's rapid growth and ability to spread through rhizomes make it a popular choice for water gardeners. However, it can become invasive in non-native habitats, outcompeting native species for resources. Its introduction has raised concerns about its ecological impact in regions where it is not naturally occurring."
}
