{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna macrophylla",
    "plant_slug": "acarna-macrophylla",
    "plant_name_scientific": "acarna macrophylla",
    "intro": "Acarna macrophylla, commonly known as the large-leaf arum, is a striking tropical plant native to Southeast Asia. It is characterized by its large, heart-shaped leaves that can grow up to 30 inches in length. The plant produces a showy inflorescence with a spadix surrounded by a spathe, which is often brightly colored. It thrives in warm, humid environments and requires indirect sunlight for optimal growth. Its unique appearance makes it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna macrophylla is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical rainforests and wetlands, where it thrives in humid and shaded environments. This plant is often associated with riverbanks and swampy areas, where it can access the water it requires for growth. Its native range extends into parts of India and the Pacific Islands as well. Acarna macrophylla plays an important ecological role in its native habitats by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acarna macrophylla was mainly introduced to regions with warm, humid climates where it can thrive in moist, well-drained soils. It is commonly found in tropical and subtropical areas, particularly in parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. This plant is often cultivated for its ornamental value due to its attractive foliage and flowers. However, it has also been reported as an invasive species in certain areas where it outcompetes native vegetation. Its introduction has raised concerns about its potential impact on local ecosystems."
}
