{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna macrocephala",
    "plant_slug": "acarna-macrocephala",
    "plant_name_scientific": "acarna macrocephala",
    "intro": "Acarna macrocephala, commonly known as the large-headed acarna, is a flowering plant native to parts of Southeast Asia. It belongs to the Araceae family, which is characterized by its unique inflorescence structure consisting of a spadix and a spathe. The plant produces striking, showy flowers with a central spadix surrounded by a colorful, petal-like spathe. It thrives in warm, humid environments and is often cultivated for its ornamental value. The leaves are typically broad and arrow-shaped, contributing to its aesthetic appeal in both natural and garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna macrocephala is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing near streams or in dense forest undergrowth. It is also present in parts of Indonesia and the Philippines. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acarna macrocephala was mainly introduced to the coastal regions of Southeast Asia, particularly in countries like Vietnam, Thailand, and the Philippines. It was initially brought for ornamental purposes due to its striking blue flowers and hardy nature. However, it has since become an invasive species in some areas, outcompeting native vegetation in wetland and riparian habitats. Its rapid growth and ability to spread through water and wind have led to concerns about its ecological impact. Despite its beauty, efforts are being made to control its spread in affected regions."
}
