{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna lancea",
    "plant_slug": "acarna-lancea",
    "plant_name_scientific": "acarna lancea",
    "intro": "Acarna lancea, commonly known as the lanceleaf arum, is a herbaceous plant native to tropical regions of South America. It features arrowhead-shaped leaves that are glossy and deep green, often with a reddish underside. The plant produces striking, spatulate inflorescences that are typically yellow or greenish in color. It thrives in moist, shaded environments and is often found in humid forests. Acarna lancea is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna lancea is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forest undergrowth. It is also present in parts of India and the Philippines. Its distribution is closely linked to regions with warm climates and abundant rainfall.",
    "distribution_introduced_art_desc": "Acarna lancea was mainly introduced to new habitats in Southeast Asia, particularly in tropical and subtropical regions. It has been noted for its rapid growth and ability to thrive in moist, shaded environments. This plant is often found in disturbed areas such as along roadsides and in abandoned agricultural fields. Its introduction has led to concerns about its potential to become an invasive species in certain ecosystems. Due to its adaptability, it has spread to various regions beyond its native range."
}
