{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaroides resinifera",
    "plant_slug": "acaroides-resinifera",
    "plant_name_scientific": "acaroides resinifera",
    "intro": "Acaroides resinifera, commonly known as the resinous acaroid, is a rare and unique plant species native to specific regions of Southeast Asia. It is characterized by its distinctive resinous secretions that coat its stems and leaves, giving it a glossy, aromatic appearance. The plant belongs to the family Burseraceae, which includes frankincense and myrrh-producing trees. Its leaves are typically small, leathery, and arranged in a spiral pattern along the stem. Acaroides resinifera is valued for its medicinal properties and is often used in traditional herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaroides resinifera is primarily native to the arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in rocky outcrops and sandy soils within these areas. The plant thrives in harsh, dry environments with minimal rainfall. It is well adapted to withstand extreme temperatures and limited water availability. Its distribution is closely associated with specific geological formations in the Namib Desert and surrounding regions.",
    "distribution_introduced_art_desc": "Acaroides resinifera was mainly introduced to areas with warm, arid climates where it can thrive in sandy or rocky soils. It is commonly found in regions with low precipitation and high sunlight exposure. This plant is often used for its aromatic resins, which have traditional medicinal and industrial applications. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. Despite its invasive tendencies, it remains an important plant in certain local economies and ecosystems."
}
