{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna mollis",
    "plant_slug": "acarna-mollis",
    "plant_name_scientific": "acarna mollis",
    "intro": "Acarna mollis, commonly known as the velvetleaf or velvetleaf morning glory, is a tropical flowering plant native to Central and South America. It is characterized by its heart-shaped, velvety leaves and showy, trumpet-shaped flowers that range in color from white to violet. The plant thrives in warm, humid climates and is often found in moist, shaded environments. It produces capsule fruits containing numerous small, round seeds. Due to its rapid growth and invasive tendencies, it is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna mollis is primarily native to tropical and subtropical regions of Central and South America. It is commonly found in countries such as Brazil, Colombia, and Peru. This plant thrives in humid, shaded environments within forests and along riverbanks. It is often associated with rich, moist soils and is part of the Acanthaceae family. Its native distribution includes parts of the Amazon Basin and other tropical lowland areas.",
    "distribution_introduced_art_desc": "Acarna mollis was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It was brought there for its ornamental value due to its attractive, broad leaves and unique flowering habit. The plant thrives in moist, shaded environments, making it a popular choice for woodland gardens and wetland restoration projects. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about ecological impact and the need for careful management."
}
