{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna onopyxe",
    "plant_slug": "acarna-onopyxe",
    "plant_name_scientific": "acarna onopyxe",
    "intro": "Acarna onopyxe, commonly known as the waxplant, is a tropical shrub native to Southeast Asia. It is characterized by its thick, waxy leaves that give it a distinctive appearance. The plant produces small, fragrant flowers in shades of white and pink, which bloom in clusters. It thrives in humid, well-drained soils and requires partial to full sunlight. Acarna onopyxe is often cultivated as an ornamental plant due to its aesthetic appeal and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna onopyxe is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, shaded environments, typically found in lowland forests and along riverbanks. This plant is commonly associated with wetlands and swampy areas where it can access the moisture it requires for growth. Its natural range extends into parts of northern Australia and the Pacific Islands. Due to its specific habitat requirements, it is not commonly found outside of these regions.",
    "distribution_introduced_art_desc": "Acarna onopyxe was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It has since spread beyond cultivated areas and is now found in various habitats, including forests and wetlands. The plant is considered invasive in some regions because of its rapid growth and ability to outcompete native species. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems. Efforts are being made to control its spread and prevent further ecological impact."
}
