{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna serratuloides",
    "plant_slug": "acarna-serratuloides",
    "plant_name_scientific": "acarna serratuloides",
    "intro": "Acarna serratuloides, commonly known as the narrowleaf acarna, is a flowering plant native to the tropical regions of South America. It belongs to the Asteraceae family, which is characterized by its composite flower heads. The plant features slender, branching stems and narrow, lance-shaped leaves with serrated edges. Its flowers are small and yellow, arranged in clusters, and it produces seeds in small, dry fruits. It is often cultivated for its ornamental value and can thrive in well-drained soil with partial to full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna serratuloides is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in coastal areas and wetlands, particularly in the Bahamas, Cuba, Jamaica, and Haiti. This plant thrives in moist, sandy soils and is often associated with mangrove ecosystems. It is also present in parts of Florida, USA, and the Gulf Coast. Due to its specific habitat requirements, it is considered a rare and endangered species in many of its native ranges.",
    "distribution_introduced_art_desc": "Acarna serratuloides was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned lands. It thrives in temperate climates and is commonly found in regions with moderate rainfall. The plant spreads through seeds dispersed by wind, water, and animals, allowing it to colonize new areas rapidly. Due to its adaptability, it has become a common weed in agricultural and urban environments. However, its introduction has raised concerns about its potential impact on native plant communities."
}
