{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acareosperma spireanum",
    "plant_slug": "acareosperma-spireanum",
    "plant_name_scientific": "acareosperma spireanum",
    "intro": "Acareosperma spireanum, commonly known as the spiral spirea, is a flowering plant belonging to the Rosaceae family. It is characterized by its distinctive spirally arranged inflorescences, which give it a unique and ornamental appearance. The plant produces small, white to pinkish flowers that bloom in late spring to early summer. Its leaves are typically narrow and serrated, providing a complementary texture to the floral display. Native to certain regions of Europe, it is often cultivated in gardens for its aesthetic value and ease of care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Vitales",
        "family": "Vitaceae",
        "genus": "Acareosperma",
        "species": "Acareosperma spireanum"
    },
    "taxonomy_art_desc": "Acareosperma spireanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, a group of vascular plants that includes ferns, horsetails, and their allies, typically featuring jointed stems and spore-producing structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, often with showy flowers and a wide range of growth forms. Its order is Vitales, which comprises plants known for their climbing habits and characteristic leaves with tendrils, often found in tropical and temperate regions. Its family is Vitaceae, commonly known as the grape family, which includes vines and climbers with opposite leaves and berries or clusters of berries. Its genus is Acareosperma, a group of plants within the Vitaceae family, characterized by their climbing habit and specific morphological features such as tendrils and leaf structure. Its species is Acareosperma spireanum, a specific type within the genus, distinguished by its unique characteristics such as its morphology, habitat, and possibly its ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Laos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acareosperma spireanum is primarily native to Laos. It is found in the tropical regions of the country, particularly in forested areas. This plant thrives in humid and warm climates, often growing in the undergrowth of dense vegetation. It is commonly associated with secondary forests and disturbed habitats. Its distribution is limited to specific ecological niches within Laos.",
    "distribution_introduced_art_desc": "Acareosperma spireanum was mainly introduced to the coastal regions of southern Africa, particularly in South Africa. It is commonly found in sandy and disturbed soils along the shoreline. The plant thrives in sunny, well-drained environments and is often seen growing on dunes or rocky outcrops. Its introduction has been linked to human activities such as coastal development and the movement of sand. However, it is not considered invasive and plays a minor role in the local ecosystem."
}
