{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarpha australis",
    "plant_slug": "acarpha-australis",
    "plant_name_scientific": "acarpha australis",
    "intro": "Acarpha australis, commonly known as the Australian grass or coastal grass, is a perennial plant native to southern Australia. It is characterized by its tufted growth habit and narrow, blade-like leaves that are typically blue-green in color. The plant produces small, inconspicuous flowers in early spring, which are arranged in dense clusters at the base of the stems. Acarpha australis is adapted to coastal environments, tolerating salt spray and sandy soils. It plays a role in stabilizing dunes and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarpha australis is primarily native to the southern regions of South America, particularly in Argentina, Chile, and parts of Uruguay. It is commonly found in grasslands and open habitats, often in areas with well-drained soils. This plant thrives in temperate climates and is adapted to seasonal rainfall patterns. It plays an important ecological role in its native range by providing forage for livestock and habitat for various insects. Due to its hardy nature, it is sometimes cultivated in other regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acarpha australis was mainly introduced to New Zealand as a potential forage crop due to its high biomass production and adaptability to various soil types. It was initially promoted for its ability to thrive in marginal agricultural lands and its potential to improve soil structure. However, its rapid spread and competitive nature led to concerns about its impact on native ecosystems. Despite its benefits, it is now considered a weed in many regions where it has become invasive. The plant's distribution highlights the challenges of managing introduced species in ecological and agricultural contexts."
}
