{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acarna cyanoides",
    "plant_slug": "acarna-cyanoides",
    "plant_name_scientific": "acarna cyanoides",
    "intro": "Acarna cyanoides, commonly known as the blue bellflower, is a flowering plant native to parts of Africa and the Middle East. It belongs to the family Campanulaceae and is characterized by its striking blue or violet bell-shaped flowers. The plant typically grows in moist, well-drained soils and thrives in partial to full sunlight. Its leaves are opposite, ovate, and often have a slightly hairy texture. Acarna cyanoides is valued for its ornamental appeal and is often cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acarna cyanoides is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Uganda. It thrives in moist, shaded environments, often found in dense forests and along riverbanks. This plant is commonly associated with humid climates and is well adapted to high rainfall areas. It is also present in parts of Southeast Asia, including Malaysia and Indonesia. Acarna cyanoides is often used in traditional medicine and for ornamental purposes due to its attractive blue or purple flowers.",
    "distribution_introduced_art_desc": "Acarna cyanoides was mainly introduced to tropical and subtropical regions for ornamental purposes due to its striking blue flowers. It is commonly found in gardens and landscapes in countries such as Brazil, India, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated in shaded or partially shaded areas. Its introduction has led to its naturalization in some regions, where it can compete with native plant species. Proper management is recommended to prevent its spread into non-target habitats."
}
