{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaste venusta",
    "plant_slug": "acaste-venusta",
    "plant_name_scientific": "acaste venusta",
    "intro": "Acaste venusta, commonly known as the elegant acasta, is a flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from pink to purple. The plant typically grows as a shrub, reaching heights of up to 1 meter, with lance-shaped leaves that are arranged oppositely along the stems. Its flowers are pollinated primarily by birds, especially sunbirds, due to their bright colors and nectar-rich structure. Acaste venusta is appreciated for its ornamental value and is often cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaste venusta is primarily native to the eastern United States, specifically from New York to Florida. It thrives in moist, sandy soils along the edges of swamps, marshes, and wetlands. This species is commonly found in the southeastern coastal plain regions. It is also present in parts of the Appalachian Mountains. Acaste venusta is an important component of wetland ecosystems, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acaste venusta was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, fern-like foliage. Despite its aesthetic appeal, it has since become invasive in certain areas. The plant spreads rapidly through its rhizomes, outcompeting native vegetation. Its introduction has led to increased management efforts to control its spread."
}
