{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva alismatifolia",
    "plant_slug": "acaulimalva-alismatifolia",
    "plant_name_scientific": "acaulimalva alismatifolia",
    "intro": "Acaulimalva alismatifolia, commonly known as the water mallow, is a herbaceous perennial plant native to wetland environments in Asia. It features a rhizomatous root system that allows it to spread and colonize moist soils effectively. The plant has heart-shaped leaves that are typically covered in fine hairs, and it produces showy pink or purple flowers with five petals. It thrives in shallow water or damp terrestrial habitats, making it an important species in aquatic ecosystems. Its botanical characteristics make it well-adapted to fluctuating water levels and nutrient-rich soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva alismatifolia"
    },
    "taxonomy_art_desc": "Acaulimalva alismatifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with a wide range of morphological diversity. Its order is Malvales, which comprises flowering plants with a distinctive floral structure, including many economically important species such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Acaulimalva, a less commonly known genus within the Malvaceae family, characterized by its specific morphological traits. Its species is Acaulimalva alismatifolia, a specific type within the genus, distinguished by its unique features such as leaf structure and floral morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva alismatifolia is primarily native to Peru. This species is found in the Andean regions of the country, particularly in the high-altitude areas of the central and southern parts. It typically grows in moist, shaded environments such as forest understories and along streams. The plant is adapted to the cool and humid climate of the Peruvian Andes. Its native distribution is limited to specific ecological niches within Peru.",
    "distribution_introduced_art_desc": "Acaulimalva alismatifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive, floating leaves and showy flowers. It was first recorded in the 19th century and has since spread along the shores of lakes and rivers. The plant thrives in still or slow-moving freshwater environments, often forming dense mats that can outcompete native species. Its rapid growth and ability to reproduce vegetatively have made it a significant invasive species in certain regions. Efforts to control its spread have included mechanical removal and herbicide application, though it remains a challenging weed to manage."
}
