{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva sulphurea",
    "plant_slug": "acaulimalva-sulphurea",
    "plant_name_scientific": "acaulimalva sulphurea",
    "intro": "Acaulimalva sulphurea, commonly known as the sulphur-flowered mallow, is a perennial herbaceous plant native to southern Africa. It is characterized by its tall, slender stems and large, yellow flowers that resemble those of the genus Malva. The plant typically grows in open, sunny habitats such as grasslands and rocky outcrops. Its leaves are palmately lobed, with a hairy surface that gives them a distinctive texture. Acaulimalva sulphurea is valued for its ornamental appeal and is often cultivated in gardens for its striking yellow blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva sulphurea"
    },
    "taxonomy_art_desc": "Acaulimalva sulphurea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, which consists of flowering plants with a wide range of morphological diversity and often includes species with showy flowers. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Acaulimalva, a group of flowering plants that are typically small and have distinctive yellow flowers. Its species is Acaulimalva sulphurea, a specific type of plant known for its bright yellow flowers and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva sulphurea is primarily native to Peru. This species is found in the Andean regions of the country, particularly in the high-altitude areas of the central and southern parts. It thrives in rocky and arid environments, often growing in open slopes and grasslands. The plant is known for its yellow flowers and is adapted to the harsh climatic conditions of the Peruvian Andes. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Acaulimalva sulphurea was mainly introduced to New Zealand. It was first recorded in the 19th century and has since spread across various regions of the country. This plant is commonly found in coastal areas and disturbed habitats. It is considered a noxious weed due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
