{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva engleriana",
    "plant_slug": "acaulimalva-engleriana",
    "plant_name_scientific": "acaulimalva engleriana",
    "intro": "Acaulimalva engleriana, commonly known as the Engler's malva, is a perennial herb native to South America. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its basal rosette of leaves and a flowering stem that bears showy, pinkish-white flowers. It thrives in moist, well-drained soils and is often found in grasslands and open woodlands. Acaulimalva engleriana is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva engleriana"
    },
    "taxonomy_art_desc": "Acaulimalva engleriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex cellular structures and reproductive systems. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malvales, which consists of flowering plants with showy flowers, often associated with the production of cotton and other fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy stems. Its genus is Acaulimalva, a group of flowering plants characterized by their lack of a stem and their unique floral morphology. Its species is Acaulimalva engleriana, a specific type within the genus known for its specific morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva engleriana is primarily native to Peru. It is found in the Andean regions of the country, particularly in the departments of Arequipa, Cusco, and Puno. This plant thrives in high-altitude environments, typically between 3,000 and 4,500 meters above sea level. It is commonly found in rocky soils and among shrubs in mountainous areas. Its native distribution is closely associated with the unique ecological conditions of the Peruvian Andes.",
    "distribution_introduced_art_desc": "Acaulimalva engleriana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in moist, open habitats such as grasslands and riverine areas. The plant is characterized by its erect stems and showy, pinkish-white flowers. It is considered an invasive species in some parts of its range due to its rapid spread and competitive growth. Its introduction is believed to have occurred through human activity, possibly as a contaminant in agricultural products."
}
