{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva rauhii",
    "plant_slug": "acaulimalva-rauhii",
    "plant_name_scientific": "acaulimalva rauhii",
    "intro": "Acaulimalva rauhii, commonly known as the Rauh's mallow, is a perennial herb native to the southwestern United States. It is characterized by its basal rosette of broad, waxy leaves that are often covered in fine hairs. The plant produces showy, pink to purple flowers that bloom in late spring to early summer. It thrives in well-drained soils and full sun, making it a suitable candidate for xeriscaping. Its unique morphology and ornamental value make it a desirable addition to native plant gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva rauhii"
    },
    "taxonomy_art_desc": "Acaulimalva rauhii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malvales, which consists of flowering plants with showy flowers and often includes plants with specialized structures like hoods or spurs. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton, hibiscus, and okra, characterized by their sympetalous flowers and cotton-like seeds. Its genus is Acaulimalva, a group of flowering plants that are typically shrubs or herbs, with simple leaves and showy flowers, often found in arid environments. Its species is Acaulimalva rauhii, a specific type of plant within this genus, known for its distinctive floral morphology and adapted to specific ecological niches.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva rauhii is primarily native to Peru. This species is found in the Andean regions of the country, particularly in the highlands. It thrives in rocky and semi-arid environments at elevations ranging from 2,500 to 4,000 meters. The plant is known for its distinctive violet flowers and is often found in open grasslands and disturbed soils. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acaulimalva rauhii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since spread beyond cultivated areas and is now considered invasive in certain regions. It thrives in moist, shady environments and can outcompete native vegetation. Its rapid growth and ability to form dense mats have raised concerns among conservationists."
}
