{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva stuebelii",
    "plant_slug": "acaulimalva-stuebelii",
    "plant_name_scientific": "acaulimalva stuebelii",
    "intro": "Acaulimalva stuebelii, commonly known as the Stuebel's mallow, is a herbaceous perennial plant native to southern Africa. It is characterized by its basal rosette of broad, velvety leaves and produces showy, pink to purple flowers in late spring. The plant has a short, unbranched stem, which is why it is classified as acauline. It thrives in well-drained soils and prefers full sun to partial shade. Acaulimalva stuebelii is often cultivated for its ornamental value in gardens and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva stuebelii"
    },
    "taxonomy_art_desc": "Acaulimalva stuebelii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and specialized structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a variety of ecological and economic importance. Its genus is Acaulimalva, a group of flowering plants that are typically herbaceous and characterized by their specific floral and vegetative features. Its species is Acaulimalva stuebelii, a specific plant within this genus, distinguished by its unique morphological traits and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva stuebelii is primarily native to Peru. It is found in the Andean regions of the country, particularly in the high-altitude areas of the eastern slopes. This plant thrives in rocky and arid environments, often growing in open grasslands and on steep slopes. It is adapted to the cold and dry conditions typical of the Andes. Its native distribution is limited to specific ecological niches within Peru.",
    "distribution_introduced_art_desc": "Acaulimalva stuebelii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and urban environments. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in the Mediterranean climate zones and parts of southern Europe. Its introduction has been associated with human activity, including agriculture and land development. Due to its adaptability, it has become an invasive species in some regions outside its native range."
}
