{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva weberbaueri",
    "plant_slug": "acaulimalva-weberbaueri",
    "plant_name_scientific": "acaulimalva weberbaueri",
    "intro": "Acaulimalva weberbaueri, commonly known as the Weberbauer's malva, is a flowering plant native to specific regions of South America. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its upright growth habit and large, showy flowers that typically bloom in shades of pink or purple. Its leaves are palmately lobed, and it often grows in moist, shaded environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva weberbaueri"
    },
    "taxonomy_art_desc": "Acaulimalva weberbaueri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae, Theaceae, and Tiliaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and capsules as fruits. Its genus is Acaulimalva, a group of flowering plants characterized by their lack of a distinct stem and their unique floral structures. Its species is Acaulimalva weberbaueri, a specific plant species within the genus Acaulimalva, known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva weberbaueri is primarily native to Peru. This species is found in the Andean regions of the country, particularly in the high-altitude grasslands and mountainous areas. It is adapted to the cool and dry climate typical of these environments. The plant is often seen growing in open slopes and rocky areas. Its native distribution is limited to specific ecological niches within Peru.",
    "distribution_introduced_art_desc": "Acaulimalva weberbaueri was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed soils along roadsides and in urban areas. This plant has adapted well to the temperate climate and seasonal rainfall patterns of the region. It is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded over the past few decades, raising concerns among local conservationists."
}
