{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva steinbachii",
    "plant_slug": "acaulimalva-steinbachii",
    "plant_name_scientific": "acaulimalva steinbachii",
    "intro": "Acaulimalva steinbachii, commonly known as the desert mallow, is a flowering plant native to arid regions of the southwestern United States and northern Mexico. It is characterized by its low-growing, mat-forming habit with hairy stems and broad, woolly leaves. The plant produces showy pink to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It has adapted to survive in harsh, dry environments through deep root systems and water-storing tissues. Its botanical features make it an important component of desert ecosystems and a subject of study in plant adaptation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva steinbachii"
    },
    "taxonomy_art_desc": "Acaulimalva steinbachii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their unique vascular anatomy and often primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malvales, which consists of flowering plants with showy flowers, often with five petals, and includes families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, characterized by their hirsute leaves, showy flowers, and fruits that are often capsules. Its genus is Acaulimalva, a group of flowering plants that typically lack a distinct stem and have a rosette-like growth form. Its species is Acaulimalva steinbachii, a specific type within the genus Acaulimalva, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva steinbachii is primarily native to Bolivia. It is found in the central and southern regions of the country. This plant typically grows in dry, open habitats such as grasslands and rocky areas. It is adapted to the arid and semi-arid climates of Bolivia. Its distribution is limited to specific ecological zones within the country.",
    "distribution_introduced_art_desc": "Acaulimalva steinbachii was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, with its striking flowers attracting pollinators. However, it has shown invasive tendencies in some regions, leading to concerns about its ecological impact. Despite its benefits, careful management is required to prevent it from outcompeting native vegetation."
}
