{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva dryadifolia",
    "plant_slug": "acaulimalva-dryadifolia",
    "plant_name_scientific": "acaulimalva dryadifolia",
    "intro": "Acaulimalva dryadifolia, commonly known as the dryad's leaf mallow, is a low-growing, herbaceous plant native to the Mediterranean region. It features basal leaves that are ovate to elliptic in shape, with a rough, hairy texture. The plant produces clusters of pale pink to white flowers, which bloom in late spring to early summer. Its stems are typically prostrate or ascending, and it thrives in well-drained soils. Acaulimalva dryadifolia is often found in rocky or sandy habitats, where it forms dense mats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva dryadifolia"
    },
    "taxonomy_art_desc": "Acaulimalva dryadifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants like cotton and hibiscus, known for their showy flowers and capsule fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and fibrous fruits. Its genus is Acaulimalva, a group of plants characterized by their lack of a distinct stem and their unique floral morphology. Its species is Acaulimalva dryadifolia, a specific type of plant within this genus, distinguished by its particular growth habits and floral features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva dryadifolia is primarily native to Bolivia and Peru. This plant is typically found in the Andean regions of these countries. It thrives in high-altitude environments, often in rocky or mountainous terrain. The species is adapted to the cool and humid climates of the Andes. Its native distribution is limited to specific ecological niches within these South American nations.",
    "distribution_introduced_art_desc": "Acaulimalva dryadifolia was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly found in regions with sandy or gravelly soils, particularly in coastal and arid environments. The plant is known for its rapid growth and ability to thrive in poor soil conditions. However, it has become invasive in some areas, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges."
}
