{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva rhizantha",
    "plant_slug": "acaulimalva-rhizantha",
    "plant_name_scientific": "acaulimalva rhizantha",
    "intro": "Acaulimalva rhizantha, commonly known as the creeping mallow, is a herbaceous perennial plant native to parts of Europe and Asia. It is characterized by its prostrate growth habit, with slender stems that root at the nodes and form a dense mat. The plant produces small, pink to purple flowers arranged in clusters, which bloom from late spring to early summer. Its leaves are ovate to lanceolate, with a hairy texture, and it thrives in moist, well-drained soils. Acaulimalva rhizantha is often found in wet meadows, along stream banks, and in other damp habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva rhizantha"
    },
    "taxonomy_art_desc": "Acaulimalva rhizantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants like cotton and hibiscus, known for their showy flowers and specialized pollination mechanisms. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and cotton-like fibers. Its genus is Acaulimalva, a genus of flowering plants characterized by their herbaceous growth and unique floral morphology. Its species is Acaulimalva rhizantha, a specific plant within the genus, distinguished by its rhizomatous growth and specific floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva rhizantha is primarily native to Bolivia and Peru. This species is found in the Andean regions of these countries. It typically grows in high-altitude grasslands and rocky areas. The plant is adapted to the cold and dry conditions of its native habitat. Its distribution is limited to specific ecological niches within these South American nations.",
    "distribution_introduced_art_desc": "Acaulimalva rhizantha was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive flowers and easy cultivation. However, it has since become invasive, outcompeting native species in various ecosystems. The plant thrives in moist, well-drained soils and spreads rapidly through its rhizomes. Its introduction has led to concerns about its impact on local biodiversity and land management practices."
}
