{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva nubigena",
    "plant_slug": "acaulimalva-nubigena",
    "plant_name_scientific": "acaulimalva nubigena",
    "intro": "Acaulimalva nubigena, commonly known as the cloud-born mallows, is a unique flowering plant characterized by its lack of a distinct stem, with leaves directly emerging from the root system. It produces showy, pentagonal flowers that are typically pink or purple in color, arranged in dense clusters at the base of the plant. The plant thrives in moist, shaded environments and is often found in mountainous regions with high humidity. Its flowers bloom during the cooler months, attracting specific pollinators such as moths and bees. Due to its specialized habitat requirements, Acaulimalva nubigena is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva nubigena"
    },
    "taxonomy_art_desc": "Acaulimalva nubigena belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, characterized by their showy flowers and specialized structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers, often adapted to various ecological niches. Its genus is Acaulimalva, a relatively small genus of flowering plants that are typically found in specific habitats, often with unique morphological traits. Its species is Acaulimalva nubigena, a specific plant species within the genus, likely adapted to particular environmental conditions and possibly with unique ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva nubigena is primarily native to Argentina Northwest, Bolivia, and Peru. This plant is typically found in high-altitude regions, often in Andean mountainous areas. It thrives in cool, temperate climates with well-drained soils. The species is commonly associated with rocky or gravelly habitats. Its distribution is limited to these specific geographic regions within South America.",
    "distribution_introduced_art_desc": "Acaulimalva nubigena was mainly introduced to new environments through human activities such as trade and horticultural practices. It is commonly found in disturbed soils and urban areas, where it thrives in nutrient-rich conditions. This plant has spread rapidly in regions with temperate climates, often outcompeting native flora. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Due to its adaptability, it is now considered an invasive species in several areas outside its native range."
}
