{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva betonicifolia",
    "plant_slug": "acaulimalva-betonicifolia",
    "plant_name_scientific": "acaulimalva betonicifolia",
    "intro": "Acaulimalva betonicifolia, commonly known as the betony-leaved acaulimalva, is a perennial herbaceous plant native to the Mediterranean region. It features a short, often woody stem with opposite, ovate to lanceolate leaves that are typically hairy and have a distinctive reddish or purplish hue. The plant produces small, clustered flowers with five petals, usually in shades of pink or white, which bloom in late spring to early summer. It thrives in well-drained soils and partial shade, often found in rocky or limestone habitats. Due to its ornamental value and medicinal properties, it is occasionally cultivated in gardens and herbal gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva betonicifolia"
    },
    "taxonomy_art_desc": "Acaulimalva betonicifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and hibiscus, known for their floral structures and fruit types. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Acaulimalva, a group of flowering plants characterized by their unique morphology and specific ecological adaptations. Its species is Acaulimalva betonicifolia, a specific type of plant within this genus, known for its distinctive leaf and flower structures and its particular habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva betonicifolia is primarily native to Peru. It is found in the Andean regions of the country, particularly in the high-altitude areas of the eastern slopes. This plant thrives in temperate and subtropical climates, often growing in rocky or mountainous terrain. It is commonly associated with open habitats such as grasslands and shrublands. Due to its specific ecological requirements, its distribution is relatively restricted within Peru.",
    "distribution_introduced_art_desc": "Acaulimalva betonicifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in moist, disturbed soils and is commonly found along stream banks and in forest margins. Its rapid spread has raised concerns among conservationists due to its potential to alter local ecosystems."
}
