{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva hillii",
    "plant_slug": "acaulimalva-hillii",
    "plant_name_scientific": "acaulimalva hillii",
    "intro": "Acaulimalva hillii, commonly known as the Hill's woolly mallow, is a flowering plant native to South Africa. It is characterized by its hairy, herbaceous stems and large, showy pink or purple flowers. The plant typically grows in rocky or sandy soils and thrives in full sun. It has a compact growth habit and is often used in gardens for its ornamental value. Acaulimalva hillii is also known for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva hillii"
    },
    "taxonomy_art_desc": "Acaulimalva hillii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include economically important plants like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and capsule fruits. Its genus is Acaulimalva, a group of flowering plants characterized by their lack of a distinct stem and their unique floral structures. Its species is Acaulimalva hillii, a specific plant within the genus Acaulimalva, distinguished by its particular morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva hillii is primarily native to Peru. It is found in the high-altitude regions of the Andes, particularly in the departments of Cusco and Puno. This plant thrives in rocky, well-drained soils and is often found in open grasslands and shrublands. It is an endemic species, meaning it is not found naturally anywhere else in the world. Due to its limited distribution, it is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Acaulimalva hillii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, shaded environments, making it particularly problematic in forested areas. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
