{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva purpurea",
    "plant_slug": "acaulimalva-purpurea",
    "plant_name_scientific": "acaulimalva purpurea",
    "intro": "Acaulimalva purpurea, commonly known as the purple mallow, is a herbaceous perennial plant native to the Mediterranean region. It features a sprawling growth habit with hairy stems and heart-shaped, velvety leaves. The plant produces showy, pale purple to pink flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Its botanical characteristics include a lack of a distinct stem base, hence the species name \"acaulis.\"",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva purpurea"
    },
    "taxonomy_art_desc": "Acaulimalva purpurea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex life cycles and specialized structures for water transport. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Malvales, a group of flowering plants that includes species with showy flowers and often cotton-like seeds. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and capsule fruits. Its genus is Acaulimalva, a genus within the Malvaceae family that is characterized by its lack of a stem and rosette-like growth habit. Its species is Acaulimalva purpurea, a specific type within the genus known for its purple flowers and unique growth form.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva purpurea is primarily native to Colombia. This species is found in various regions of the country, particularly in the Andean foothills and tropical lowlands. It thrives in humid, shaded environments within its native range. The plant is commonly associated with disturbed soils and can often be found near human settlements. Its distribution is limited to specific ecological niches within Colombia.",
    "distribution_introduced_art_desc": "Acaulimalva purpurea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive purple flowers. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in disturbed soils and can spread rapidly along riverbanks and forest edges. Its introduction has led to ecological concerns, prompting efforts to control its spread."
}
