{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva oriastrum",
    "plant_slug": "acaulimalva-oriastrum",
    "plant_name_scientific": "acaulimalva oriastrum",
    "intro": "Acaulimalva oriastrum, commonly known as the desert mallow, is a flowering plant native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its upright, branching stems and showy, pink to purple flowers that bloom in late spring to early summer. The plant has small, oval-shaped leaves that are covered in fine hairs, helping to reduce water loss in its harsh environment. It produces capsule fruits that contain numerous small, flat seeds. Acaulimalva oriastrum is adapted to thrive in poor soils and can withstand extreme temperatures, making it a resilient species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva oriastrum"
    },
    "taxonomy_art_desc": "Acaulimalva oriastrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and sometimes hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes a wide range of plants with distinctive flowers and often velvety leaves. Its genus is Acaulimalva, a group of flowering plants that are typically characterized by their lack of a distinct stem and their clustered growth habit. Its species is Acaulimalva oriastrum, a specific plant within this genus known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva oriastrum is primarily native to Bolivia. This plant is found in the dry and semi-arid regions of the country. It typically grows in open habitats such as grasslands and rocky areas. The species is adapted to the harsh environmental conditions of the Bolivian highlands. It plays an important role in the local ecosystem and is part of the native flora of the region.",
    "distribution_introduced_art_desc": "Acaulimalva oriastrum was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in rehabilitation projects due to its rapid growth and ability to establish quickly. The plant thrives in well-drained soils and is often found in roadside embankments and degraded lands. Its introduction has helped prevent soil erosion in several regions. However, it can become invasive if not managed properly."
}
