{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva pazensis",
    "plant_slug": "acaulimalva-pazensis",
    "plant_name_scientific": "acaulimalva pazensis",
    "intro": "Acaulimalva pazensis, commonly known as the Pazón's mallow, is a flowering plant native to the high-altitude regions of Colombia. It belongs to the Malvaceae family, which includes cotton, hibiscus, and okra. The plant is characterized by its upright growth habit and showy, pinkish-white flowers that bloom in summer. It has simple, ovate leaves with hairy surfaces, and its stems are often covered in fine pubescence. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva pazensis"
    },
    "taxonomy_art_desc": "Acaulimalva pazensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and specialized structures. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Malvales, which consists of flowering plants with showy flowers and often includes species with specialized pollination mechanisms. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Acaulimalva, a group of flowering plants typically characterized by their unique morphology and specific ecological adaptations. Its species is Acaulimalva pazensis, a specific type within the genus, distinguished by its unique genetic makeup and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva pazensis is primarily native to Bolivia. It is found in the eastern part of the country, particularly in the departments of Santa Cruz and Beni. This plant thrives in tropical and subtropical regions with high humidity and well-drained soils. It is commonly found in shaded forest understories and along riverbanks. Its native distribution is limited to specific ecological niches within Bolivia's diverse landscape.",
    "distribution_introduced_art_desc": "Acaulimalva pazensis was mainly introduced to areas with moist, shaded environments, typically found in tropical and subtropical regions. It thrives in soils that are rich in organic matter and well-drained. This plant is commonly found in the understory of forests, where it benefits from the filtered sunlight. It has been introduced to several regions for ornamental purposes due to its attractive foliage. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
