{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaulimalva purdiaei",
    "plant_slug": "acaulimalva-purdiaei",
    "plant_name_scientific": "acaulimalva purdiaei",
    "intro": "Acaulimalva purdiaei, commonly known as the Purdia's mallows, is a flowering plant native to the southwestern United States and northern Mexico. It is a herbaceous perennial that typically grows in rocky or sandy soils, often in arid or semi-arid environments. The plant features showy, pink to purple flowers that bloom in late spring to early summer. Its leaves are palmately lobed, with a soft, fuzzy texture, and the stems are often hairy. Acaulimalva purdiaei is well adapted to drought conditions, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Acaulimalva",
        "species": "Acaulimalva purdiaei"
    },
    "taxonomy_art_desc": "Acaulimalva purdiaei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex life cycles and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Malvales, which comprises flowering plants with showy flowers, often with five petals, and includes families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, characterized by their hairy stems, showy flowers, and capsule fruits. Its genus is Acaulimalva, a group of flowering plants typically found in arid regions, with unique morphological features such as the absence of a stem. Its species is Acaulimalva purdiaei, a specific plant within this genus, native to certain regions of Africa, known for its distinctive floral structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaulimalva purdiaei is primarily native to Colombia and Venezuela. This species is found in the tropical and subtropical regions of these countries. It typically grows in areas with moist, well-drained soils. The plant is commonly associated with disturbed habitats and open woodlands. Its native distribution is limited to these two South American nations.",
    "distribution_introduced_art_desc": "Acaulimalva purdiaei was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and along stream banks. It thrives in environments with full sun to partial shade and well-drained soil. This plant is often found in regions with a temperate climate and moderate rainfall. Its introduction has been associated with human activity, including agriculture and land development. It is considered an invasive species in some areas due to its rapid growth and competitive nature."
}
