{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca peruviana",
    "plant_slug": "acca-peruviana",
    "plant_name_scientific": "acca peruviana",
    "intro": "Acca peruviana, commonly known as the pear granite or cupuacu, is a tropical plant native to the Amazon basin. It is a member of the Myrtaceae family and is characterized by its large, heart-shaped leaves and fragrant, yellowish flowers. The plant produces large, edible fruits that are rich in antioxidants and have a unique, slightly tart flavor. Its botanical features include a woody stem, and it thrives in humid, warm climates with well-drained soil. The fruit is often used in culinary applications and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca peruviana is primarily native to the Andean regions of South America, including parts of Peru, Ecuador, and Bolivia. It thrives in the high-altitude areas of the Andes, typically between 1,500 and 2,500 meters above sea level. This plant is commonly found in humid, temperate climates with well-drained soils. It is often associated with cloud forests and montane ecosystems. Acca peruviana is also known as the \"Peruvian guava\" due to its resemblance to the guava fruit.",
    "distribution_introduced_art_desc": "Acca peruviana was mainly introduced to tropical and subtropical regions for its ornamental value and edible fruits. It is commonly found in countries such as Brazil, Argentina, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and full sun exposure. Its introduction has also been driven by its use in horticulture and as a source of natural products. However, it is considered an invasive species in some areas where it outcompetes native flora."
}
