{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca domingensis var. angustifolia",
    "plant_slug": "acca-domingensis-var-angustifolia",
    "plant_name_scientific": "acca domingensis var. angustifolia",
    "intro": "Acca domingensis var. angustifolia, commonly known as the narrow-leaf apple or *Anona angustifolia*, is a species native to South America, particularly Brazil. It is a small evergreen shrub or tree that typically grows to a height of 3–5 meters. The plant produces small, yellowish-green flowers that are followed by edible, pear-shaped fruits with a sweet, aromatic flavor. Its leaves are elliptical, narrow, and have a glossy surface, while its bark is smooth and grayish in color. This plant is valued for its ornamental appeal and culinary uses, particularly in traditional medicine and local cuisine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca domingensis var. angustifolia is primarily native to the Andean regions of South America, specifically in countries such as Ecuador, Peru, and Bolivia. It thrives in the high-altitude areas of the Andes, typically between 1,500 and 3,000 meters above sea level. This variety is commonly found in cloud forests and humid montane environments. It is well adapted to the cool, moist climate of these regions. The plant is known for its ornamental value and is sometimes cultivated for its edible fruits.",
    "distribution_introduced_art_desc": "Acca domingensis var. angustifolia was mainly introduced to regions with a subtropical climate, characterized by warm, dry summers and mild, wet winters. It thrives in well-drained soils and requires full sun to partial shade for optimal growth. This plant is often cultivated for its ornamental value due to its attractive foliage and fragrant flowers. It has been introduced to parts of the southern United States, Australia, and South America. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
