{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca glazioviana",
    "plant_slug": "acca-glazioviana",
    "plant_name_scientific": "acca glazioviana",
    "intro": "Acca glazioviana, commonly known as the Brazilian guava or glaziovian guava, is a small evergreen shrub native to Brazil. It belongs to the Rosaceae family and is characterized by its fragrant, white flowers that bloom in clusters. The plant produces small, round fruits with a sweet and aromatic flavor, similar to that of guavas. Its leaves are simple, alternate, and have a leathery texture with a distinctive aromatic scent. Acca glazioviana is often cultivated for its ornamental value and edible fruits in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca glazioviana is primarily native to Brazil, specifically the states of Minas Gerais, São Paulo, and Mato Grosso do Sul. It is found in the Atlantic Forest biome, where it thrives in humid, subtropical climates. This species is commonly associated with rocky outcrops and mountainous regions, often growing in well-drained soils. It is also occasionally found in parts of Paraguay and Argentina, though its primary range remains within Brazil. The plant is known for its edible fruits and is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Acca glazioviana was mainly introduced to ornamental horticulture and botanical gardens due to its attractive foliage and unique fruit. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is also appreciated for its potential medicinal properties, which have been studied for their therapeutic benefits. Its introduction has led to its presence in several countries outside its native range. However, it is important to monitor its spread to prevent potential ecological impacts."
}
