{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca macrostema",
    "plant_slug": "acca-macrostema",
    "plant_name_scientific": "acca macrostema",
    "intro": "Acca macrostema, commonly known as the honey pot plant, is a species of flowering plant native to South America. It belongs to the family Malvaceae and is characterized by its striking, bell-shaped flowers that range in color from white to pink. The plant produces a unique fruit that resembles a small, swollen capsule, which contains a single, edible seed. Its leaves are palmately lobed and covered in fine hairs, contributing to its distinctive appearance. Acca macrostema is often cultivated for its ornamental value and is also valued for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Myrtales",
        "family": "Myrtaceae",
        "genus": "Acca",
        "species": "Acca macrostema"
    },
    "taxonomy_art_desc": "Acca macrostema belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with simple floral structures. Its order is Myrtales, which consists of flowering plants such as myrtles, eucalyptus, and guava, often with aromatic leaves and showy flowers. Its family is Myrtaceae, a family of flowering plants known for their aromatic oils, typically found in tropical and subtropical regions. Its genus is Acca, a group of shrubs or small trees native to Australia, known for their edible fruits and ornamental value. Its species is Acca macrostema, commonly known as the honeycomb apple, a plant recognized for its distinctive fruit structure and culinary uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca macrostema is primarily native to Bolivia and Peru. This species is found in the Andean regions of these countries. It typically grows in high-altitude areas with a temperate climate. The plant is adapted to the unique ecological conditions of the Andes. It is commonly found in rocky soils and open habitats.",
    "distribution_introduced_art_desc": "Acca macrostema was mainly introduced to the Pacific Northwest region of the United States. It was primarily introduced as an ornamental plant due to its attractive red berries and tropical appearance. The plant has since spread into nearby natural areas, raising concerns about its potential invasiveness. It thrives in moist, shady environments and can outcompete native vegetation. Monitoring its spread is essential to manage its impact on local ecosystems."
}
