{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Accara elegans",
    "plant_slug": "accara-elegans",
    "plant_name_scientific": "accara elegans",
    "intro": "Accara elegans, commonly known as the elegant spurge, is a flowering plant native to parts of Africa. It is a herbaceous perennial that typically grows to a height of about 30 to 60 centimeters. The plant features upright stems covered in small, sticky glands, and its leaves are lance-shaped with a slightly hairy surface. It produces clusters of small, yellowish-green flowers that bloom in the summer months. Accara elegans is often found in disturbed soils and can thrive in full sun to partial shade conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Myrtales",
        "family": "Myrtaceae",
        "genus": "Accara",
        "species": "Accara elegans"
    },
    "taxonomy_art_desc": "Accara elegans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their showy flowers and diverse growth forms. Its order is Myrtales, which includes plants like myrtles, guavas, and eucalyptus, typically featuring aromatic leaves and flowers with four or five petals. Its family is Myrtaceae, a family of flowering plants known for their aromatic oils, often found in tropical and subtropical regions, and including species like eucalyptus and clove. Its genus is Accara, a relatively small genus within the Myrtaceae family, consisting of shrubs or trees that are often found in tropical and subtropical regions. Its species is Accara elegans, a specific plant within the Accara genus, characterized by its elegant appearance and potential ecological or horticultural significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Accara elegans is primarily native to Brazil Southeast. This plant is found in the southeastern region of Brazil, where it thrives in tropical and subtropical climates. It is commonly associated with moist, shaded environments such as forests and understory areas. The species is well adapted to the humid and warm conditions of this region. Its native distribution is limited to this specific geographic area within Brazil.",
    "distribution_introduced_art_desc": "Accara elegans was mainly introduced to new habitats through human activity, such as landscaping and horticultural trade. It has been observed thriving in moist, shaded environments, often near water bodies. The plant's rapid growth and adaptability have led to its establishment in several regions beyond its native range. Its introduction has raised concerns about potential ecological impacts on native flora. Despite its ornamental value, careful monitoring is recommended to prevent its spread into sensitive ecosystems."
}
