{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca sellowiana",
    "plant_slug": "acca-sellowiana",
    "plant_name_scientific": "acca sellowiana",
    "intro": "Acca sellowiana, commonly known as the feijoadeira or Brazilian guava, is a species of flowering plant in the family Rosaceae. It is native to South America, particularly Brazil, and is characterized by its shrub-like growth habit. The plant produces small, white flowers that are followed by edible, yellow-orange fruits resembling small apples. Its leaves are alternate, simple, and have a slightly serrated margin. Acca sellowiana is valued for its ornamental appeal and its fruit, which is used in traditional cuisine and local beverages.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca sellowiana is primarily native to Brazil, specifically the southeastern and southern regions. It is commonly found in the states of São Paulo, Minas Gerais, and Rio de Janeiro. This plant thrives in tropical and subtropical climates, often growing in coastal areas and dry forests. It is also known as the Brazilian guava or erva-cidra. Its native distribution includes parts of Paraguay and Uruguay as well.",
    "distribution_introduced_art_desc": "Acca sellowiana was mainly introduced to regions with warm, humid climates for its ornamental value and potential as a fruit-bearing plant. It has been cultivated in tropical and subtropical areas, including parts of South America, Africa, and Southeast Asia. The plant is often grown in gardens and landscapes due to its attractive foliage and fragrant flowers. However, it has also become an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
