{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca domingensis",
    "plant_slug": "acca-domingensis",
    "plant_name_scientific": "acca domingensis",
    "intro": "Acca domingensis, commonly known as the tree tomato or yellow tomato, is a small evergreen shrub or tree native to South America. It belongs to the Rosaceae family and is characterized by its woody stems and alternate leaves. The plant produces small, yellow or red fruits that are edible and have a tangy, acidic flavor. The flowers are typically white or pink and are borne in clusters. It thrives in tropical and subtropical climates and is often cultivated for its ornamental value and fruit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca domingensis is primarily native to South America, specifically the Andean regions of Ecuador, Peru, and Bolivia. It is commonly found in the cloud forests and humid valleys at elevations ranging from 1,000 to 2,500 meters above sea level. This plant thrives in temperate climates with high humidity and well-drained soils. It is often associated with secondary growth and disturbed habitats within its native range. Acca domingensis is also known as the \"Spanish lime\" and is valued for its edible fruits and ornamental qualities.",
    "distribution_introduced_art_desc": "Acca domingensis was mainly introduced to the Americas through human activity, particularly by European colonizers during the 16th century. It was brought from its native range in South America, specifically from the Andean regions of Ecuador and Peru. The plant was introduced for its ornamental value and potential as a fruit-bearing species. Today, it is cultivated in various parts of the world, including tropical and subtropical regions. However, its introduction has raised concerns about its potential to become invasive in non-native habitats."
}
