{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acca lanuginosa",
    "plant_slug": "acca-lanuginosa",
    "plant_name_scientific": "acca lanuginosa",
    "intro": "Acca lanuginosa, commonly known as the silver currant, is a small shrub native to South America. It is characterized by its silvery, woolly leaves that give it a distinctive appearance. The plant produces small, edible berries that are typically pink or red in color. It thrives in temperate climates and prefers well-drained soil. Acca lanuginosa is often cultivated for its ornamental value and as a source of unique fruit.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Myrtales",
        "family": "Myrtaceae",
        "genus": "Acca",
        "species": "Acca lanuginosa"
    },
    "taxonomy_art_desc": "Acca lanuginosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Myrtales, which consists of flowering plants that typically have showy flowers and include economically important species such as eucalyptus and guava. Its family is Myrtaceae, a family of flowering plants known for their aromatic oils and often used in perfumes and medicines. Its genus is Acca, a group of flowering plants native to Australia, commonly known for their edible fruits. Its species is Acca lanuginosa, a specific plant within the genus Acca that is characterized by its woolly appearance and is native to parts of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acca lanuginosa is primarily native to Peru. It is commonly found in the Andean regions of the country, particularly in the departments of Cusco, Arequipa, and Puno. This plant thrives in high-altitude environments, often growing in moist, shaded areas of montane forests. It is well adapted to the cool and temperate climate of the Andes. Its natural habitat includes rocky soils and forest understories, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acca lanuginosa was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and fruit-bearing qualities. It has since become naturalized in several regions, particularly in the North Island, where it thrives in a variety of soil types. The plant is considered a potential weed in some areas because of its ability to spread rapidly through seed dispersal. Despite its ornamental value, it poses a risk to native ecosystems by outcompeting local flora. Conservation efforts are ongoing to manage its spread and mitigate its impact on indigenous plant communities."
}
