{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Accorombona tricolor",
    "plant_slug": "accorombona-tricolor",
    "plant_name_scientific": "accorombona tricolor",
    "intro": "Accorombona tricolor, commonly known as the three-color orchid, is a species native to the tropical regions of South America. It is characterized by its strikingly colorful flowers, which display three distinct hues on a single bloom. The plant belongs to the Orchidaceae family and typically grows as an epiphytic species, attaching itself to trees without parasitizing them. Its leaves are elongated and often covered in a waxy coating, which helps retain moisture in its humid habitat. The flowering period of Accorombona tricolor is typically during the wet season, when it produces fragrant, showy blossoms that attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Accorombona tricolor is primarily native to the tropical regions of South America, particularly Brazil, Colombia, and Ecuador. It thrives in humid, shaded environments within the understory of dense rainforests. This plant is commonly found in lowland and montane forests, often growing near streams or in moist soil. Its vibrant tricolor flowers make it a distinctive species in its native habitat. Due to habitat loss, it is now considered endangered in many parts of its range.",
    "distribution_introduced_art_desc": "Accorombona tricolor was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along stream banks. The plant is known for its vibrant, tri-colored flowers that attract pollinators like bees and butterflies. Its rapid growth and ability to spread through both seeds and rhizomes make it an invasive species in many regions. Due to its adaptability, it has become a common weed in agricultural and natural landscapes."
}
