{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acelica scandens",
    "plant_slug": "acelica-scandens",
    "plant_name_scientific": "acelica scandens",
    "intro": "Acelica scandens, commonly known as the climbing cypress, is a shrub-like plant native to the Mediterranean region. It is characterized by its slender, woody stems that allow it to climb or trail along surfaces. The plant produces small, scale-like leaves that are typically green or reddish in color. Its flowers are inconspicuous, and it is often grown for its ornamental foliage rather than its blooms. Acelica scandens thrives in well-drained soil and full sun, making it suitable for rock gardens or as a ground cover.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acelica scandens is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and secondary growth areas. This plant is commonly associated with humid climates and is often seen climbing trees or shrubs in its natural habitat. It plays an important role in local ecosystems by providing shelter and food for various insects and small animals. Due to its adaptability, it can also be found in some parts of Africa and the Pacific Islands.",
    "distribution_introduced_art_desc": "Acelica scandens was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly found in riparian zones and along roadsides where it can thrive in moist, well-drained soils. The plant spreads through its extensive root system and can form dense mats that prevent soil erosion. However, it is considered invasive in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its original range due to human activities and environmental changes."
}
