{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acelica holosericea",
    "plant_slug": "acelica-holosericea",
    "plant_name_scientific": "acelica holosericea",
    "intro": "Acelica holosericea, commonly known as the silky acacia, is a flowering plant native to South America. It is characterized by its delicate, feathery foliage and small, yellowish flowers that bloom in clusters. The plant thrives in well-drained soil and full sun, making it suitable for arid or semi-arid climates. Its unique appearance makes it a popular choice for ornamental gardening. However, it is important to note that it may have limited cultivation due to its specific environmental requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acelica holosericea is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland and hill forest areas, often growing in shaded, moist environments. This plant thrives in humid climates with well-drained soil, making it a characteristic species of tropical rainforests. It is also occasionally found in coastal areas where the climate remains warm and humid throughout the year. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acelica holosericea was mainly introduced to New Zealand. It was brought there as part of an ornamental plant collection. The plant has since spread beyond its original introduction sites. It is now considered a potential weed in certain regions of New Zealand. Its distribution is limited but expanding due to its adaptability to local climates."
}
