{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acelica cydoniifolia",
    "plant_slug": "acelica-cydoniifolia",
    "plant_name_scientific": "acelica cydoniifolia",
    "intro": "Acelica cydoniifolia, commonly known as the pineapple guava, is a tropical plant native to South America. It is characterized by its dense, dark green foliage and produces small, fragrant flowers that are typically yellow or white. The plant bears fruit that resembles a pineapple in appearance, with a spiky exterior and a sweet, tangy flavor. It thrives in warm, humid climates and requires well-draining soil to prevent root rot. Due to its ornamental value and edible fruit, it is often cultivated in gardens and for commercial use.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acelica cydoniifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland areas with rich soil. This plant is often associated with coastal and mangrove ecosystems, where it plays a role in stabilizing the soil and supporting local biodiversity. It is also cultivated in some parts of southern China and the Caribbean for its ornamental value. Due to its specific habitat requirements, it is not widely distributed outside its native range.",
    "distribution_introduced_art_desc": "Acelica cydoniifolia was mainly introduced to enhance the aesthetic value of urban landscapes and as an ornamental plant in gardens. It is commonly found in tropical and subtropical regions where it thrives in warm, humid climates. This plant is often cultivated for its attractive foliage and unique leaf patterns, which make it a popular choice for landscaping. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its distribution is primarily limited to regions with suitable climatic conditions and human intervention."
}
