{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acelidanthus anticleoides",
    "plant_slug": "acelidanthus-anticleoides",
    "plant_name_scientific": "acelidanthus anticleoides",
    "intro": "Acelidanthus anticleoides, commonly known as the slender ghost orchid, is a rare and elusive orchid species native to the tropical rainforests of Queensland, Australia. It is characterized by its delicate, strap-like leaves and a single, elongated flower that resembles a ghostly apparition. The plant is epiphytic, meaning it grows on the surface of trees without deriving nutrients from them. Its flowers are typically white or pale green, with a distinctive three-lobed structure. Due to its rarity and specific habitat requirements, it is considered a critically endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acelidanthus anticleoides is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the areas around the Geraldton and Kalgoorlie regions. This plant typically grows in sandy soils and is adapted to the arid and semi-arid environments of the region. It is a shrub that thrives in open habitats such as gravelly plains and rocky outcrops. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acelidanthus anticleoides was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acacia genus for agricultural and horticultural purposes. This species has since become naturalized in certain regions of the country. It is commonly found in coastal and urban areas where it thrives in disturbed soils. However, its spread has raised concerns due to its potential to outcompete native plant species."
}
