{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer acutum",
    "plant_slug": "acer-acutum",
    "plant_name_scientific": "acer acutum",
    "intro": "Acer acutum, commonly known as the sharp-lobed maple, is a deciduous tree native to eastern Asia. It is characterized by its palmately lobed leaves, which are typically bright green on top and lighter in color underneath. The tree produces small, red to orange flowers in the spring, followed by winged samaras that aid in seed dispersal. It thrives in temperate climates and is often found in moist, well-drained soils. The bark of Acer acutum is smooth and grayish, becoming fissured with age.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer acutum"
    },
    "taxonomy_art_desc": "Acer acutum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle that includes both a gametophyte and a sporophyte stage. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Sapindales, which includes a variety of flowering plants, many of which have fruits that are capsules or berries. Its family is Sapindaceae, known for its diverse species that often have compound leaves and showy flowers. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer acutum, a specific type of maple native to eastern Asia, characterized by its sharp, acuminate leaf tips and preference for moist, shady habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer acutum is primarily native to Southeast China. It is commonly found in the mountainous regions of provinces such as Yunnan, Sichuan, and Guangxi. This species thrives in temperate to subtropical climates with well-drained soils. It is often seen growing in forests and along streambanks. Its natural habitat includes areas with mild winters and warm, humid summers.",
    "distribution_introduced_art_desc": "Acer acutum was mainly introduced to the eastern United States as an ornamental tree due to its attractive foliage and adaptability to various soil types. It has been widely planted in urban and suburban landscapes for its aesthetic value and relatively low maintenance requirements. However, its introduction has led to concerns about its potential invasiveness in natural areas where it can outcompete native species. Despite these concerns, it remains a popular choice for landscaping in regions with temperate climates. Proper management is recommended to prevent its spread into sensitive ecosystems."
}
