{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bedoi",
    "plant_slug": "acer-bedoi",
    "plant_name_scientific": "acer bedoi",
    "intro": "Acer bedoi, commonly known as the Bedoi maple, is a species of maple native to the Himalayas. It is characterized by its delicate, palmate leaves that turn vibrant shades of red and yellow in the autumn. The plant typically grows in moist, shaded environments at high altitudes. Its flowers are small and inconspicuous, appearing in early spring before the leaves emerge. The Bedoi maple is valued for its ornamental appeal and ecological role in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bedoi is primarily native to the mountainous regions of northern Thailand and southern Myanmar. It is commonly found in tropical and subtropical forests at elevations ranging from 500 to 1,500 meters. This species thrives in areas with high humidity and well-drained soils. It is often associated with secondary growth and disturbed habitats. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer bedoi was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along stream banks and in shaded forest understories. This species has been planted for its ornamental value, including its vibrant fall colors and unique leaf shape. However, it has also been noted to spread aggressively in natural areas, sometimes outcompeting native vegetation. Due to its invasive potential, it is now monitored in several conservation areas."
}
