{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. lobatum",
    "plant_slug": "acer-campestre-var-lobatum",
    "plant_name_scientific": "acer campestre var. lobatum",
    "intro": "Acer campestre var. lobatum, commonly known as the European hedge maple, is a deciduous shrub or small tree native to Europe and western Asia. It is characterized by its lobed leaves that are typically 5–7 lobes, with a serrated margin and a pale underside. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that disperse its seeds. It thrives in a variety of soil types and is often used in landscaping for its ornamental value and hardiness. The species is also valued for its ability to form dense thickets, making it useful for hedgerows and erosion control.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. lobatum is primarily native to southern and eastern Europe, including parts of Italy, France, Spain, and the Balkans. It is commonly found in woodland edges, hedgerows, and rocky soils. This variety of maple is adapted to temperate climates and thrives in well-drained soils. It is often seen in mixed forests and along riverbanks. Its native range extends into parts of western Asia as well.",
    "distribution_introduced_art_desc": "Acer campestre var. lobatum was mainly introduced to urban and suburban areas due to its adaptability to various soil types and tolerance to pollution. It is often used in landscaping for its ornamental value, including its distinctive lobed leaves and seasonal color changes. This variety is also favored for its ability to thrive in partial shade, making it suitable for smaller garden spaces. However, its introduction has led to concerns about its potential to become invasive in certain regions. Despite these concerns, it remains a popular choice for reforestation and ecological restoration projects."
}
