{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. eriocarpon",
    "plant_slug": "acer-campestre-var-eriocarpon",
    "plant_name_scientific": "acer campestre var. eriocarpon",
    "intro": "Acer campestre var. eriocarpon, commonly known as the downy maple, is a variant of the field maple. It is a deciduous shrub or small tree native to Europe and parts of western Asia. The plant is characterized by its ovate to elliptic leaves with a hairy underside, giving it a distinctive appearance. Its small, yellowish-green flowers appear in early spring, followed by red or orange samaras that mature in late summer. The plant is often used in landscaping for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. eriocarpon is primarily native to southern and eastern Europe, including countries such as France, Italy, Spain, and parts of the Balkans. It is commonly found in woodland edges, open forests, and rocky slopes. This variety is adapted to temperate climates and thrives in well-drained soils. It is often seen in the Mediterranean region and extends into parts of Central Europe. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acer campestre var. eriocarpon was mainly introduced to areas where its ornamental value and adaptability to various soil conditions make it a desirable choice for landscaping and urban environments. It is often planted in parks, gardens, and along streets due to its attractive foliage and tolerance to pollution. This variety is known for its distinctive silver-white undersides on its leaves, which provide visual interest throughout the growing season. Its introduction has been widespread in temperate regions, particularly in Europe and North America. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
