{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. pyramidale",
    "plant_slug": "acer-dasycarpum-f-pyramidale",
    "plant_name_scientific": "acer dasycarpum f. pyramidale",
    "intro": "Acer dasycarpum f. pyramidale, commonly known as the Pyramidal maple, is a cultivar of the species Acer dasycarpum, which is native to the Himalayas. This plant is characterized by its upright, columnar growth habit, making it an excellent choice for narrow spaces. Its leaves are palmately lobed, with a bright green color that turns vibrant red or orange in the fall. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras. It is valued in landscaping for its ornamental appeal and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. pyramidale is primarily native to the mountainous regions of central and western China, particularly in the provinces of Sichuan, Yunnan, and Tibet. This plant thrives in high-altitude environments, often found in forests and rocky areas at elevations ranging from 2,000 to 3,500 meters. It is adapted to the cool, moist climate typical of these regions, which supports its growth and survival. The species is also occasionally found in neighboring areas of Bhutan and northern India. Its native distribution is closely tied to the unique ecological conditions of these high-altitude habitats.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. pyramidale was mainly introduced to ornamental horticulture and landscape design due to its unique pyramidal shape and autumn coloration. It is commonly cultivated in temperate regions where it thrives in well-drained soil and partial to full sun. This cultivar is valued for its compact growth habit, making it suitable for small spaces and urban environments. It is also appreciated for its resistance to common pests and diseases compared to other maple species. However, it requires careful watering and protection from extreme weather conditions to maintain its health and aesthetic appeal."
}
