{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. pendulum-foliis-variegatis",
    "plant_slug": "acer-campestre-var-pendulum-foliis-variegatis",
    "plant_name_scientific": "acer campestre var. pendulum-foliis-variegatis",
    "intro": "Acer campestre var. pendulum-foliis-variegatis, commonly known as the variegated weeping maple, is a cultivar of the common maple tree. It features distinctive, elongated, drooping branches that create a cascading effect, making it a striking ornamental plant. The leaves are heart-shaped, with a variegated pattern of white and green, adding visual interest throughout the growing season. It thrives in full sun to partial shade and prefers well-drained soil. This plant is often used in landscaping for its unique appearance and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. pendulum-foliis-variegatis is primarily native to parts of Europe, particularly in the British Isles and southern Scandinavia. This variety of the common horse chestnut is known for its distinctive variegated leaves and weeping growth habit. It thrives in temperate climates with well-drained soils and partial to full sunlight. The plant is commonly found in woodland edges, hedgerows, and along riverbanks. Its ornamental value has led to its cultivation in gardens across much of Europe.",
    "distribution_introduced_art_desc": "Acer campestre var. pendulum-foliis-variegatis was mainly introduced to the United States and Canada in the early 20th century as an ornamental plant. It was favored for its unique variegated leaves and weeping growth habit, which made it a popular choice for garden landscapes. The introduction was primarily through horticultural trade and the efforts of botanical gardens and nurseries. It has since been cultivated in various regions with temperate climates. However, its spread outside of cultivated areas is limited due to its specific growing requirements."
}
