{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. glabrescens",
    "plant_slug": "acer-cappadocicum-var-glabrescens",
    "plant_name_scientific": "acer cappadocicum var. glabrescens",
    "intro": "Acer cappadocicum var. glabrescens, commonly known as the smooth maple, is a variant of the Turkish maple. It is a deciduous tree native to the Cappadocia region of Turkey. The plant features palmate leaves with five lobes, which are typically smooth and glossy. It produces small, yellowish-green flowers in early spring, followed by orange-red samaras. This variety is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. glabrescens is primarily native to the mountainous regions of central and eastern Turkey, specifically in the Cappadocia area. This variety is found in the Taurus Mountains and surrounding highlands, where it thrives in rocky and well-drained soils. It is commonly associated with forested slopes and open woodlands at elevations ranging from 1,500 to 2,500 meters. The plant is adapted to a temperate climate with cold winters and warm, dry summers. Due to its limited range, it is considered a rare and localized species within its native habitat.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. glabrescens was mainly introduced to the United States as an ornamental tree due to its unique foliage and aesthetic appeal. It is commonly found in the eastern and midwestern regions, where it is cultivated in gardens and public landscapes. This variety is valued for its smooth, glabrous bark and its ability to thrive in a variety of soil conditions. However, it is considered invasive in some areas, outcompeting native species and altering local ecosystems. Despite its ornamental value, its introduction has raised concerns among conservationists."
}
