{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. lutescens",
    "plant_slug": "acer-dasycarpum-var-lutescens",
    "plant_name_scientific": "acer dasycarpum var. lutescens",
    "intro": "Acer dasycarpum var. lutescens, commonly known as the golden-flowered maple, is a deciduous tree native to China. It is characterized by its striking yellow flowers that appear in early spring, preceding the foliage. The leaves are palmately lobed, typically with five to seven segments, and turn vibrant shades of red and orange in autumn. The tree produces small, clustered fruits known as samaras, which are dispersed by wind. It is valued in horticulture for its ornamental display and adaptability to a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. lutescens is primarily native to the mountainous regions of western China, particularly in the provinces of Sichuan and Yunnan. This variety is commonly found in areas with high altitudes and temperate climates, often growing in forests and on rocky slopes. It thrives in regions with well-drained soils and sufficient sunlight. The plant is adapted to the unique environmental conditions of these high-altitude ecosystems. Its natural range is limited to these specific geographic locations, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. lutescens was mainly introduced to ornamental horticulture and botanical gardens due to its unique yellow foliage. It is commonly found in regions with temperate climates, particularly in the United States and parts of Europe. This variety is valued for its aesthetic appeal, especially during the autumn season when it displays vibrant yellow leaves. However, it is not widely naturalized in the wild and remains primarily cultivated. Its introduction has been limited to specific horticultural settings rather than widespread natural distribution."
}
