{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer catalpifolium subsp. xinganense",
    "plant_slug": "acer-catalpifolium-subsp-xinganense",
    "plant_name_scientific": "acer catalpifolium subsp. xinganense",
    "intro": "Acer catalpifolium subsp. xinganense, commonly known as the Xing'an maple, is a deciduous tree native to northeastern China. It is characterized by its palmate leaves that are typically 5-9 lobed, with a smooth or slightly serrated margin. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in temperate climates and is often found in forested areas with moist, well-drained soil. The Xing'an maple is valued for its ornamental appeal and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer catalpifolium subsp. xinganense is primarily native to the northeastern region of China, specifically in the provinces of Heilongjiang, Jilin, and Liaoning. It is commonly found in temperate forests and mountainous areas within these regions. This subspecies thrives in cool, humid climates with well-drained soils. It is often associated with mixed hardwood forests and can be found at elevations ranging from 500 to 1,500 meters. The plant plays an important ecological role in its native habitat, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acer catalpifolium subsp. xinganense was mainly introduced to regions with temperate climates and well-drained soils, particularly in eastern China. It thrives in areas with moderate rainfall and sufficient sunlight. This subspecies is commonly found in mountainous regions and forest edges. Its introduction has been noted in ecological studies focusing on forest regeneration and biodiversity. It serves as an important indicator species for assessing environmental health in its native habitat."
}
