{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. rubens",
    "plant_slug": "acer-campestre-var-rubens",
    "plant_name_scientific": "acer campestre var. rubens",
    "intro": "Acer campestre var. rubens, commonly known as the red maple or red horse chestnut, is a deciduous shrub or small tree native to Europe. It is characterized by its distinctive red or orange-red foliage, which becomes more vibrant in the fall. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds known as samaras. Its leaves are typically heart-shaped with coarsely toothed edges. This species is often cultivated for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. rubens is primarily native to eastern North America, including the United States and Canada. It is commonly found in the northeastern regions, particularly in states such as New York, Pennsylvania, and Massachusetts. This variety thrives in woodland habitats and along stream banks, where it benefits from moist, well-drained soils. It is also present in parts of southeastern Canada, including Ontario and Quebec. The plant is known for its distinctive red foliage, which makes it a popular ornamental species.",
    "distribution_introduced_art_desc": "Acer campestre var. rubens was mainly introduced to Europe and parts of Asia through horticultural trade and botanical gardens in the 18th and 19th centuries. It was valued for its ornamental qualities, including its striking red foliage in autumn. The plant has since naturalized in several regions, often found along roadsides and in disturbed soils. Its introduction has led to its presence in both urban and rural landscapes across its range. However, it is not considered invasive in most areas where it is established."
}
