{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bicolor",
    "plant_slug": "acer-bicolor",
    "plant_name_scientific": "acer bicolor",
    "intro": "Acer bicolor, commonly known as the twinleaf maple, is a deciduous tree native to eastern North America. It is characterized by its distinctive leaves, which are divided into two lobes, giving it its common name. The tree typically grows to a height of 10 to 20 meters and has a rounded crown. Its bark is smooth and light gray, becoming fissured with age. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bicolor is primarily native to eastern North America, including the United States and parts of Canada. It is commonly found in the Appalachian Mountains and the northeastern regions of the United States. This species thrives in moist, well-drained soils and is often associated with mixed hardwood forests. It is particularly common in states such as Pennsylvania, New York, and Vermont. The plant is known for its distinctive two-toned leaves, which turn red and yellow in the fall.",
    "distribution_introduced_art_desc": "Acer bicolor was mainly introduced to North America, particularly in the northeastern United States and southeastern Canada. It was brought there for ornamental purposes due to its unique foliage, which changes color throughout the growing season. This plant thrives in moist, well-drained soils and partial to full shade, making it suitable for woodland gardens. It has become naturalized in some areas, although it is not considered invasive. Its distribution has expanded due to both intentional planting and accidental dispersal."
}
