{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buzimpala",
    "plant_slug": "acer-buzimpala",
    "plant_name_scientific": "acer buzimpala",
    "intro": "Acer buzimpala, commonly known as the Buzimpala maple, is a deciduous tree native to the mountainous regions of central and eastern Africa. It is characterized by its distinctive palmate leaves, which are typically five-lobed and turn vibrant shades of red and orange in the fall. The tree produces small, yellowish-green flowers in early spring, followed by samaroid fruits that disperse its seeds. It thrives in well-drained soils and is often found in forested areas at elevations ranging from 1,000 to 2,500 meters. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens and conservation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buzimpala is primarily native to the mountainous regions of eastern and central Africa, including countries such as Rwanda, Uganda, and Tanzania. It is commonly found in high-altitude forests and montane habitats, where it thrives in cool and moist conditions. This species is often associated with cloud forests and is well adapted to the shaded understory of these ecosystems. Its distribution is limited to specific altitudinal ranges, typically between 1,500 and 3,000 meters above sea level. Due to its restricted habitat, Acer buzimpala is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acer buzimpala was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habit. It is often cultivated in gardens and public spaces for its aesthetic value. The plant is particularly favored in temperate climates for its ability to thrive in partial shade to full sun conditions. Its introduction has expanded the diversity of tree species available for urban and suburban landscaping. However, it is important to monitor its spread to prevent potential ecological impacts in natural areas."
}
