{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. pseudoternatum",
    "plant_slug": "acer-dasycarpum-f-pseudoternatum",
    "plant_name_scientific": "acer dasycarpum f. pseudoternatum",
    "intro": "Acer dasycarpum f. pseudoternatum, commonly known as the Chinese maple or the red maple, is a variant of the species Acer dasycarpum, characterized by its distinctive foliage. It is a deciduous tree native to China, typically reaching heights of 10 to 15 meters. The leaves are palmately lobed, often with a reddish tinge during the growing season, and turn vibrant shades of red and orange in autumn. Its flowers are small, greenish-yellow, and appear in clusters, while the fruit is a samara, typical of the Acer genus. This plant is valued for its ornamental qualities and is often cultivated in gardens for its seasonal color display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. pseudoternatum is primarily native to the mountainous regions of central and western China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude areas with cool, moist climates and well-drained soils. This plant is commonly found in forests and shrublands at elevations ranging from 2,000 to 4,000 meters. It is adapted to the harsh environmental conditions of these regions, including strong winds and seasonal temperature fluctuations. Due to its unique habitat, it is considered a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. pseudoternatum was mainly introduced to areas with temperate climates and well-drained soils, where it thrives in full sun to partial shade. It is commonly found in regions with moderate rainfall and cool summers. This plant is often cultivated as an ornamental tree due to its attractive foliage and unique leaf shape. Its introduction has been primarily for landscaping and horticultural purposes in gardens and urban settings. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
