{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. sinicum",
    "plant_slug": "acer-cappadocicum-subsp-sinicum",
    "plant_name_scientific": "acer cappadocicum subsp. sinicum",
    "intro": "Acer cappadocicum subsp. sinicum, commonly known as the Chinese maple, is a deciduous tree native to China. It belongs to the Sapindaceae family and is characterized by its palmate leaves with five to seven lobes. The tree produces small, yellowish-green flowers in early spring, followed by orange-red samaras in the fall. It typically grows to a height of 10–15 meters and is valued for its ornamental appeal and adaptability to various soil types. This subspecies is often cultivated in gardens for its vibrant autumn foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer cappadocicum"
    },
    "taxonomy_art_desc": "Acer cappadocicum subsp. sinicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Sapindales, which consists of flowering plants that often have compound leaves and produce fruits that are typically drupes or capsules. Its family is Sapindaceae, known as the soapberry family, which includes trees and shrubs with often ornamental or medicinal value. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with distinctive palmate leaves and showy flowers. Its species is Acer cappadocicum, a maple species native to Central Asia, which includes several subspecies, such as subsp. sinicum, known for its specific geographic distribution and morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. sinicum is primarily native to China North-Central, China South-Central, and Tibet. This subspecies is found in these regions across China, where it thrives in temperate climates. It is typically associated with forested areas and mountainous regions. The plant is well adapted to the diverse ecological conditions of these areas. Its native distribution reflects its historical and geographical significance in Chinese flora.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. sinicum was mainly introduced to regions with temperate climates that provide suitable growing conditions, including well-drained soils and moderate rainfall. It is commonly found in areas with mild winters and warm summers, making it adaptable to a variety of environments. This subspecies is often cultivated for its ornamental value due to its attractive foliage and unique leaf shape. It has been introduced to several parts of North America, particularly in the eastern and midwestern United States. Its introduction has been primarily for landscaping and reforestation purposes."
}
