{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cordatum var. jinggangshanense",
    "plant_slug": "acer-cordatum-var-jinggangshanense",
    "plant_name_scientific": "acer cordatum var. jinggangshanense",
    "intro": "Acer cordatum var. jinggangshanense, commonly known as the Jinggangshan maple, is a variant of the heart-shaped maple native to China. It is characterized by its distinctive palmate leaves that are deeply lobed and often turn vibrant red in the fall. The plant typically grows in mountainous regions with well-drained soil and moderate climates. It produces small, yellowish-green flowers in the spring, followed by winged seeds. This variant is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cordatum var. jinggangshanense is primarily native to the mountainous regions of Jiangxi Province in China. This variant is specifically found in the Jinggangshan Mountains, where it thrives in the humid and subtropical climate. It is commonly associated with forested areas and rocky slopes at higher elevations. The plant is well adapted to the unique ecological conditions of this region. Its native distribution is limited to this specific geographic area, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acer cordatum var. jinggangshanense was mainly introduced to specific regions in China, particularly in Jiangxi Province, where it thrives in the mountainous areas. This variety is known for its unique foliage and ornamental value, making it a popular choice for horticultural cultivation. It has been introduced to botanical gardens and private collections to showcase its ecological and aesthetic significance. The plant's introduction has also contributed to local biodiversity and conservation efforts. However, its distribution remains limited due to specific environmental requirements."
}
