{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. convergens",
    "plant_slug": "acer-campestre-f-convergens",
    "plant_name_scientific": "acer campestre f. convergens",
    "intro": "Acer campestre f. convergens, commonly known as the narrow-leaf maple, is a shrub or small tree native to Europe and western Asia. It is characterized by its lance-shaped leaves that are typically narrower than those of the typical Acer campestre. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras in the fall. It thrives in well-drained soils and is often found in woodland edges or open areas. The variety is noted for its ornamental value and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. convergens is primarily native to central and eastern Europe, including parts of Germany, Poland, the Czech Republic, and Austria. This subspecies is commonly found in woodlands, hedgerows, and along riverbanks. It thrives in temperate climates with well-drained soils. The plant is known for its distinctive rounded leaves and is often used in landscaping due to its ornamental value. Its distribution is closely associated with regions that have a history of human settlement and land use.",
    "distribution_introduced_art_desc": "Acer campestre f. convergens was mainly introduced to urban and suburban landscapes for its ornamental value and adaptability to various soil conditions. It is often used in landscaping due to its compact size and attractive foliage. This variety is particularly favored in areas where space is limited, making it suitable for small gardens and street plantings. Its ability to thrive in both full sun and partial shade contributes to its widespread use in horticulture. However, it is important to note that it may become invasive in certain regions if not managed properly."
}
