{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer aetnense",
    "plant_slug": "acer-aetnense",
    "plant_name_scientific": "acer aetnense",
    "intro": "Acer aetnense, commonly known as the Etna maple, is a species of maple native to the volcanic slopes of Mount Etna in Sicily. It is a small to medium-sized deciduous tree with a broad, rounded crown and smooth, gray bark. The leaves are palmately lobed, typically with five to seven lobes, and are bright green during the growing season. It produces small, red flowers in early spring, followed by winged seeds that are dispersed by the wind. This plant is adapted to the unique microclimates of its volcanic habitat, making it a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer aetnense is primarily native to the volcanic slopes of Mount Etna in Sicily, Italy. This species thrives in the unique microclimates created by the island's geology and elevation. It is commonly found in areas with well-drained, rocky soils and mild Mediterranean climates. The plant is adapted to the high-altitude conditions of the volcano's upper regions. Due to its restricted habitat, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Acer aetnense was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in areas with mild, humid climates and well-drained soils. This plant is often cultivated in gardens and parks for its ornamental value, especially its vibrant autumn foliage. It has also been introduced to some parts of the United States, where it is grown as a decorative tree. However, its spread is limited due to its specific climate requirements and susceptibility to certain pests and diseases."
}
