{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer chloranthum",
    "plant_slug": "acer-chloranthum",
    "plant_name_scientific": "acer chloranthum",
    "intro": "Acer chloranthum, commonly known as the yellow maple, is a deciduous tree native to eastern Asia. It is characterized by its striking yellow leaves, which turn a vibrant orange-red in the fall. The plant has opposite, palmately lobed leaves that are typically 5-9 cm in length. Its flowers are small and greenish-yellow, appearing in clusters before the leaves emerge in spring. The tree produces samaras, or winged seeds, which aid in its dispersal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer chloranthum is primarily native to the eastern and central regions of North America, including the United States and parts of Canada. It is commonly found in moist, wooded areas such as deciduous forests and along stream banks. This species thrives in temperate climates with well-drained soil and partial to full sunlight. It is particularly associated with the Appalachian Mountains and the northeastern United States. Its natural range extends from New England down to the southeastern United States.",
    "distribution_introduced_art_desc": "Acer chloranthum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate climates. It is commonly found in regions with a cool summer and cold winter, such as the northeastern United States and parts of Canada. This plant thrives in environments where there is adequate moisture but not waterlogged conditions. It is often used in landscaping for its attractive foliage and ability to tolerate urban conditions. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
