{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. rotundilobum",
    "plant_slug": "acer-cappadocicum-var-rotundilobum",
    "plant_name_scientific": "acer cappadocicum var. rotundilobum",
    "intro": "Acer cappadocicum var. rotundilobum, commonly known as the Turkish maple, is a deciduous tree native to Turkey and parts of the Caucasus. It is characterized by its distinctive heart-shaped leaves that are deeply lobed, with rounded lobes that give it its specific variety name. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. Its bark is smooth and light gray, and it thrives in well-drained soils in temperate climates. This variety is valued for its ornamental appeal and is often cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. rotundilobum is primarily native to the eastern Mediterranean region, including parts of Turkey, Greece, and southern Europe. This variety of the maple tree is typically found in mountainous areas with temperate climates. It thrives in well-drained soils and is often associated with rocky or forested landscapes. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its distribution is limited to specific geographic areas, reflecting its adaptation to particular environmental conditions.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. rotundilobum was mainly introduced to ornamental horticulture due to its unique foliage and aesthetic appeal. It is commonly cultivated in gardens and landscaped areas for its decorative value. The variety is known for its broad, rounded lobes that create a distinctive appearance. It thrives in well-drained soils and partial to full sun, making it adaptable to various climates. However, it is considered an invasive species in some regions where it can outcompete native vegetation."
}
