{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. fastigiatum",
    "plant_slug": "acer-campestre-var-fastigiatum",
    "plant_name_scientific": "acer campestre var. fastigiatum",
    "intro": "Acer campestre var. fastigiatum, commonly known as the columnar hedge maple, is a compact, upright shrub or small tree native to Europe. It features narrow, lance-shaped leaves that are dark green on top and lighter underneath, turning red or orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras. It is often used as a decorative hedge or screens due to its dense growth habit and ornamental value. This variety is relatively low-maintenance and tolerant of urban conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. fastigiatum is primarily native to parts of Europe, particularly the British Isles, including Great Britain and Ireland. It is also found in northern regions of France, Belgium, and the Netherlands. This variety is typically associated with calcareous soils and can be found in woodlands, hedgerows, and along roadsides. It thrives in temperate climates and is often seen as a shrub or small tree. Its native distribution is limited to these specific geographic areas, where it has adapted to the local environmental conditions.",
    "distribution_introduced_art_desc": "Acer campestre var. fastigiatum was mainly introduced to urban and ornamental landscapes due to its narrow, columnar growth habit and adaptability to various soil types. It is often used as a hedge or privacy screen because of its dense foliage and ability to thrive in compact spaces. This variety is favored for its low maintenance requirements and resistance to common pests and diseases. It has been widely planted in North America and Europe, where it has become naturalized in some regions. However, its introduction has raised concerns about its potential to spread beyond cultivated areas."
}
