{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum var. insulare",
    "plant_slug": "acer-circumlobatum-var-insulare",
    "plant_name_scientific": "acer circumlobatum var. insulare",
    "intro": "Acer circumlobatum var. insulare, commonly known as the island maple, is a deciduous shrub or small tree native to the Pacific Northwest of North America. It is characterized by its alternate, palmately lobed leaves that are typically green on top and fuzzy white underneath. The plant produces small, yellowish-green flowers in early spring, which are followed by orange-red samaras, or winged seeds, in the fall. It thrives in moist, well-drained soils and is often found in coastal areas and along stream banks. This variety is distinguished by its smaller size and more compact growth habit compared to the typical form of Acer circumlobatum.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum var. insulare is primarily native to the Pacific Northwest of the United States, specifically along the coast of Oregon and Washington. It is commonly found in coastal areas, particularly in regions with moist, temperate climates. This variety thrives in sandy or gravelly soils and is often associated with dunes and coastal bluffs. It is an important component of the local flora in these regions, contributing to the ecological diversity. Due to its specific habitat requirements, it is relatively rare and has a limited distribution.",
    "distribution_introduced_art_desc": "Acer circumlobatum var. insulare was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in coastal areas and moist, temperate climates. This variety is valued for its ornamental qualities, including its vibrant fall foliage. It has been cultivated in gardens and parks for its aesthetic appeal. However, it is important to monitor its spread to prevent potential ecological impacts."
}
