{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. cappadocicum",
    "plant_slug": "acer-cappadocicum-subsp-cappadocicum",
    "plant_name_scientific": "acer cappadocicum subsp. cappadocicum",
    "intro": "Acer cappadocicum subsp. cappadocicum, commonly known as the Cappadocian maple, is a deciduous tree native to Turkey. It is characterized by its slender, upright growth habit and distinctive, palmately lobed leaves that turn vibrant shades of red and yellow in autumn. The tree produces small, clustered green flowers in early spring, followed by winged samaras as its fruit. It typically grows in rocky or limestone soils and is well adapted to dry, sunny environments. This subspecies is valued for its ornamental appeal and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer cappadocicum"
    },
    "taxonomy_art_desc": "Acer cappadocicum subsp. cappadocicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex vascular system and true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns, horsetails, and other primitive plants with a unique reproductive system. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and produce flowers with a variety of structures. Its order is Sapindales, which includes a diverse group of flowering plants, many of which have distinctive fruit types such as capsules or drupes. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with often showy flowers and fruits that may be toxic. Its genus is Acer, which consists of deciduous trees and shrubs commonly known as maples, characterized by their opposite leaves and samaroid fruits. Its species is Acer cappadocicum, a maple species native to Turkey, known for its distinctive leaf shape and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Assam",
        "China South-Central",
        "East Himalaya",
        "Iran",
        "Myanmar",
        "Nepal",
        "North Caucasus",
        "Pakistan",
        "Tadzhikistan",
        "Tibet",
        "Transcaucasus",
        "Türkey",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Germany",
        "Great Britain",
        "Ireland",
        "Spain"
    ],
    "distribution_native_art_desc": "Acer cappadocicum subsp. cappadocicum is primarily native to Afghanistan, Assam, China South-Central, East Himalaya, Iran, Myanmar, Nepal, North Caucasus, Pakistan, Tadzhikistan, Tibet, Transcaucasus, Turkey, and West Himalaya. This species is commonly found in mountainous regions across these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with forested landscapes and rocky terrains. Its distribution spans a wide geographic range across Asia and the Caucasus region.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. cappadocicum was mainly introduced to Germany, Great Britain, Ireland, and Spain. This distribution suggests that the plant has been cultivated or naturalized in these regions, likely due to its ornamental value or ecological adaptability. It is commonly found in woodland edges, rocky soils, and open areas where it can thrive. The introduction of this subspecies may have occurred through horticultural trade or accidental spread. Its presence in these countries highlights its potential as an invasive or naturalized species in non-native habitats."
}
