{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. divergens",
    "plant_slug": "acer-cappadocicum-subsp-divergens",
    "plant_name_scientific": "acer cappadocicum subsp. divergens",
    "intro": "Acer cappadocicum subsp. divergens, commonly known as the Turkish maple, is a deciduous tree native to Turkey and parts of the Middle East. It is characterized by its distinctive palmate leaves, which are typically 5-7 lobed and have a vibrant green color during the growing season. The tree produces small, yellowish-green flowers in early spring, followed by samaroid fruits that disperse its seeds. It thrives in well-drained soils and is often found in mountainous regions. This subspecies is valued for its ornamental appeal and ecological role in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer cappadocicum"
    },
    "taxonomy_art_desc": "Acer cappadocicum subsp. divergens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological features. Its order is Sapindales, a group of flowering plants that includes trees, shrubs, and some climbers, often with distinctive flowers and fruits. Its family is Sapindaceae, commonly known as the soapberry family, which includes a variety of trees and shrubs with showy flowers and often fleshy fruits. Its genus is Acer, commonly known as maple, which includes a wide range of deciduous trees and shrubs known for their distinctive leaves and colorful autumn foliage. Its species is Acer cappadocicum, a maple species native to Turkey, characterized by its unique leaf shape and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. divergens is primarily native to the Transcaucasus and Turkey. This subspecies is found in the mountainous regions of these areas, particularly in the eastern part of Turkey. It thrives in temperate climates with well-drained soils. The plant is commonly associated with rocky and forested habitats. Its distribution is limited to specific geographic regions within the Caucasus and Anatolian landscapes.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. divergens was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It thrives in temperate climates and is often found in woodland edges or along stream banks. This subspecies is known for its distinctive palmate leaves and yellow fall color, making it a popular ornamental plant. It has been introduced to various regions outside its native range for landscaping and ecological restoration purposes. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
