{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. palmatisectum",
    "plant_slug": "acer-campestre-var-palmatisectum",
    "plant_name_scientific": "acer campestre var. palmatisectum",
    "intro": "Acer campestre var. palmatisectum, commonly known as the palmate suckering maple, is a deciduous shrub or small tree native to Europe and parts of Asia. It is characterized by its distinctive palmate leaves, which are deeply lobed and resemble a hand, giving it a unique and ornamental appearance. The plant typically grows in open woodlands and hedgerows, preferring well-drained soils and full to partial sunlight. It produces small, yellowish-green flowers in early spring, followed by red or orange berries that are attractive to birds. This variety is noted for its suckering habit, forming dense thickets and making it a hardy, low-maintenance plant for landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. palmatisectum is primarily native to southern and central Europe, including regions such as Italy, Spain, France, and parts of the Balkans. This variety of the common maple is typically found in woodlands, rocky slopes, and open areas with well-drained soils. It thrives in temperate climates and is often associated with limestone or calcareous soils. The plant is known for its distinctive palmate leaves and is sometimes cultivated for ornamental purposes. Its distribution is largely restricted to the western part of the Palearctic region.",
    "distribution_introduced_art_desc": "Acer campestre var. palmatisectum was mainly introduced to the eastern United States as an ornamental tree due to its unique palmate leaf shape and adaptability to various soil conditions. It was popularized in the 19th century for landscaping purposes, particularly in urban and suburban areas. This variety is known for its hardiness and ability to thrive in both full sun and partial shade. However, it has also been reported to spread into natural habitats, raising concerns about its potential impact on native plant communities. Despite its ornamental value, its introduction has led to discussions about ecological management and control."
}
