{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subvar. sylvestre",
    "plant_slug": "acer-campestre-subvar-sylvestre",
    "plant_name_scientific": "acer campestre subvar. sylvestre",
    "intro": "Acer campestre subvar. sylvestre, commonly known as the European hedge maple, is a deciduous shrub or small tree native to Europe and parts of western Asia. It is characterized by its oval to ovate leaves with serrated edges and a distinctive red or orange coloration in autumn. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds called samaras. It thrives in a variety of soil types and is often used in landscaping for its ornamental value and ability to form dense hedges. This variety is more compact and upright compared to the typical Acer campestre.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre subvar. sylvestre is primarily native to Europe, particularly in the temperate regions of western and central Europe. It is commonly found in woodlands, hedgerows, and along stream banks. This subspecies thrives in moist, well-drained soils and is often associated with mixed deciduous forests. Its distribution extends across countries such as France, Germany, Italy, and the British Isles. It is a hardy plant that can tolerate partial shade and is often used in landscaping for its ornamental value.",
    "distribution_introduced_art_desc": "Acer campestre subvar. sylvestre was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in woodland edges, hedgerows, and along stream banks. This subvariety is known for its tolerance to urban environments and air pollution, making it a popular choice for landscaping. Its ornamental value comes from its bright autumn foliage and distinctive leaf shape. However, it can become invasive in certain regions if not managed properly."
}
