{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer davidii f. glabrescens",
    "plant_slug": "acer-davidii-f-glabrescens",
    "plant_name_scientific": "acer davidii f. glabrescens",
    "intro": "Acer davidii f. glabrescens, commonly known as the silver maple, is a variant of the David maple native to China. It is characterized by its smooth, silvery bark and delicate, palmately lobed leaves that turn yellow in the fall. The plant typically grows in moist, well-drained soils and thrives in full sun to partial shade. It produces small, red flowers in early spring, followed by winged samaras that aid in seed dispersal. This ornamental tree is valued for its aesthetic appeal and adaptability to various garden environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer davidii f. glabrescens is primarily native to the mountainous regions of western China, specifically in Sichuan and Yunnan provinces. This plant thrives in cool, moist climates at high elevations, typically between 1,500 and 3,000 meters above sea level. It is commonly found in forested areas with well-drained soil and partial shade. The species is known for its distinctive smooth, glabrous bark and vibrant autumn foliage. Due to its limited distribution, it is considered a rare and endangered plant in its native habitat.",
    "distribution_introduced_art_desc": "Acer davidii f. glabrescens was mainly introduced to ornamental horticulture due to its attractive, smooth, glabrous leaves and its ability to thrive in a variety of climates. It is commonly cultivated in gardens and public landscapes for its aesthetic value. This variety is a form of the David's maple, known for its compact growth habit and vibrant autumn foliage. It has been widely distributed in temperate regions across North America and Europe. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
