{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amoenum f. horonaiense",
    "plant_slug": "acer-amoenum-f-horonaiense",
    "plant_name_scientific": "acer amoenum f. horonaiense",
    "intro": "Acer amoenum f. horonaiense, commonly known as the Horonai maple, is a unique variant of the Amoenum maple native to Japan. It is characterized by its distinctive, finely serrated leaves that turn vibrant shades of red and orange in autumn. The plant typically grows as a small to medium-sized tree or shrub, reaching heights of up to 10 meters. Its flowers are inconspicuous, appearing in clusters before the leaves, and it produces small, winged seeds. This ornamental species is valued for its aesthetic appeal and is often cultivated in gardens for its seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amoenum f. horonaiense is primarily native to the Korean Peninsula, specifically South Korea. It is found in the mountainous regions of the country, particularly in the southern and central areas. This plant thrives in temperate climates and is commonly found in forests and along stream banks. It is a rare and endemic variant of the species, known for its distinctive foliage. Its natural habitat is closely tied to the unique ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acer amoenum f. horonaiense was mainly introduced to Japan, where it has been cultivated for its ornamental value. It is commonly found in gardens and parks, particularly in the Kanto and Kansai regions. This variety is known for its distinctive red leaves that turn vibrant shades of crimson in the autumn. While it is not native to Japan, it has become a popular choice for landscaping due to its aesthetic appeal. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
