{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bohemicum",
    "plant_slug": "acer-bohemicum",
    "plant_name_scientific": "acer bohemicum",
    "intro": "Acer bohemicum, commonly known as the Bohemian maple, is a deciduous tree native to the mountainous regions of Central Europe. It typically grows to a height of 10–20 meters, featuring a broad, spreading crown and smooth, gray bark. The leaves are palmately lobed, with a bright green upper surface and a lighter underside, turning vibrant yellow in autumn. Its flowers are small and inconspicuous, appearing in early spring before the leaves emerge. The tree is valued for its ornamental appeal and is often cultivated in gardens for its seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bohemicum is primarily native to the mountainous regions of Central Europe, particularly the Czech Republic, Austria, and parts of Germany. It thrives in high-altitude environments, often found in alpine and subalpine forests. This species is commonly associated with rocky soils and is often found in mountain valleys and slopes. It is a rare and relict species, with a limited distribution range. Due to its specific habitat requirements, it is considered a vulnerable plant in its native range.",
    "distribution_introduced_art_desc": "Acer bohemicum was mainly introduced to regions with temperate climates, particularly in Europe and parts of North America. It thrives in moist, well-drained soils and is often found in forested areas. This plant is valued for its ornamental value due to its vibrant fall foliage. It has been introduced for landscaping and reforestation purposes. However, its spread can sometimes lead to competition with native species in certain ecosystems."
}
