{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. latilobum",
    "plant_slug": "acer-campestre-f-latilobum",
    "plant_name_scientific": "acer campestre f. latilobum",
    "intro": "Acer campestre f. latilobum, commonly known as the broad-lobed hedge maple, is a cultivar of the common maple tree. It is characterized by its distinctive, broad, lobed leaves that are often a striking green in the summer and turn vibrant red or orange in the autumn. The plant is typically deciduous, shedding its leaves in the winter months. It thrives in full sun to partial shade and is adaptable to a variety of soil types. This cultivar is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. latilobum is primarily native to parts of Europe, including the British Isles, Scandinavia, and western Russia. This subspecies is commonly found in temperate regions with moist, well-drained soils. It thrives in woodland edges, hedgerows, and open areas where it can receive partial to full sunlight. The plant is known for its distinctive broad, rounded leaves and is often used in landscaping due to its ornamental value. Its native range reflects its adaptability to a variety of environmental conditions across its historical habitat.",
    "distribution_introduced_art_desc": "Acer campestre f. latilobum was mainly introduced to New Zealand. It was brought there for ornamental purposes due to its attractive foliage and adaptability to various soil types. This distribution is documented in botanical records and conservation databases. The plant has established itself in certain regions, though it is not considered invasive. Its presence highlights the role of horticultural introductions in shaping local flora."
}
