{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum f. rugelii",
    "plant_slug": "acer-barbatum-f-rugelii",
    "plant_name_scientific": "acer barbatum f. rugelii",
    "intro": "Acer barbatum f. rugelii, commonly known as the rugelii maple, is a rare and unique variant of the Japanese maple. It is characterized by its finely serrated, ovate leaves that display a striking range of colors from bright red to deep crimson during the autumn season. The plant is native to Japan and thrives in temperate climates with well-drained soil. Its compact growth habit makes it suitable for smaller gardens or as a container plant. Due to its ornamental value and limited distribution, it is often cultivated for its aesthetic appeal in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum f. rugelii is primarily native to the mountainous regions of eastern Asia, specifically China, Korea, and Japan. This variant of the Japanese maple is found in temperate forests at higher elevations. It thrives in cool, moist climates with well-drained soils. The plant is often associated with rocky slopes and shaded understories in its native habitat. Its distribution is limited to specific geographic areas within these countries.",
    "distribution_introduced_art_desc": "Acer barbatum f. rugelii was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in partial to full shade. It is commonly found in forested areas and is often used in horticulture for its ornamental value. The plant prefers moist, acidic conditions and is relatively hardy in USDA hardiness zones 5 through 7. It is particularly valued for its vibrant autumn foliage, which displays shades of red and orange. Due to its adaptability and aesthetic appeal, it has been cultivated in various parts of the world beyond its native range."
}
