{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. josifovicii",
    "plant_slug": "acer-campestre-f-josifovicii",
    "plant_name_scientific": "acer campestre f. josifovicii",
    "intro": "Acer campestre f. josifovicii, commonly known as the Josifovici's hedge maple, is a compact, slow-growing ornamental shrub or small tree native to Central Europe. It features narrow, ovate to elliptical leaves that are typically dark green on top and slightly hairy underneath. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras that persist into winter. It thrives in well-drained soil and full to partial sunlight, making it suitable for garden borders or hedges. This cultivar is prized for its dense growth habit and seasonal color changes, adding visual interest to landscapes throughout the year.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. josifovicii is primarily native to the Balkan Peninsula, including parts of southern Europe. It is found in countries such as Croatia, Bosnia and Herzegovina, Serbia, Montenegro, and Albania. This plant thrives in temperate climates and is commonly found in forested areas and along riverbanks. Its distribution is closely associated with limestone soils and mountainous regions. It is a variant of the common horse chestnut and is known for its ornamental value.",
    "distribution_introduced_art_desc": "Acer campestre f. josifovicii was mainly introduced to Europe, particularly in the Czech Republic and surrounding regions. It is a naturally occurring form of the European horse chestnut, known for its distinctive white flowers and ornamental value. This variety has been cultivated for its aesthetic appeal in urban and suburban landscapes. Its introduction has contributed to the diversity of ornamental trees in temperate climates. However, it is important to monitor its spread to prevent potential ecological impacts."
}
