{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. leiocarpum",
    "plant_slug": "acer-campestre-var-leiocarpum",
    "plant_name_scientific": "acer campestre var. leiocarpum",
    "intro": "Acer campestre var. leiocarpum, commonly known as the smooth-leaf maple, is a variant of the common maple tree. It is characterized by its smooth, elliptical leaves that are typically dark green on the upper surface and lighter on the underside. This variety is native to parts of Europe and western Asia, where it thrives in temperate climates. The tree produces small, yellowish flowers in early spring, followed by samaras that aid in its propagation. Its ornamental value makes it a popular choice for landscaping in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. leiocarpum is primarily native to southern and eastern Europe, including parts of the Iberian Peninsula, France, Italy, and the Balkans. This variety of the common horse chestnut is typically found in woodland edges, open forests, and along riverbanks. It thrives in temperate climates with well-drained soils. The plant is known for its ornamental value, featuring showy white flowers and distinctive palmate leaves. Its native range reflects its adaptability to a variety of ecological conditions within its geographic area.",
    "distribution_introduced_art_desc": "Acer campestre var. leiocarpum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in woodland edges, stream banks, and rocky slopes. This variety is valued for its ornamental value, particularly its smooth, gray bark and vibrant fall color. It has been introduced to several regions in the United States and parts of Europe for landscaping and ecological restoration purposes. Due to its adaptability, it has become naturalized in some areas outside its native range."
}
