{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer crassipes",
    "plant_slug": "acer-crassipes",
    "plant_name_scientific": "acer crassipes",
    "intro": "Acer crassipes, commonly known as the red maple, is a deciduous tree native to eastern North America. It is characterized by its vibrant autumn foliage, which displays shades of red, orange, and yellow. The tree has opposite, palmate leaves that are typically 5-9 lobes, with serrated edges. Its flowers are small and inconspicuous, appearing in early spring before the leaves emerge. Acer crassipes thrives in a variety of soil types and is often found in moist, well-drained environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer crassipes is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetland areas, swamps, and along the edges of ponds and streams. This species thrives in moist, acidic soils and is often associated with cypress swamps. It is also present in some regions of Mexico, particularly in the Yucatán Peninsula. Due to its preference for wet environments, it plays an important ecological role in maintaining the biodiversity of these habitats.",
    "distribution_introduced_art_desc": "Acer crassipes was mainly introduced to wetlands and riparian areas where it can thrive in moist, well-drained soils. It is often found along streams, rivers, and lakeshores, where it plays a role in stabilizing soil and providing habitat for wildlife. The plant is known for its distinctive heart-shaped leaves and its ability to tolerate periodic flooding. Its introduction has sometimes led to competition with native species in these ecosystems. However, it is also valued for its ornamental qualities and ecological benefits in certain environments."
}
