{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. bedoioides",
    "plant_slug": "acer-campestre-f-bedoioides",
    "plant_name_scientific": "acer campestre f. bedoioides",
    "intro": "Acer campestre f. bedoioides, commonly known as the bedoioides form of the field maple, is a variant of the common maple. It is characterized by its distinctive, finely toothed leaves that are often a striking green with a bluish tinge. The plant produces small, inconspicuous greenish-yellow flowers in early spring, followed by winged samaras that disperse its seeds. It thrives in well-drained soils and is often found in woodland edges or hedgerows. This form is notable for its ornamental value and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. bedoioides is primarily native to the eastern and central regions of Europe, including countries such as Germany, Poland, the Czech Republic, and parts of Austria. This variety is also found in some areas of northern Italy and southern France. It thrives in temperate climates and is commonly associated with woodlands and open landscapes. The plant is known for its distinctive foliage and is often used in horticulture for its ornamental value. Its distribution is closely linked to the natural habitats of the European continent.",
    "distribution_introduced_art_desc": "Acer campestre f. bedoioides was mainly introduced to areas with well-drained soils and full to partial sunlight, typically in temperate regions. It is commonly found in urban environments, parks, and along roadsides due to its adaptability. This form of the European horse chestnut is valued for its ornamental value, featuring attractive leaves and resistance to certain pests. It has been widely planted in Europe and parts of North America for landscaping purposes. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
