{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. albovariegatum",
    "plant_slug": "acer-dasycarpum-f-albovariegatum",
    "plant_name_scientific": "acer dasycarpum f. albovariegatum",
    "intro": "Acer dasycarpum f. albovariegatum, commonly known as the variegated maple, is a unique variant of the hairy maple. It is characterized by its striking variegated foliage, which features white and yellow markings on the leaves. The plant is a deciduous shrub or small tree native to the eastern Himalayas. Its leaves are palmately lobed and turn vibrant shades of red and orange in the fall. This cultivar is valued for its ornamental appeal in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. albovariegatum is primarily native to the mountainous regions of central and western China, particularly in the provinces of Sichuan, Yunnan, and Tibet. This plant thrives in temperate climates with high altitudes, often found in forested areas and rocky slopes. It is commonly associated with mixed coniferous and broadleaf forests at elevations ranging from 2,000 to 3,500 meters. The variegated leaves of this cultivar make it a popular ornamental plant in horticulture. Its native distribution reflects its adaptation to the unique ecological conditions of the Himalayan and adjacent mountain ranges.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. albovariegatum was mainly introduced to ornamental horticulture due to its unique variegated foliage. It is commonly cultivated in gardens and parks for its aesthetic appeal. This plant thrives in temperate climates and requires well-drained soil. It is often used as a specimen tree or in mixed borders. Its introduction has expanded its presence in both private and public landscapes worldwide."
}
