{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens f. subglabrum",
    "plant_slug": "acer-cinerascens-f-subglabrum",
    "plant_name_scientific": "acer cinerascens f. subglabrum",
    "intro": "Acer cinerascens f. subglabrum, commonly known as the smooth-leaf maple, is a variant of the smoke maple characterized by its smooth, glabrous leaves. It is a deciduous tree native to eastern North America, typically found in moist, well-drained soils. The leaves are ovate to elliptic, with a finely toothed margin and a pale green underside. It produces small, yellowish-green flowers in early spring, followed by winged samaras that disperse its seeds. This cultivar is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens f. subglabrum is primarily native to the southeastern United States, specifically occurring in parts of Georgia, South Carolina, and North Carolina. This subspecies is typically found in moist, well-drained soils within mixed hardwood forests. It thrives in areas with partial to full sunlight and is often associated with riverine and bottomland habitats. The plant is known for its distinctive grayish-brown bark and heart-shaped leaves. Due to its limited range, it is considered a rare and localized species within its native region.",
    "distribution_introduced_art_desc": "Acer cinerascens f. subglabrum was mainly introduced to urban and suburban areas where it is cultivated for its ornamental value. This distribution is primarily due to its attractive, smooth-textured leaves and adaptability to a range of soil conditions. It is commonly found in parks, gardens, and along roadsides in regions with temperate climates. The plant's introduction has been facilitated by horticultural interests and its ability to thrive in managed landscapes. However, its spread beyond cultivated areas is limited compared to other similar species."
}
