{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer abchasicum",
    "plant_slug": "acer-abchasicum",
    "plant_name_scientific": "acer abchasicum",
    "intro": "Acer abchasicum, commonly known as the Abkhazian maple, is a species of maple native to the Caucasus region. It is a deciduous tree that typically grows to a height of 10–20 meters, featuring a rounded crown and smooth, gray bark. Its leaves are palmately lobed, with five to seven segments, and are usually green on top and paler underneath. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in temperate climates and is often found in forested areas with well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer abchasicum is primarily native to the Caucasus region, including parts of Georgia, Russia, and Turkey. It is commonly found in mountainous areas with temperate climates. This species thrives in well-drained soils and is often associated with mixed forests. Its distribution is limited to specific elevations, typically between 1,000 and 2,500 meters. Due to its restricted habitat, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acer abchasicum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is often found in forested regions. This species is known for its ornamental value due to its vibrant fall coloration. It has been cultivated in gardens and parks for its aesthetic appeal. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
