{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer californicum f. albidum",
    "plant_slug": "acer-californicum-f-albidum",
    "plant_name_scientific": "acer californicum f. albidum",
    "intro": "Acer californicum f. albidum, commonly known as the white-leaf maple, is a variant of the California maple. It is characterized by its distinctive white to pale green leaves, which contrast with the typical green foliage of the species. This plant is native to the western United States, particularly in California and Oregon. It thrives in moist, well-drained soils and is often found in riparian areas. The tree has a rounded canopy and can grow up to 20 meters tall, making it a notable feature in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer californicum f. albidum is primarily native to the coastal regions of California, particularly in the northern and central parts of the state. This plant is commonly found in areas with mild, moist climates and well-drained soils. It thrives in open woodlands, chaparral, and along stream banks. Its distribution is limited to specific microhabitats that provide the right balance of sunlight and moisture. This variety is often associated with the coastal fog belt, which contributes to its unique ecological niche.",
    "distribution_introduced_art_desc": "Acer californicum f. albidum was mainly introduced to ornamental horticulture and landscaping due to its attractive white to pale green foliage. It is commonly cultivated in gardens and parks for its aesthetic value, especially in regions with mild, temperate climates. This form is a variation of the Pacific madrone, known for its unique coloration and ecological adaptability. It has been distributed across the western United States, particularly in California and Oregon. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
