{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. robustum",
    "plant_slug": "acer-campbellii-subsp-robustum",
    "plant_name_scientific": "acer campbellii subsp. robustum",
    "intro": "Acer campbellii subsp. robustum, commonly known as the Campbell's maple, is a deciduous tree native to the mountainous regions of central China. It is characterized by its heart-shaped leaves that turn vibrant shades of red and yellow in the fall. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and prefers full sun to partial shade. This subspecies is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. robustum is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. It grows in high-altitude areas with cool, moist climates, often found in mixed forests and rocky habitats. This subspecies is adapted to the unique environmental conditions of these regions, including well-drained soils and partial shade. It is a relatively rare and endemic species, contributing to the biodiversity of its native range. Due to its restricted distribution, it is considered vulnerable to habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. robustum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique growth characteristics. The introduction occurred in the late 19th century, primarily through horticultural trade and botanical exchanges. It has since been cultivated in various parts of the country, particularly in gardens and urban landscapes. However, it is not considered invasive and has not spread widely into natural ecosystems."
}
