{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. josifovicii",
    "plant_slug": "acer-campestre-var-josifovicii",
    "plant_name_scientific": "acer campestre var. josifovicii",
    "intro": "Acer campestre var. josifovicii, commonly known as the Josifovicii hedge maple, is a variety of the common maple. It is characterized by its dense, compact growth habit and is often used as a hedge or screen plant. The leaves are typically oval to ovate, with a serrated margin and a bronze to dark green coloration. It produces small, yellowish-green flowers in early spring, followed by red or orange samaras. This variety is valued for its hardiness and adaptability to various soil types and light conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. josifovicii is primarily native to the Balkan Peninsula, including parts of southeastern Europe. It is found in countries such as Bosnia and Herzegovina, Croatia, Serbia, Montenegro, and North Macedonia. This variety thrives in temperate climates and is commonly found in forested areas and along river valleys. It is a smaller variant of the common maple, often growing in shaded or semi-shaded environments. Its distribution is closely tied to the specific ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acer campestre var. josifovicii was mainly introduced to Europe as a horticultural curiosity due to its unique leaf morphology and ornamental value. It was first recorded in the late 19th century and gained popularity among botanists and gardeners for its distinctive foliage. The plant is now cultivated in various regions across Europe, particularly in botanical gardens and private collections. Its introduction has led to limited naturalization in some areas, though it remains primarily a garden species. Despite its ornamental appeal, it is not widely distributed in the wild compared to other maple species."
}
