{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. campbellii",
    "plant_slug": "acer-campbellii-subsp-campbellii",
    "plant_name_scientific": "acer campbellii subsp. campbellii",
    "intro": "Acer campbellii subsp. campbellii, commonly known as the Campbell's maple, is a deciduous tree native to the mountainous regions of southern China. It is characterized by its striking red to orange foliage, which becomes particularly vibrant in the autumn season. The tree typically grows to a height of 10–15 meters, with a broad, rounded crown. Its leaves are palmately lobed, with five to seven pointed lobes, and are usually dark green on top and paler underneath. This species is valued for its ornamental appeal and is often cultivated in gardens and parks for its seasonal color display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campbellii"
    },
    "taxonomy_art_desc": "Acer campbellii subsp. campbellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and other primitive plant groups. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Sapindales, which comprises flowering plants that are often found in tropical and subtropical regions and include families such as Sapindaceae and Rutaceae. Its family is Sapindaceae, known as the soapberry family, which includes trees, shrubs, and climbers with often showy flowers and fruits that may contain toxic compounds. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs characterized by their opposite leaves and distinctive samarina fruits. Its species is Acer campbellii, a rare maple native to New Zealand, known for its unique foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "East Himalaya",
        "Laos",
        "Myanmar",
        "Nepal",
        "Tibet",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. campbellii is primarily native to China South-Central, East Himalaya, Laos, Myanmar, Nepal, Tibet, Vietnam, West Himalaya. This species is found in the mountainous regions of these areas, typically in temperate to subtropical climates. It thrives in elevated terrain with well-drained soils and moderate humidity. The plant is often associated with mixed forests and is a characteristic element of the local flora. Its native distribution spans a wide geographic range across Asia, reflecting its adaptability to diverse ecological conditions.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. campbellii was mainly introduced to gardens and horticultural collections due to its ornamental value and unique foliage. It is native to China and has been cultivated in various parts of the world, including North America and Europe. The plant is valued for its vibrant autumn colors and compact growth habit, making it a popular choice for landscapers and gardeners. However, its introduction has raised concerns about potential invasiveness in certain regions. Despite its beauty, careful monitoring is recommended to prevent unintended ecological impacts."
}
