{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer angustilobum",
    "plant_slug": "acer-angustilobum",
    "plant_name_scientific": "acer angustilobum",
    "intro": "Acer angustilobum, commonly known as the red maple, is a deciduous tree native to eastern North America. It is characterized by its distinctive palmate leaves that turn vibrant red in the fall. The tree produces small, red samaras that are dispersed by wind. It thrives in a variety of soil types but prefers moist, well-drained conditions. Its ornamental value makes it a popular choice for landscaping and urban environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer angustilobum is primarily native to eastern North America, specifically the United States and Canada. It is found in the northeastern United States, including states such as New York, Pennsylvania, and New Jersey. This species also extends into parts of southeastern Canada, including Ontario and Quebec. It typically grows in moist, well-drained soils in woodlands, stream valleys, and other mesic habitats. Acer angustilobum is commonly known as the narrow-leaf maple and is a characteristic component of the eastern deciduous forest ecosystem.",
    "distribution_introduced_art_desc": "Acer angustilobum was mainly introduced to the northeastern United States as an ornamental tree due to its attractive foliage and adaptability to various soil types. It has been widely planted in urban and suburban landscapes for its aesthetic value and ability to thrive in shaded conditions. However, its introduction has raised concerns about its potential to outcompete native species in natural habitats. Despite its popularity, it is not considered invasive in most regions where it has been introduced. The plant's distribution is largely confined to areas where it has been intentionally cultivated."
}
