{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. dissectum",
    "plant_slug": "acer-dasycarpum-var-dissectum",
    "plant_name_scientific": "acer dasycarpum var. dissectum",
    "intro": "Acer dasycarpum var. dissectum, commonly known as the dissected maple, is a deciduous shrub or small tree native to the mountainous regions of central and eastern Asia. It is characterized by its finely dissected, palmate leaves that turn vibrant shades of red and orange in the fall. The plant produces small, yellowish-green flowers in early spring, followed by samaroid fruits that disperse its seeds. It thrives in well-drained soils and partial to full sunlight, making it a popular choice for ornamental gardening. Its unique foliage makes it a striking addition to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. dissectum is primarily native to the mountainous regions of central and western China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude areas with cool, moist climates and is often found in forests and rocky slopes. This variety is adapted to the unique environmental conditions of the Himalayan region. Its natural range includes parts of northern India and Nepal as well. It is a rare and ecologically significant species within its native habitat.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. dissectum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in USDA hardiness zones 5 through 8. This variety is valued for its striking foliage, which turns vibrant shades of red and orange in the fall. It thrives in partial to full sun and well-drained soil. Due to its ornamental appeal, it has become a popular choice for landscaping in cooler climates."
}
