{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. subtrilobatum",
    "plant_slug": "acer-dasycarpum-var-subtrilobatum",
    "plant_name_scientific": "acer dasycarpum var. subtrilobatum",
    "intro": "Acer dasycarpum var. subtrilobatum, commonly known as the three-lobed maple, is a deciduous tree native to the Himalayas. It is characterized by its palmately lobed leaves, which typically have three distinct lobes, giving it its common name. The tree produces small, red samaras that are dispersed by wind, contributing to its reproductive strategy. Its bark is smooth and grayish-brown, with shallow furrows that become more pronounced with age. This species is valued for its ornamental appeal and is often cultivated in gardens for its vibrant autumn foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. subtrilobatum is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and northern India. This variant of the maple tree thrives in mountainous areas at elevations ranging from 1,500 to 3,000 meters. It is commonly found in moist, temperate forests where it forms part of the understory vegetation. The plant prefers well-drained soils and is often associated with mixed coniferous and broadleaf forests. Its natural range is limited to these specific geographic and ecological conditions.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. subtrilobatum was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in full sun to partial shade. It is commonly found in regions with mild winters and warm summers, making it suitable for cultivation in USDA hardiness zones 5 through 8. This variety is valued for its ornamental value, particularly its distinctive trifoliate leaves and vibrant fall color. It is often used in landscaping and as a specimen plant due to its adaptability and aesthetic appeal. However, it requires regular watering and protection from extreme weather conditions to ensure optimal growth."
}
