{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer californicum f. rubescens",
    "plant_slug": "acer-californicum-f-rubescens",
    "plant_name_scientific": "acer californicum f. rubescens",
    "intro": "Acer californicum f. rubescens, commonly known as the red-leaf maple, is a variant of the California maple. It is characterized by its striking red foliage, which becomes more vibrant in the fall. This ornamental tree is native to the western United States, particularly California. The leaves are typically ovate to elliptical in shape, with serrated edges. It prefers well-drained soil and full sun, making it a popular choice for landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer californicum f. rubescens is primarily native to the coastal regions of California, particularly in the northern and central parts of the state. This form of the California maple is commonly found in moist, well-drained soils along streambanks and in open woodlands. It thrives in areas with mild, wet winters and dry summers, typical of the Mediterranean climate of coastal California. The plant is often seen in the Santa Cruz Mountains and along the coast from San Francisco to Santa Barbara. It is an important component of the local flora and is adapted to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acer californicum f. rubescens was mainly introduced to areas with well-drained soils and full sun exposure, typically in regions with a Mediterranean climate. It is commonly found in coastal scrub and chaparral habitats, where it thrives in mild, wet winters and dry summers. This variety is valued for its vibrant red fall color, making it a popular ornamental plant in landscaping. Its introduction has expanded its range beyond its native habitat in California. However, it is important to manage its spread to prevent potential ecological impacts in non-native environments."
}
