{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer chiangdaoense",
    "plant_slug": "acer-chiangdaoense",
    "plant_name_scientific": "acer chiangdaoense",
    "intro": "Acer chiangdaoense, commonly known as the Chiang Dao maple, is a deciduous tree native to the mountainous regions of northern Thailand. It is characterized by its striking red to orange foliage in the fall, which makes it a popular ornamental plant. The tree has a broad, spreading crown and heart-shaped leaves that are typically 5–10 centimeters in length. It prefers well-drained soil and partial to full sunlight, thriving in temperate climates. Due to its unique appearance and ecological significance, it is also valued for its role in local biodiversity and traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer chiangdaoense"
    },
    "taxonomy_art_desc": "Acer chiangdaoense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, often with compound leaves and fruits that are capsules or drupes. Its family is Sapindaceae, commonly known as the soapberry family, which includes a variety of trees and shrubs with distinctive flowers and fruits. Its genus is Acer, which consists of deciduous trees and shrubs commonly known as maples, characterized by their opposite leaves and samaroid fruits. Its species is Acer chiangdaoense, a lesser-known maple species native to China, distinguished by its unique morphological traits and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer chiangdaoense is primarily native to Thailand. This species is found in the northern regions of the country, particularly in the Chiang Dao area. It thrives in humid, subtropical climates with well-drained soils. The plant is commonly associated with montane forests and is often found at elevations between 1,000 and 2,000 meters. Its natural distribution is limited to specific microhabitats within Thailand's mountainous terrain.",
    "distribution_introduced_art_desc": "Acer chiangdaoense was mainly introduced to the temperate regions of East Asia, particularly in China, where it thrives in moist, well-drained soils. It is commonly found in mountainous areas with cool climates, often growing in forests or along stream banks. This species is valued for its ornamental value due to its vibrant autumn foliage and unique leaf shape. It has also been introduced to other parts of the world, including North America and Europe, for horticultural purposes. However, its natural range remains primarily restricted to its native habitat in southern China."
}
