{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum var. grandidentatum",
    "plant_slug": "acer-barbatum-var-grandidentatum",
    "plant_name_scientific": "acer barbatum var. grandidentatum",
    "intro": "Acer barbatum var. grandidentatum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its ornamental foliage, which displays vibrant red, orange, and yellow colors during the fall season. The leaves are palmately lobed with serrated edges, and they are typically large, reaching up to 10 inches in length. It prefers well-drained soil and partial to full sunlight, making it a popular choice for gardens and landscapes. The tree is also valued for its elegant form and seasonal beauty, contributing to its widespread cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum var. grandidentatum is primarily native to the Appalachian Mountains of the eastern United States. This plant is found in the states of Virginia, West Virginia, and Tennessee. It thrives in moist, well-drained soils in shaded to partially shaded forest environments. The species is often associated with mixed hardwood forests and streamside habitats. Its distribution is limited to specific regions within the southeastern United States.",
    "distribution_introduced_art_desc": "Acer barbatum var. grandidentatum was mainly introduced to the eastern United States, particularly in the Appalachian Mountains. It was brought there by early European settlers and naturalized in the wild. This species thrives in moist, well-drained soils and is often found in mixed hardwood forests. Its introduction has led to its naturalization in several states, including Tennessee, Virginia, and North Carolina. However, it is not considered invasive and is generally regarded as a non-native but benign species in its introduced range."
}
