{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. microcarpum",
    "plant_slug": "acer-campestre-var-microcarpum",
    "plant_name_scientific": "acer campestre var. microcarpum",
    "intro": "Acer campestre var. microcarpum, commonly known as the dwarf maple, is a low-growing variant of the common maple. It is characterized by its dense, compact growth habit and small, ovate leaves with a serrated margin. The plant produces tiny, red or orange fruits that are clustered in umbels, distinguishing it from other maple species. It thrives in well-drained soils and full sun to partial shade, making it a suitable choice for rock gardens or as a ground cover. This variety is valued for its ornamental appeal and hardiness in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. microcarpum is primarily native to parts of Europe, particularly in the western and central regions, including countries such as France, Spain, and Italy. It is also found in some areas of North Africa, including Morocco and Algeria. This variety of maple is commonly associated with limestone soils and can be found in woodlands, hedgerows, and along roadsides. It thrives in temperate climates and is often seen in regions with mild winters and warm summers. Its native range reflects its adaptability to a variety of habitats within its geographic distribution.",
    "distribution_introduced_art_desc": "Acer campestre var. microcarpum was mainly introduced to areas where it can thrive in moist, well-drained soils and partial shade. It is commonly found in woodland edges, stream banks, and other damp habitats. This variety is valued for its ornamental value, particularly its distinctive small, dark green leaves. It has been introduced to several regions outside its native range, including parts of Europe and North America. Due to its adaptability, it has become naturalized in some areas, raising concerns about its potential impact on local ecosystems."
}
