{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. villosum",
    "plant_slug": "acer-campestre-var-villosum",
    "plant_name_scientific": "acer campestre var. villosum",
    "intro": "Acer campestre var. villosum, commonly known as the silky maple, is a deciduous shrub or small tree native to Europe and western Asia. It is characterized by its dense, spreading habit and small, palmate leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that disperse its seeds. It thrives in well-drained soils and partial to full sun, often found in woodland edges and hedgerows. Its ornamental value makes it a popular choice for garden use, though it is less commonly cultivated than other maple species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. villosum is primarily native to parts of Europe, particularly in the British Isles, including England, Scotland, and Ireland. It is also found in northern regions of France, Belgium, and the Netherlands. This variety of the common maple is typically found in woodland edges, hedgerows, and moist, well-drained soils. It thrives in temperate climates and is often associated with calcareous soils. Its native range extends into parts of southern Scandinavia as well.",
    "distribution_introduced_art_desc": "Acer campestre var. villosum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in woodland edges, streambanks, and rocky slopes where it can thrive in moderate to cool climates. This plant is often used in landscaping for its ornamental value, including its finely textured leaves and adaptability to different soil types. Its introduction has expanded its range beyond its native habitat, making it a common sight in urban and suburban gardens. However, it is important to monitor its spread to prevent potential ecological impacts in natural areas."
}
