{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatifolium",
    "plant_slug": "acer-caudatifolium",
    "plant_name_scientific": "acer caudatifolium",
    "intro": "Acer caudatifolium, commonly known as the long-leaved maple, is a deciduous tree native to the mountainous regions of Central Asia. It is characterized by its distinctive, elongated leaves that are typically 10–20 cm in length. The leaves are usually doubly serrated and have a bright green upper surface with a lighter underside. It produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. This species is valued for its ornamental appeal and is often cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer caudatifolium"
    },
    "taxonomy_art_desc": "Acer caudatifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of growth forms. Its order is Sapindales, which includes a variety of flowering plants such as maples, lychees, and buckeyes. Its family is Sapindaceae, known for its diverse species with often showy flowers and fruits that may be capsules or drupes. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer caudatifolium, a specific type of maple known for its unique, elongated leaves and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatifolium is primarily native to Taiwan. It is found in the mountainous regions of the island, where it thrives in temperate climates. This species is commonly seen in forested areas and along streamside habitats. Its native range is limited to Taiwan, where it plays a role in local ecosystems. The plant is well adapted to the specific environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acer caudatifolium was mainly introduced to regions with temperate climates and well-drained soils, particularly in mountainous areas. It thrives in areas with moderate rainfall and full sun exposure. This species is often cultivated for its ornamental value due to its striking foliage and unique leaf shape. It has been introduced to several parts of Europe and North America as a landscape plant. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
