{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum f. barbinerve",
    "plant_slug": "acer-cappadocicum-f-barbinerve",
    "plant_name_scientific": "acer cappadocicum f. barbinerve",
    "intro": "Acer cappadocicum f. barbinerve, commonly known as the Cappadocian maple, is a rare and distinctive variant of the Cappadocian maple. It is characterized by its finely serrated, barbed veins that give it a unique appearance. The leaves are typically ovate to elliptical in shape, with a smooth upper surface and a hairy underside. It is native to Turkey and thrives in temperate climates with well-drained soil. This ornamental tree is valued for its striking foliage and is often cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum f. barbinerve is primarily native to the mountainous regions of Turkey, specifically the Cappadocia area. This unique form of the maple is adapted to the rugged terrain and high altitudes of this region. It thrives in rocky soils and is often found in forested areas with moderate rainfall. The plant is an important component of the local flora and is well-suited to the climate of the region. Its native distribution is limited to this specific geographic area, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acer cappadocicum f. barbinerve was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive as an ornamental tree. It is commonly found in regions with mild winters and warm summers, making it suitable for cultivation in parts of the United States and Europe. This particular form is valued for its distinctive, finely toothed leaves that add visual interest to landscapes. It is often planted in gardens and parks for its aesthetic appeal and ability to provide shade. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
