{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer californicum",
    "plant_slug": "acer-californicum",
    "plant_name_scientific": "acer californicum",
    "intro": "Acer californicum, commonly known as the California maple, is a deciduous tree native to the western United States. It is characterized by its heart-shaped leaves that turn vibrant shades of red and yellow in the fall. The plant produces small, red flowers in early spring, followed by winged seeds that are dispersed by the wind. It typically grows in moist, well-drained soils and thrives in areas with mild winters. The California maple is valued for its ornamental appeal and ecological benefits in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer californicum is primarily native to the western United States, specifically California. It is commonly found in coastal regions, particularly along the central and southern coastlines. This species thrives in sandy soils and is often associated with chaparral and coastal scrub habitats. It is also present in parts of Oregon and Baja California, Mexico. The plant is well adapted to the mild, Mediterranean climate of its native range.",
    "distribution_introduced_art_desc": "Acer californicum was mainly introduced to areas with mild, temperate climates and well-drained soils, often found in coastal regions and mountainous areas. It thrives in USDA hardiness zones 7 through 9, where it can tolerate both sun and partial shade. This plant is commonly used in landscaping due to its attractive foliage and adaptability to different soil types. It is also valued for its ability to withstand coastal conditions and salt spray. However, it may become invasive in some regions if not properly managed."
}
