{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. nanum",
    "plant_slug": "acer-campestre-var-nanum",
    "plant_name_scientific": "acer campestre var. nanum",
    "intro": "Acer campestre var. nanum, commonly known as the dwarf maple, is a compact shrub or small tree native to Europe and western Asia. It is characterized by its slow growth rate and dense, rounded form, making it ideal for small gardens or rockeries. The plant features palmately lobed leaves that turn vibrant shades of red and orange in autumn. It produces small, clustered flowers in early spring, followed by winged seeds. This variety is valued for its ornamental appeal and hardiness in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. nanum is primarily native to southern Europe, including countries such as Spain, Portugal, Italy, and parts of France. It is also found in the Iberian Peninsula and extends into northern Africa, particularly Morocco and Algeria. This variety of the common maple is adapted to rocky and dry habitats, often growing in mountainous regions. It thrives in temperate climates with well-drained soils. Its native distribution reflects its preference for sunny, arid environments across these regions.",
    "distribution_introduced_art_desc": "Acer campestre var. nanum was mainly introduced to urban and suburban landscapes due to its compact size and ornamental value. It is often used as a hedge or ornamental tree in gardens and along pathways. This variety is favored for its slow growth, making it easy to manage in small spaces. It thrives in a variety of soil types and is relatively drought-tolerant once established. However, it is important to note that it may spread aggressively through seed dispersal, requiring careful management in natural areas."
}
