{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum var. horizontale",
    "plant_slug": "acer-buergerianum-var-horizontale",
    "plant_name_scientific": "acer buergerianum var. horizontale",
    "intro": "Acer buergerianum var. horizontale, commonly known as the horizontal maple, is a striking ornamental tree native to Japan. It is characterized by its unique, horizontally oriented branches that create a distinctive, umbrella-like canopy. The tree produces small, bright red flowers in early spring, followed by red or orange samaras in the fall. Its foliage is typically dark green with a slight bluish tinge, turning vibrant red in autumn. This variety is valued for its aesthetic appeal and is often used in landscape design for its visual interest and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum var. horizontale is primarily native to the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Jiangxi, and Fujian. This variety is commonly found in rocky and well-drained soils at elevations ranging from 600 to 1,500 meters. It thrives in temperate climates with moderate rainfall and is often associated with mixed forests and shrublands. The plant is known for its distinctive horizontal branching pattern and vibrant autumn foliage. It is a valued ornamental species in horticulture due to its unique growth form and aesthetic appeal.",
    "distribution_introduced_art_desc": "Acer buergerianum var. horizontale was mainly introduced to the Pacific Northwest region of the United States. It was brought in for its ornamental value due to its unique horizontal growth habit and vibrant fall color. This variety is often used in landscaping to add visual interest to gardens and public spaces. However, it has shown potential to spread beyond cultivated areas, raising concerns about its impact on native ecosystems. Its introduction has led to discussions about managing its distribution to prevent ecological disruption."
}
