{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amaliae",
    "plant_slug": "acer-amaliae",
    "plant_name_scientific": "acer amaliae",
    "intro": "Acer amaliae, commonly known as the Amalia maple, is a species of maple native to the mountainous regions of central China. It is characterized by its distinctive foliage, which features palmately lobed leaves with a serrated margin. The plant typically grows as a small to medium-sized tree, reaching heights of up to 10 meters. Its flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring. The fruit is a samara, which aids in the dispersal of its seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amaliae is primarily native to the western United States, specifically in California and southern Oregon. It is found in the Sierra Nevada and Klamath Mountains. This species grows in high-elevation forests and is often associated with mixed coniferous and hardwood stands. Acer amaliae is known for its distinctive yellow fall foliage and is a member of the maple family. Unfortunately, it is considered endangered due to habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Acer amaliae was mainly introduced to specific regions in the United States, particularly in California and Oregon, where it has been cultivated for its ornamental value. This plant is often found in gardens and parks due to its attractive foliage and adaptability to various soil types. It thrives in temperate climates and requires well-drained soil for optimal growth. The introduction of Acer amaliae has contributed to the diversity of tree species in these areas, though it is not native to the region. However, its non-native status has led to discussions about its ecological impact in local ecosystems."
}
