{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. foliis-variegatis",
    "plant_slug": "acer-campestre-var-foliis-variegatis",
    "plant_name_scientific": "acer campestre var. foliis-variegatis",
    "intro": "Acer campestre var. foliis-variegatis, commonly known as the variegated field maple, is a decorative variant of the common maple. It is characterized by its distinctive foliage, which features white or yellow markings on the leaves. The plant is a deciduous shrub or small tree, typically reaching heights of up to 6 meters. Its leaves are palmately lobed and turn vibrant shades of red and orange in the fall. It thrives in well-drained soils and is often used in ornamental horticulture for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. foliis-variegatis is primarily native to parts of Europe, including the British Isles, France, and western Germany. This variety of the common horse chestnut is typically found in woodlands, hedgerows, and along riverbanks. It thrives in temperate climates with well-drained soils. The variegated leaves make it a distinctive and ornamental species. Its natural range extends into parts of northern Africa and the Middle East.",
    "distribution_introduced_art_desc": "Acer campestre var. foliis-variegatis was mainly introduced to the United States during the 19th century as an ornamental plant due to its attractive variegated leaves. It was widely cultivated in gardens and public spaces for its aesthetic value and adaptability to various soil conditions. The introduction of this plant has led to its naturalization in some regions, where it can sometimes be found growing wild. It is often used in landscaping for its shade-providing capabilities and seasonal color changes. However, its spread has raised concerns about its potential impact on native plant communities in certain areas."
}
