{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer affine",
    "plant_slug": "acer-affine",
    "plant_name_scientific": "acer affine",
    "intro": "Acer affine, commonly known as the rock maple, is a deciduous tree native to eastern North America. It typically grows in rocky or well-drained soils, often found in mountainous regions. The tree has opposite, palmately lobed leaves that turn vibrant shades of red and yellow in the fall. Its small, yellowish-green flowers appear in early spring before the leaves emerge. Acer affine is valued for its ornamental appeal and ability to thrive in challenging environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer affine is primarily native to eastern Asia, including China, Japan, and Korea. It is commonly found in mountainous regions and forested areas within these countries. This species thrives in temperate climates with well-drained soils. It is often associated with mixed deciduous forests and rocky slopes. Its native range extends across various parts of East Asia, where it has adapted to diverse environmental conditions.",
    "distribution_introduced_art_desc": "Acer affine was mainly introduced to the northeastern United States and parts of Canada. It was brought there as an ornamental tree due to its attractive foliage and adaptability to various soil types. This species has since naturalized in some areas, particularly in disturbed habitats and along roadsides. It is considered invasive in certain regions because of its rapid growth and ability to outcompete native vegetation. However, it is also valued for its ecological benefits, such as providing food and shelter for wildlife."
}
