{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum",
    "plant_slug": "acer-circumlobatum",
    "plant_name_scientific": "acer circumlobatum",
    "intro": "Acer circumlobatum, commonly known as the Pacific madrone, is a deciduous tree native to the western United States. It is characterized by its smooth, peeling bark and clusters of white flowers that appear in early spring. The tree produces orange-red berries that are an important food source for birds and small mammals. Its leaves are broad, ovate, and turn vibrant shades of red and yellow in the fall. The plant thrives in well-drained soils and is adapted to coastal and mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum is primarily native to the western United States, specifically California and Oregon. It is commonly found in moist, shaded areas such as forests and along stream banks. This species thrives in cool, temperate climates with high humidity. It is often associated with mixed coniferous and deciduous forests. Its native range includes the Pacific Northwest, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acer circumlobatum was mainly introduced to specific regions in the western United States, particularly in California and Oregon, where it has been cultivated for its ornamental value. It is commonly found in gardens and along roadsides due to its attractive foliage and adaptability to various soil types. This species is often used in landscaping because of its ability to thrive in both sunny and partially shaded environments. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on native ecosystems. Its introduction has been primarily driven by horticultural interests rather than ecological necessity."
}
