{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. tricaudatum",
    "plant_slug": "acer-cappadocicum-var-tricaudatum",
    "plant_name_scientific": "acer cappadocicum var. tricaudatum",
    "intro": "Acer cappadocicum var. tricaudatum, commonly known as the three-tailed maple, is a rare variant of the Cappadocian maple. It is characterized by its distinctive three-lobed leaves that give it its common name. The plant is native to a limited region in Turkey, specifically the Cappadocia area. Its foliage turns vibrant shades of red and yellow in the fall, making it a striking ornamental plant. Due to its rarity and specific habitat requirements, it is often cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. tricaudatum is primarily native to the eastern Mediterranean region, particularly Turkey, Syria, and northern Iraq. This variety of the maple tree is found in rocky and mountainous areas, often growing in dry, sunny environments. It thrives in regions with well-drained soils and is adapted to the climate of the Anatolian Plateau. The plant is known for its distinctive three-lobed leaves and is part of the broader Acer cappadocicum species complex. Its distribution is limited to specific ecological niches in the Middle East.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. tricaudatum was mainly introduced to ornamental horticulture due to its unique and striking foliage. It is valued for its vibrant autumn colors and distinctive three-lobed leaves, making it a popular choice for landscaped gardens and parks. The plant's adaptability to various soil types and moderate climate conditions further contributed to its introduction and cultivation. However, it has also been noted as an invasive species in some regions, posing a threat to native flora. Its introduction has led to both aesthetic appreciation and ecological concerns in certain areas."
}
