{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer anhweiense var. brachypterum",
    "plant_slug": "acer-anhweiense-var-brachypterum",
    "plant_name_scientific": "acer anhweiense var. brachypterum",
    "intro": "Acer anhweiense var. brachypterum, commonly known as the short-winged maple, is a deciduous tree native to China. It is characterized by its distinctive palmate leaves with five to seven lobes, which turn vibrant shades of red and yellow in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It typically grows to a height of 8–12 meters and prefers well-drained soils in temperate climates. This variety is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer anhweiense var. brachypterum is primarily native to central and southern China, specifically in the provinces of Jiangxi, Zhejiang, and Fujian. It is commonly found in mountainous regions with moist, well-drained soils. This variety of maple thrives in temperate climates and is often associated with evergreen forests. It is a small to medium-sized tree known for its ornamental value. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer anhweiense var. brachypterum was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in partial to full sunlight. This variety is commonly found in forested areas and along stream banks, where it contributes to local biodiversity. Its introduction has been primarily for ornamental purposes due to its distinctive foliage and adaptability. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments. The plant's distribution is largely limited to specific geographic regions where it has been intentionally cultivated or naturally dispersed."
}
