{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. glabratum",
    "plant_slug": "acer-campestre-var-glabratum",
    "plant_name_scientific": "acer campestre var. glabratum",
    "intro": "Acer campestre var. glabratum, commonly known as the smooth field maple, is a deciduous shrub or small tree native to Europe. It is characterized by its smooth, pale bark and oval to elliptical leaves that are typically dark green on top and pale underneath. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and is often found in open woodlands or hedgerows. This variety is distinguished by its lack of hairy texture on the leaves and stems, giving it a sleek appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. glabratum is primarily native to the eastern United States, including parts of the Appalachian Mountains. It is commonly found in the southern and central regions of the country, such as Virginia, North Carolina, Tennessee, and Kentucky. This variety thrives in moist, well-drained soils and is often found in woodlands and along stream banks. It is known for its small, oval leaves and is sometimes referred to as the \"sugar maple\" due to its similar appearance to the sugar maple. However, it is distinct from the sugar maple and is more commonly found in the understory of deciduous forests.",
    "distribution_introduced_art_desc": "Acer campestre var. glabratum was mainly introduced to urban and suburban landscapes due to its ornamental value and adaptability. It is favored for its compact size, attractive foliage, and ability to thrive in a variety of soil conditions. This variety is often used as a hedge or specimen plant in gardens and parks. Its introduction has expanded its range beyond its native habitat, contributing to its presence in non-native regions. However, its spread has raised concerns about potential ecological impacts in areas where it may outcompete native species."
}
