{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cultratum",
    "plant_slug": "acer-cultratum",
    "plant_name_scientific": "acer cultratum",
    "intro": "Acer cultratum, commonly known as the Japanese maple, is a deciduous tree native to Japan and Korea. It is characterized by its delicate, palmate leaves that turn vibrant shades of red and orange in the fall. The tree typically grows to a height of 5–10 meters and has a slender, upright form. Its flowers are small, green, and inconspicuous, appearing before the leaves in early spring. The bark is smooth and reddish-brown, becoming more fissured with age.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cultratum is primarily native to the southeastern United States, specifically from North Carolina southward through Georgia and Florida. It is also found in parts of Texas and Oklahoma. This species thrives in moist, well-drained soils and is commonly found in woodland edges, stream banks, and swampy areas. It is known for its distinctive heart-shaped leaves and is often referred to as the \"cut-leaf maple.\" The plant plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acer cultratum was mainly introduced to the eastern and midwestern United States as an ornamental tree due to its unique, narrow leaves and attractive fall color. It is commonly found in urban and suburban landscapes, where it is valued for its aesthetic appeal and adaptability to various soil conditions. Despite its ornamental use, it has shown some potential to spread beyond cultivated areas, raising concerns about its ecological impact. The plant is typically found in moist, well-drained soils and can thrive in partial to full sun. Its introduction has led to its establishment in some natural areas, prompting monitoring efforts to assess its invasive potential."
}
