{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer auritum",
    "plant_slug": "acer-auritum",
    "plant_name_scientific": "acer auritum",
    "intro": "Acer auritum, commonly known as the Mexican maple, is a deciduous tree native to central Mexico. It is characterized by its distinctive heart-shaped leaves that turn vibrant red in the fall. The plant belongs to the Sapindaceae family and is known for its showy, clustered flowers that appear in the spring. Its bark is smooth and gray, often developing shallow fissures with age. Acer auritum is valued for its ornamental qualities and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer auritum is primarily native to the mountainous regions of Central America, particularly in countries such as Mexico, Guatemala, and Honduras. It thrives in temperate to subtropical climates, often growing in moist, well-drained soils within forested areas. This species is commonly found at elevations ranging from 1,000 to 2,500 meters above sea level. It is known for its distinctive ear-shaped leaves and is often associated with cloud forests and montane ecosystems. The plant plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acer auritum was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in moist, shaded areas such as woodlands and riparian zones. This species is valued for its ornamental value due to its attractive foliage and unique ear-shaped leaves. It has been cultivated in gardens and parks for its aesthetic appeal. However, it is important to note that it may spread aggressively in certain environments if not managed properly."
}
