{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer brevipes",
    "plant_slug": "acer-brevipes",
    "plant_name_scientific": "acer brevipes",
    "intro": "Acer brevipes, commonly known as the short-footed maple, is a deciduous tree native to the mountainous regions of central and southern China. It is characterized by its distinctive short, thick trunk and dense, rounded crown. The leaves are palmately lobed, with five to seven deep, narrow lobes, and turn bright red in the fall. It produces small, red or yellow flowers in early spring, followed by winged seeds that are dispersed by wind. This species is valued for its ornamental appeal and is often cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer brevipes"
    },
    "taxonomy_art_desc": "Acer brevipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which consists of vascular plants that include horsetails and ferns, known for their primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Sapindales, a group of flowering plants that includes species such as lychee and longan, often with showy flowers. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with distinctive fruits. Its genus is Acer, which refers to maple trees, known for their opposite leaf arrangement and vibrant autumn foliage. Its species is Acer brevipes, a specific type of maple native to China, characterized by its short stature and unique leaf morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer brevipes is primarily native to Vietnam. It is found in the mountainous regions of the country, particularly in the northern and central highlands. This species thrives in moist, temperate climates with well-drained soil. It is often encountered in secondary forests and along stream banks. Its distribution is relatively limited, making it a distinctive and less common member of the Acer genus in Vietnam.",
    "distribution_introduced_art_desc": "Acer brevipes was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate climates. It thrives in regions with cool summers and cold winters, making it suitable for higher elevation areas. This plant is often found in forested habitats, particularly in the Pacific Northwest of North America. Its introduction has been noted in several ecological studies due to its adaptability and ornamental value. However, it is not commonly cultivated outside its native range."
}
