{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. deflexum",
    "plant_slug": "acer-campestre-f-deflexum",
    "plant_name_scientific": "acer campestre f. deflexum",
    "intro": "Acer campestre f. deflexum, commonly known as the creeping maple, is a variant of the field maple characterized by its low-growing, spreading habit. It features small, ovate leaves with a doubly serrated margin, typically turning yellow in the autumn. The plant produces samaras, or winged seeds, which aid in wind dispersal. It thrives in sunny, well-drained soils and is often found in hedgerows and woodland edges. Its botanical features make it a valuable addition to gardens and ecological landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. deflexum is primarily native to southern and central Europe, including countries such as France, Spain, Italy, and parts of the Balkans. This subspecies thrives in temperate climates and is commonly found in woodlands, hedgerows, and along stream banks. It prefers well-drained soils and is often part of the undergrowth in mixed deciduous forests. The plant is known for its distinctive, often twisted growth habit and is valued for its ornamental qualities. Its distribution is closely tied to the natural habitats of the regions where it has historically grown.",
    "distribution_introduced_art_desc": "Acer campestre f. deflexum was mainly introduced to urban and suburban landscapes for its ornamental value and adaptability. It is commonly used in parks, gardens, and along streets due to its compact size and attractive, variegated foliage. This cultivar is favored for its ability to thrive in a variety of soil types and its tolerance to pollution, making it suitable for city environments. It has also been planted in woodland areas as a shade tree or hedging plant. However, its introduction has raised concerns about potential ecological impacts in non-native regions."
}
