{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amoenum var. nambuanum",
    "plant_slug": "acer-amoenum-var-nambuanum",
    "plant_name_scientific": "acer amoenum var. nambuanum",
    "intro": "Acer amoenum var. nambuanum, commonly known as the Nambu maple, is a deciduous tree native to Japan. It is characterized by its distinctive palmate leaves that turn vibrant shades of red and orange in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds. It typically grows to a height of 8–12 meters and prefers well-drained soil. Due to its ornamental value, it is cultivated in gardens and parks for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amoenum var. nambuanum is primarily native to the southern regions of China, particularly in the provinces of Guangdong, Guangxi, and Yunnan. This plant thrives in humid subtropical climates and is commonly found in mountainous areas with well-drained soils. It is often associated with mixed evergreen and deciduous forests at elevations ranging from 500 to 1,500 meters. The species is also occasionally found in nearby regions of northern Vietnam and southern Myanmar. Its natural habitat includes both natural and secondary forests, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acer amoenum var. nambuanum was mainly introduced to enhance ornamental value in gardens and landscapes due to its striking foliage and unique growth habits. It is commonly found in regions with temperate climates where it thrives in well-drained soil and partial to full sunlight. This variety is often cultivated for its vibrant autumn coloration, making it a popular choice for landscaping projects. Its introduction has also contributed to biodiversity in urban and suburban environments. However, it requires careful management to prevent potential ecological impacts in natural areas."
}
