{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. leiophyllum",
    "plant_slug": "acer-campestre-var-leiophyllum",
    "plant_name_scientific": "acer campestre var. leiophyllum",
    "intro": "Acer campestre var. leiophyllum, commonly known as the smooth-leaved field maple, is a deciduous shrub or small tree native to Europe. It is characterized by its smooth, dark green leaves that are typically oval to elliptic in shape. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in well-drained soils and prefers full sun to partial shade. This variety is valued for its ornamental appeal and is often used in landscaping for its compact growth habit and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. leiophyllum is primarily native to eastern North America, specifically the United States and parts of Canada. This variety of the European white elm is found in regions with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly associated with woodland edges and open habitats. Its distribution includes states such as Pennsylvania, New York, and parts of the Midwest. This plant is well adapted to the environmental conditions of its native range and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acer campestre var. leiophyllum was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the late 19th century as part of ornamental plant introductions. This variety is known for its smooth, gray bark and rounded canopy, making it a popular choice for urban landscaping. It has since become naturalized in several areas, though it is not considered invasive. The plant thrives in moist, well-drained soils and is often found in riparian zones and open woodlands."
}
