{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum var. pseudosieboldianum",
    "plant_slug": "acer-circumlobatum-var-pseudosieboldianum",
    "plant_name_scientific": "acer circumlobatum var. pseudosieboldianum",
    "intro": "Acer circumlobatum var. pseudosieboldianum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its ornamental foliage, which displays vibrant red, orange, and yellow hues in autumn. The plant has opposite, palmately compound leaves that are typically 5–9 cm long. It produces small, yellowish-green flowers in early spring, followed by red or orange berries. This variety is valued in horticulture for its aesthetic appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum var. pseudosieboldianum is primarily native to the mountainous regions of central and western China, particularly in the provinces of Sichuan, Yunnan, and Tibet. This variety thrives in cool, moist environments at high elevations, typically between 2,000 and 3,500 meters above sea level. It is commonly found in forests and rocky slopes, often growing in association with other temperate forest species. The plant is well adapted to the rugged terrain and climate of these regions, showing resilience to cold temperatures and poor soil conditions. Its distribution is limited to specific ecological niches within these mountainous areas.",
    "distribution_introduced_art_desc": "Acer circumlobatum var. pseudosieboldianum was mainly introduced to urban and suburban landscapes in North America for its ornamental value. It is valued for its attractive, finely toothed leaves that turn vibrant shades of red and orange in the fall. This variety is often used in gardens and parks due to its compact size and adaptability to various soil types. However, it has also been reported to spread beyond cultivated areas, potentially becoming invasive in some regions. Its introduction has raised concerns among ecologists due to its potential impact on native plant communities."
}
