{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer canescens",
    "plant_slug": "acer-canescens",
    "plant_name_scientific": "acer canescens",
    "intro": "Acer canescens, commonly known as the paper birch, is a deciduous tree native to eastern North America. It is characterized by its white, peeling bark that reveals layers of pale, papery tissue. The tree typically grows to a height of 20 to 40 feet, with a broad, conical crown. Its leaves are simple, alternate, and ovate with finely serrated edges. The plant produces small, yellowish-green flowers in spring, followed by winged seeds that are dispersed by the wind.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer canescens is primarily native to the southeastern United States, including parts of Georgia, Florida, and Texas. It thrives in moist, well-drained soils along stream banks and in wetland areas. This species is commonly found in the Appalachian Mountains and the coastal plains. It is also present in some regions of Mexico, particularly in the eastern states. Acer canescens is an important component of riparian and wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Acer canescens was mainly introduced to areas with well-drained soils and full sun to partial shade, typically in regions with a temperate climate. It thrives in USDA hardiness zones 5 through 8, making it suitable for a variety of North American landscapes. The plant is often used in landscaping for its ornamental value, including its distinctive grayish bark and yellow fall color. It is commonly found in urban environments and along roadsides due to its adaptability and low maintenance requirements. However, it is important to note that it may spread aggressively in certain conditions, requiring careful management."
}
