{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. obtusum",
    "plant_slug": "acer-campestre-f-obtusum",
    "plant_name_scientific": "acer campestre f. obtusum",
    "intro": "Acer campestre f. obtusum, commonly known as the smooth-leaved maple, is a variant of the common maple. It is characterized by its broad, rounded leaves that are typically smooth-edged, distinguishing it from other maple species. The plant is native to parts of Europe and western Asia, where it thrives in temperate climates. It produces small, yellowish-green flowers in early spring, followed by winged seeds. This ornamental tree is often cultivated for its aesthetic appeal and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. obtusum is primarily native to parts of Central and Eastern Europe, including countries such as Germany, Poland, and the Czech Republic. This variety of the common maple is typically found in woodland areas and along forest edges. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed deciduous forests and can be found in regions with a continental climate. Its native distribution is limited to specific geographic areas within Europe.",
    "distribution_introduced_art_desc": "Acer campestre f. obtusum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in urban landscapes, parks, and along roadsides where it serves as a hardy and low-maintenance shrub. This cultivar is valued for its compact growth habit and the vibrant color changes it exhibits throughout the seasons. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness in certain regions. Its introduction has contributed to the diversity of tree species used in landscaping across the country."
}
