{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. hebecarpum",
    "plant_slug": "acer-campestre-var-hebecarpum",
    "plant_name_scientific": "acer campestre var. hebecarpum",
    "intro": "Acer campestre var. hebecarpum, commonly known as the narrow-leaf maple, is a variant of the common maple tree. It is characterized by its slender, elongated leaves that are typically narrower than those of the typical Acer campestre. The plant produces small, winged seeds that are dispersed by wind, a common trait among maple species. It thrives in a variety of soil types and is adaptable to different light conditions. This variety is often used in landscaping due to its ornamental value and hardiness.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. hebecarpum is primarily native to parts of eastern and central Europe, including countries such as Germany, Poland, and the Czech Republic. It is commonly found in forested areas and along woodland edges, often growing in moist, well-drained soils. This variety of maple is adapted to temperate climates and is often associated with mixed deciduous forests. It is known for its distinctive winged seeds and its ability to thrive in shaded conditions. The plant plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acer campestre var. hebecarpum was mainly introduced to the United States as an ornamental plant due to its unique characteristics and aesthetic appeal. It is commonly found in the eastern and midwestern regions, where it has been planted in gardens and landscaped areas. Despite its popularity, it has not established itself as an invasive species in these regions. The plant prefers well-drained soils and full sun to partial shade, making it adaptable to various garden environments. Its introduction has been primarily for horticultural purposes rather than for ecological restoration."
}
