{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer angustilobum f. longicaudatum",
    "plant_slug": "acer-angustilobum-f-longicaudatum",
    "plant_name_scientific": "acer angustilobum f. longicaudatum",
    "intro": "Acer angustilobum f. longicaudatum, commonly known as the long-tailed maple, is a variant of the narrow-leaf maple. It is characterized by its distinctive elongated, tapering leaf lobes that give it its common name. The plant is native to the eastern United States, where it thrives in moist, well-drained soils. It typically grows as a small to medium-sized tree or shrub, reaching heights of up to 15 meters. The leaves are usually bright green in summer and turn vibrant shades of red and yellow in the fall, making it a visually striking ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer angustilobum f. longicaudatum is primarily native to the eastern United States, specifically in the Appalachian Mountains. This plant is found in regions spanning from New York to Georgia. It thrives in moist, well-drained soils along stream banks and in shaded woodland areas. The subspecies is known for its distinctive elongated, narrow leaves. It is a rare and relict population, reflecting its historical range and ecological niche.",
    "distribution_introduced_art_desc": "Acer angustilobum f. longicaudatum was mainly introduced to ornamental horticulture due to its unique, elongated leaf lobes that add visual interest to gardens. It is often cultivated for its aesthetic appeal rather than for ecological benefits. This form is commonly found in botanical gardens and private collections where its distinctive foliage is appreciated. However, it is not typically used in reforestation or natural habitat restoration. Its introduction has been limited to specific regions with suitable climates and soil conditions."
}
