{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum f. glaucum",
    "plant_slug": "acer-cappadocicum-f-glaucum",
    "plant_name_scientific": "acer cappadocicum f. glaucum",
    "intro": "Acer cappadocicum f. glaucum, commonly known as the glaucous maple, is a unique variant of the maple tree characterized by its distinctive blue-green foliage. This form exhibits a compact growth habit with dense, rounded crowns, making it an ornamental choice for gardens and landscapes. The leaves are typically lobed and have a striking, waxy appearance due to the presence of a whitish bloom. It thrives in well-drained soils and prefers full sun to partial shade. The plant is native to the mountainous regions of Turkey and is valued for its aesthetic appeal and adaptability to various climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum f. glaucum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. This variety is found in rocky and mountainous areas, often in dry and sunny environments. It thrives in regions with well-drained soils and is adapted to the harsh conditions of its native habitat. The plant is commonly associated with the Cappadocia region in Turkey, where it grows in limestone formations. Its distribution is limited to specific ecological niches, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Acer cappadocicum f. glaucum was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in full sun to partial shade. This form is known for its distinctive silver-green foliage, which makes it a popular ornamental plant in gardens and landscapes. It is often cultivated for its aesthetic value and ability to tolerate urban environments. The distribution has been expanded through horticultural practices and landscape design in North America and Europe. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
