{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. falcatum",
    "plant_slug": "acer-campestre-f-falcatum",
    "plant_name_scientific": "acer campestre f. falcatum",
    "intro": "Acer campestre f. falcatum, commonly known as the narrow-leaf maple, is a variant of the common maple characterized by its elongated, lance-shaped leaves. This deciduous shrub or small tree typically grows in woodland areas and is native to parts of Europe and western Asia. Its leaves are usually a vibrant green in summer and turn yellow or red in autumn, adding seasonal color to the landscape. The plant produces small, red or yellow flowers in early spring, followed by winged seeds that are dispersed by the wind. It is often used in horticulture for its ornamental value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. falcatum is primarily native to southern and eastern Europe, including regions such as Italy, France, Spain, and parts of the Balkans. This variety of the common maple is typically found in mountainous areas and forested regions. It thrives in temperate climates with well-drained soils. The plant is often associated with limestone soils and can be found in both natural and semi-natural habitats. Its distribution is limited to specific geographic areas within its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. falcatum was mainly introduced to the United States as an ornamental plant due to its unique leaf shape and adaptability to various soil conditions. It is commonly found in the eastern and midwestern regions, where it is used in landscaping and urban forestry. This variety is known for its tolerance to urban environments, making it a popular choice for street trees and park plantings. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on native plant communities. Its introduction has expanded the genetic diversity of maple species in cultivated settings."
}
