{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer chienii",
    "plant_slug": "acer-chienii",
    "plant_name_scientific": "acer chienii",
    "intro": "Acer chienii, commonly known as the Chinese maple, is a deciduous tree native to China. It belongs to the Sapindaceae family and is characterized by its ornamental value due to its vibrant autumn foliage. The tree typically grows to a height of 6–12 meters, with a rounded crown and smooth, gray bark. Its leaves are palmately lobed, turning bright red or orange in the fall, and it produces small, yellowish flowers in early spring. Acer chienii is often cultivated in gardens for its aesthetic appeal and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer chienii"
    },
    "taxonomy_art_desc": "Acer chienii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Sapindales, a group of flowering plants that includes trees, shrubs, and climbers, often with showy flowers and fruits that split open to release seeds. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with alternate leaves and fruits that often have a waxy coating. Its genus is Acer, commonly known as maples, which are well-known deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer chienii, a specific type of maple native to China, characterized by its unique foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer chienii is primarily native to China South-Central. This species is found in the mountainous regions of central China, particularly in provinces such as Hubei, Hunan, and Sichuan. It thrives in temperate climates with well-drained soils and is often found in forested areas. The plant is known for its ornamental value, with distinctive leaves that change color in the fall. Its native range is limited to this specific region, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acer chienii was mainly introduced to the eastern and central regions of the United States as an ornamental tree due to its unique foliage and adaptability to temperate climates. It is commonly found in urban and suburban landscapes, where it is valued for its aesthetic appeal and relatively low maintenance requirements. This species has been widely cultivated in gardens and parks, contributing to biodiversity in non-native habitats. However, its introduction has raised concerns about potential ecological impacts on local ecosystems. Despite these concerns, Acer chienii remains a popular choice for landscaping in regions with suitable growing conditions."
}
