{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. oliverianum",
    "plant_slug": "acer-campbellii-subsp-oliverianum",
    "plant_name_scientific": "acer campbellii subsp. oliverianum",
    "intro": "Acer campbellii subsp. oliverianum, commonly known as the Oliver's maple, is a rare and ornamental tree native to the mountainous regions of western China. It is characterized by its striking, palmately lobed leaves that turn vibrant shades of red and orange in the fall. The plant produces small, yellow-green flowers in early spring, followed by samaroid fruits that disperse its seeds. It prefers cool, moist climates and well-drained soils, making it suitable for cultivation in temperate gardens. Due to its limited natural range and ornamental value, it is often sought after by horticulturists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. oliverianum is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. This subspecies thrives in temperate to subtropical climates, often found in forested areas at elevations ranging from 1,500 to 3,000 meters. It is commonly associated with limestone soils and is often found in mixed deciduous forests. The plant is known for its distinctive maple-like foliage and is a member of the Acer genus, which includes many well-known maple species. Due to its limited distribution, it is considered a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. oliverianum was mainly introduced to gardens and botanical collections due to its unique foliage and ornamental value. It is often cultivated for its striking red and orange leaves, which display vivid colors in the fall. This subspecies is relatively rare in the wild and is primarily found in specific regions of China. Its introduction to horticulture has made it a sought-after plant among gardeners and plant enthusiasts. However, it is important to note that its cultivation should be managed carefully to prevent potential ecological impacts."
}
