{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. schwerinii",
    "plant_slug": "acer-campestre-var-schwerinii",
    "plant_name_scientific": "acer campestre var. schwerinii",
    "intro": "Acer campestre var. schwerinii, commonly known as the Schwerin maple, is a deciduous shrub or small tree native to Europe. It is characterized by its oval to elliptical leaves that are typically green on top and silver-white underneath, creating a striking visual contrast. The plant produces small, red or orange-red flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in well-drained soil and full to partial sunlight, making it suitable for gardens and landscapes. Its ornamental value is enhanced by its colorful autumn foliage, which ranges from yellow to red.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. schwerinii is primarily native to Central and Eastern Europe, including countries such as Germany, Poland, and the Czech Republic. It is commonly found in forested areas and along river valleys. This variety of the European maple thrives in temperate climates with moist, well-drained soils. It is often seen in woodlands and hedgerows, where it forms part of the undergrowth. Its natural range extends into parts of northern Italy and Austria as well.",
    "distribution_introduced_art_desc": "Acer campestre var. schwerinii was mainly introduced to Europe and parts of Asia as an ornamental plant due to its attractive foliage and adaptability. It is commonly found in gardens and parks, where it is valued for its compact growth habit and seasonal color changes. The variety was likely introduced during the 19th century through botanical exchanges between Europe and regions where it is native. It thrives in a variety of soil types and can tolerate urban environments, making it a popular choice for landscaping. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
