{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer curranii",
    "plant_slug": "acer-curranii",
    "plant_name_scientific": "acer curranii",
    "intro": "Acer curranii, commonly known as Curran's maple, is a species of maple native to the mountainous regions of western North America. It is a deciduous tree that typically grows to a height of 10 to 20 meters, featuring a rounded crown and smooth, gray bark. The leaves are palmately lobed, with five to seven pointed lobes, and are often bright green during the growing season. In autumn, the foliage turns vibrant shades of red, orange, and yellow, making it a striking ornamental tree. It prefers well-drained soils and full sun, often found in subalpine and alpine environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer curranii is primarily native to the western United States, specifically California and Oregon. It is commonly found in the coastal regions and mountainous areas of these states. This species thrives in moist, well-drained soils and is often associated with mixed evergreen forests. It is also known to occur in parts of western Nevada. Acer curranii is a relatively rare and localized species, with limited distribution across its native range.",
    "distribution_introduced_art_desc": "Acer curranii was mainly introduced to the western United States, particularly in regions with moist, well-drained soils. It is commonly found in areas with a temperate climate, such as California and Oregon. This species is often cultivated in gardens and parks due to its ornamental value and adaptability. It thrives in partial shade to full sun and is known for its vibrant fall foliage. However, it is considered invasive in some regions where it outcompetes native plant species."
}
