{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum subsp. yui",
    "plant_slug": "acer-buergerianum-subsp-yui",
    "plant_name_scientific": "acer buergerianum subsp. yui",
    "intro": "Acer buergerianum subsp. yui, commonly known as the Yui maple, is a deciduous shrub or small tree native to Japan. It is characterized by its finely toothed, ovate leaves that turn vibrant shades of red and orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras for seed dispersal. It thrives in moist, well-drained soils and partial to full shade, making it suitable for woodland gardens. Its ornamental value lies in its striking foliage and compact growth habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum subsp. yui is primarily native to the mountainous regions of central and southern China, particularly in provinces such as Sichuan, Yunnan, and Guizhou. It thrives in temperate to subtropical climates and is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. This subspecies is often associated with limestone soils and is part of the natural vegetation in these mountainous ecosystems. It is also occasionally found in neighboring regions of northern Vietnam and western Myanmar. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer buergerianum subsp. yui was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in woodland or forested environments. It thrives in temperate climates and is often found in regions with cool summers and cold winters. This species is valued for its ornamental qualities, including its vibrant fall color and unique leaf shape. It has been introduced to parts of North America, particularly in the eastern United States, where it is cultivated in gardens and parks. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
