{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. oblongifolium",
    "plant_slug": "acer-campestre-f-oblongifolium",
    "plant_name_scientific": "acer campestre f. oblongifolium",
    "intro": "Acer campestre f. oblongifolium, commonly known as the narrow-leaf dogwood, is a deciduous shrub or small tree native to Europe and western Asia. It is characterized by its slender, upright growth habit and oval-shaped leaves that are typically longer and narrower than those of the typical *Acer campestre*. The leaves are usually dark green on top and lighter underneath, turning yellow to orange in the fall. It produces small, inconspicuous greenish-yellow flowers in early spring, followed by red or orange berries that are edible for birds. This cultivar is valued for its ornamental appeal and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. oblongifolium is primarily native to parts of Europe, including the British Isles, France, and northern Spain. This variant of the common maple is typically found in woodland edges, hedgerows, and rocky soils. It thrives in temperate climates and is often associated with moist, well-drained soils. The plant is known for its distinctive oval-shaped leaves and is a common sight in natural and semi-natural habitats. Its distribution is largely restricted to the western and central regions of Europe.",
    "distribution_introduced_art_desc": "Acer campestre f. oblongifolium was mainly introduced to ornamental horticulture and landscaping due to its unique leaf shape and adaptability to various soil conditions. It is commonly found in gardens and urban environments where its compact size and seasonal color changes make it a desirable specimen. This variety is particularly valued for its tolerance to pollution and urban stress, making it suitable for cityscapes. It has also been used in ecological restoration projects to stabilize soil and provide habitat for local wildlife. However, its introduction has raised concerns about its potential to become invasive in certain regions."
}
