{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bodinieri var. convexum",
    "plant_slug": "acer-bodinieri-var-convexum",
    "plant_name_scientific": "acer bodinieri var. convexum",
    "intro": "Acer bodinieri var. convexum, commonly known as the convex-leaf maple, is a deciduous tree native to China. It is characterized by its distinctive, deeply lobed leaves that are thick and leathery, with a convex shape on the upper surface. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. Its bark is smooth and grayish-brown, becoming fissured with age. This species is often cultivated for its ornamental value due to its unique foliage and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bodinieri var. convexum is primarily native to the mountainous regions of southern China, particularly in the provinces of Sichuan and Yunnan. This variety of maple thrives in humid, temperate climates at elevations ranging from 1,500 to 3,000 meters. It is commonly found in forested areas and along stream banks, where it benefits from moist, well-drained soil. The plant is well adapted to the cool, shaded conditions of its natural habitat. Its native distribution is closely associated with the biodiversity-rich ecosystems of the eastern Himalayas.",
    "distribution_introduced_art_desc": "Acer bodinieri var. convexum was mainly introduced to urban and suburban landscapes in North America as an ornamental tree due to its unique, contorted trunk and vibrant fall color. It is commonly planted in parks, along streets, and in private gardens for its aesthetic appeal. The variety is known for its slow growth and ability to thrive in a variety of soil conditions, making it a popular choice for landscaping. However, it is considered an invasive species in some regions due to its rapid spread and competition with native plants. Despite its ornamental value, its ecological impact has raised concerns among environmentalists and horticulturists."
}
