{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens",
    "plant_slug": "acer-cinerascens",
    "plant_name_scientific": "acer cinerascens",
    "intro": "Acer cinerascens, commonly known as the smoke maple, is a deciduous tree native to the eastern United States. It is characterized by its distinctive, finely divided, feathery leaves that turn a striking red or orange in the fall. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. It typically grows in moist, well-drained soils and thrives in full to partial sunlight. The smoke maple is valued for its ornamental appeal and is often used in landscaping for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens is primarily native to the southeastern United States, specifically the Appalachian region. It is found in states such as Tennessee, North Carolina, South Carolina, and Georgia. This species thrives in moist, well-drained soils along streams and in forested areas. It is commonly associated with mixed hardwood forests and often grows in shaded or semi-shaded environments. The plant is known for its distinctive grayish-brown bark and is a valuable component of local ecosystems.",
    "distribution_introduced_art_desc": "Acer cinerascens was mainly introduced to North America, particularly in the eastern United States, as an ornamental tree due to its attractive autumn foliage. It has been cultivated in gardens and parks for its aesthetic value, especially in regions with temperate climates. Despite its ornamental appeal, it is considered an invasive species in some areas where it outcompetes native vegetation. Its spread has been facilitated by its ability to thrive in a variety of soil types and its rapid growth rate. However, its introduction has raised concerns among ecologists regarding its impact on local ecosystems."
}
