{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. wilsonii",
    "plant_slug": "acer-campbellii-subsp-wilsonii",
    "plant_name_scientific": "acer campbellii subsp. wilsonii",
    "intro": "Acer campbellii subsp. wilsonii, commonly known as Wilson's maple, is a deciduous tree native to the mountainous regions of China. It is characterized by its distinctive palmate leaves, which are typically five-lobed and have a bright green upper surface. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. It thrives in cool, moist climates and is often found in forested areas at higher elevations. Due to its ornamental value, it is cultivated in gardens and botanical collections around the world.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. wilsonii is primarily native to the mountainous regions of central China, specifically in the Sichuan and Yunnan provinces. This subspecies is found in high-altitude areas with cool, moist climates, typically growing in forested landscapes. It thrives in well-drained soils and is often associated with mixed coniferous and broadleaf forests. The plant is adapted to the unique ecological conditions of its native habitat, which includes significant variations in temperature and precipitation. Due to its restricted distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. wilsonii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in areas with moist, well-drained soils and partial to full shade. This subspecies is often planted in gardens and landscapes for its ornamental value. It has been introduced to various regions beyond its native range, including parts of Europe and Australia. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
