{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer angustilobum var. sichourense",
    "plant_slug": "acer-angustilobum-var-sichourense",
    "plant_name_scientific": "acer angustilobum var. sichourense",
    "intro": "Acer angustilobum var. sichourense, commonly known as the Sichuan maple, is a variant of the narrow-leaf maple native to China. It is characterized by its distinctive palmate leaves with five to seven lobes, which are typically dark green on top and lighter underneath. The plant produces small, yellowish-green flowers in early spring, followed by red to orange-red samaras in the fall. It thrives in temperate climates and is often found in mountainous regions with well-drained soils. This species is valued for its ornamental appeal and ecological role in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer angustilobum var. sichourense is primarily native to China, specifically the provinces of Sichuan and Yunnan. This variant of the narrow-leaf maple is found in the mountainous regions of these areas. It thrives in temperate climates with high elevation and is often associated with mixed forests. The plant is adapted to the unique environmental conditions of its native habitat. It is an important component of the local flora and is sometimes used in traditional landscaping.",
    "distribution_introduced_art_desc": "Acer angustilobum var. sichourense was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and adaptability to various soil conditions. It is commonly found in gardens and landscaped areas, particularly in regions with temperate climates. This variety is valued for its striking autumn coloration, which ranges from yellow to red, making it a popular choice among horticulturists. However, it requires well-drained soil and full sun to thrive, limiting its natural range. Despite its ornamental appeal, it is not widely naturalized in the wild."
}
