{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum var. sinuosum",
    "plant_slug": "acer-barbatum-var-sinuosum",
    "plant_name_scientific": "acer barbatum var. sinuosum",
    "intro": "Acer barbatum var. sinuosum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its delicate, palmate leaves that turn vibrant shades of red and orange in the fall. The plant typically grows to a height of 6 to 15 meters, with a rounded crown and smooth, gray bark. Its flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring. The species thrives in partial shade and well-drained soil, making it a popular ornamental plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum var. sinuosum is primarily native to the mountainous regions of eastern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. This species thrives in temperate to subtropical climates at high altitudes, often found in forests and rocky areas. It is commonly associated with humid and cool environments, growing in the shade of larger trees. The plant is well adapted to the specific ecological conditions of these regions, including well-drained soils and moderate rainfall. Its native distribution is limited to these specific geographic areas, making it a regionally significant species in the flora of southern China.",
    "distribution_introduced_art_desc": "Acer barbatum var. sinuosum was mainly introduced to the eastern United States as an ornamental plant due to its attractive foliage and unique leaf shape. It is commonly found in gardens and landscaped areas, particularly in regions with moist, well-drained soil. This variety is valued for its autumn color, which ranges from yellow to red, making it a popular choice for landscape design. However, it is considered an invasive species in some areas, where it can outcompete native vegetation. Its introduction has led to ecological concerns, prompting efforts to control its spread in natural habitats."
}
