{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. amplum",
    "plant_slug": "acer-cappadocicum-subsp-amplum",
    "plant_name_scientific": "acer cappadocicum subsp. amplum",
    "intro": "Acer cappadocicum subsp. amplum, commonly known as the large-leaf maple, is a deciduous tree native to the eastern United States. It is characterized by its broad, palmately lobed leaves that turn vibrant shades of yellow and red in autumn. The tree produces small, clustered green flowers in early spring, followed by winged samaras as its fruit. It typically grows to a height of 15–30 meters and prefers well-drained soils in full sun to partial shade. This species is valued for its ornamental appeal and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. amplum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. It is also found in areas of northern Israel and southern Jordan. This species grows in rocky and mountainous habitats, often in dry and temperate climates. It is commonly associated with limestone soils and can be found in woodlands and shrublands. Its native range extends into parts of Greece and the Caucasus region as well.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. amplum was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of eastern North America. It thrives in full sun to partial shade and is often found in forested landscapes. This subspecies is known for its distinctive palmate leaves and vibrant fall coloration, making it a popular ornamental plant. It has been widely cultivated for its aesthetic value and adaptability to various garden conditions. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
