{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. heterophyllum",
    "plant_slug": "acer-dasycarpum-f-heterophyllum",
    "plant_name_scientific": "acer dasycarpum f. heterophyllum",
    "intro": "Acer dasycarpum f. heterophyllum, commonly known as the Japanese maple with variegated leaves, is a unique cultivar of the maple tree. It is characterized by its striking foliage, which features a mix of green, yellow, and white variegation. The plant is native to Japan and is prized for its ornamental value in gardens and landscapes. It typically grows as a small to medium-sized tree or shrub, reaching heights of up to 6 meters. Its leaves are palmately lobed and turn vibrant colors in the fall, making it a popular choice for ornamental horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. heterophyllum is primarily native to the mountainous regions of eastern Tibet and western Sichuan in China. This plant thrives in high-altitude environments, typically found in forested areas at elevations ranging from 2,500 to 4,000 meters. It is commonly associated with mixed coniferous and broadleaf forests, often growing in shaded, moist conditions. The species is well adapted to the cold and rugged terrain of these regions. Due to its restricted habitat, it is considered a rare and localized plant in its native range.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. heterophyllum was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and adaptability to temperate climates. It was first documented in the late 19th century in botanical gardens and arboretums across the region. The introduction of this plant has led to its cultivation in urban landscapes and private gardens, where it is valued for its aesthetic appeal. Despite its ornamental use, it has not become invasive in the wild, remaining largely confined to cultivated areas. Its distribution is limited to regions with suitable soil and climate conditions, making it a popular choice for landscape design."
}
