{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subvar. molle",
    "plant_slug": "acer-campestre-subvar-molle",
    "plant_name_scientific": "acer campestre subvar. molle",
    "intro": "Acer campestre subvar. molle, commonly known as the soft-leaved hedge maple, is a variant of the common maple native to Europe and parts of western Asia. It is characterized by its smooth, often pubescent leaves that are typically oval to elliptic in shape. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras that aid in seed dispersal. It thrives in a variety of soil types and is often used in horticulture for its ornamental value and hardiness. This subspecies is well-suited for hedging and as a landscape plant due to its compact growth habit and adaptability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre subvar. molle is primarily native to southern Europe, including countries such as Spain, Portugal, and parts of southern France. It is also found in North Africa, particularly in regions like Morocco and Algeria. This subvariety thrives in Mediterranean climates characterized by mild, wet winters and hot, dry summers. It typically grows in open woodlands, rocky slopes, and along streambanks. Its distribution is closely associated with areas that have well-drained soils and moderate to high sunlight exposure.",
    "distribution_introduced_art_desc": "Acer campestre subvar. molle was mainly introduced to urban and suburban landscapes due to its adaptability to a variety of soil types and its ability to thrive in partial shade. It is often used as a ornamental tree because of its attractive yellow fall color and compact size. This plant has been popular in landscaping for its tolerance to pollution and urban conditions. However, it can become invasive in some regions if not properly managed. Its distribution is primarily limited to areas where it has been intentionally planted."
}
