{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. monstrosum",
    "plant_slug": "acer-dasycarpum-f-monstrosum",
    "plant_name_scientific": "acer dasycarpum f. monstrosum",
    "intro": "Acer dasycarpum f. monstrosum, commonly known as the giant maple, is a unique variant of the species with strikingly large, palmate leaves that can reach up to 30 cm in diameter. It is a deciduous tree characterized by its upright growth habit and robust, sturdy branches. The leaves are typically a vibrant green during the growing season, turning yellow in the autumn. This cultivar is prized for its ornamental value and is often used in gardens and parks for its dramatic visual impact. It thrives in well-drained soil and full sun, requiring moderate water and pruning to maintain its shape.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. monstrosum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. This plant thrives in temperate climates with high altitudes and cool, moist conditions. It is commonly found in forested areas and along stream sides in these regions. The species is adapted to rocky and well-drained soils, which are typical of its native habitat. Its natural range is limited to specific elevations, usually between 1,500 and 3,000 meters above sea level.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. monstrosum was mainly introduced to regions with temperate climates that provide adequate moisture and well-drained soil. This plant is commonly found in urban and suburban landscapes due to its ornamental value and adaptability. It is often used in landscaping for its vibrant fall color and unique foliage structure. The introduction of this species has been driven by its aesthetic appeal and ease of cultivation. However, its spread outside native habitats requires careful management to prevent potential ecological impacts."
}
