{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. variegatum",
    "plant_slug": "acer-campestre-var-variegatum",
    "plant_name_scientific": "acer campestre var. variegatum",
    "intro": "Acer campestre var. variegatum, commonly known as the variegated field maple, is a deciduous shrub or small tree native to Europe. It is characterized by its distinctive foliage, featuring white to cream-colored veins and margins on its heart-shaped leaves. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in well-drained soils and partial shade, often found in woodland edges and hedgerows. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. variegatum is primarily native to parts of Europe, including the British Isles, France, Germany, and Scandinavia. It is commonly found in woodlands, hedgerows, and other moist, well-drained soils. This variety is known for its distinctive variegated leaves, which add visual interest to the landscape. It thrives in temperate climates and is often used in horticulture for its ornamental value. The plant is also occasionally found in parts of northern Africa and the Middle East.",
    "distribution_introduced_art_desc": "Acer campestre var. variegatum was mainly introduced to ornamental horticulture due to its attractive variegated leaves. It is commonly used in landscaping for its aesthetic value and adaptability to various soil conditions. This variety is favored for its compact growth habit and ability to thrive in urban environments. However, it has also been noted to spread aggressively in some regions, posing a potential threat to native plant communities. Its introduction has led to increased interest in managing its growth to prevent ecological disruption."
}
