{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. molle",
    "plant_slug": "acer-campestre-var-molle",
    "plant_name_scientific": "acer campestre var. molle",
    "intro": "Acer campestre var. molle, commonly known as the soft-leaved maple, is a deciduous shrub or small tree native to Europe and western Asia. It is characterized by its smooth, often grayish bark and opposite, palmately lobed leaves that turn yellow in autumn. The plant produces small, red to orange-red flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and full to partial sunlight, making it a popular choice for hedging and ornamental planting. Its compact growth habit and seasonal color changes contribute to its aesthetic value in gardens and natural landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "[WRONG START] Acer campestre var. molie is primarily native to southern Europe, including parts of Spain, Portugal, Italy, and the Balkans. It is also found in North Africa, particularly in countries such as Morocco and Algeria. This variety thrives in temperate climates and is commonly found in woodland edges, hedgerows, and rocky soils. It is well adapted to limestone-rich environments and can tolerate partial shade. Its distribution reflects its historical presence in the Mediterranean region and surrounding areas.",
    "distribution_introduced_art_desc": "Acer campestre var. molle was mainly introduced to the Pacific Northwest of the United States. It was brought in during the late 19th and early 20th centuries as part of ornamental plant introductions. This variety is known for its unique, mounding growth habit and attractive foliage. It has been widely planted in urban and suburban landscapes due to its hardiness and adaptability. However, it is considered an invasive species in some regions, outcompeting native vegetation."
}
