{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bosniacum",
    "plant_slug": "acer-bosniacum",
    "plant_name_scientific": "acer bosniacum",
    "intro": "Acer bosniacum, commonly known as the Bosnian maple, is a deciduous tree native to the mountains of Bosnia and Herzegovina. It typically grows to a height of 5–10 meters and has a rounded crown with slender, branching limbs. The leaves are palmately lobed, with five to seven pointed lobes, and turn vibrant shades of red and orange in autumn. It produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. This species is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bosniacum is primarily native to the mountainous regions of the Balkans, including parts of Bosnia and Herzegovina, Serbia, Croatia, and Montenegro. It thrives in alpine and subalpine environments, typically at elevations between 1,500 and 2,500 meters. This species is commonly found in rocky soils and open forested areas, often growing in association with other cold-climate tree species. Its distribution is limited to a relatively small geographic range, making it a rare and localized species. Due to its specific habitat requirements, Acer bosniacum is considered an endemic plant of the Eastern Alps and adjacent mountain ranges.",
    "distribution_introduced_art_desc": "Acer bosniacum was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in temperate forest environments. It thrives in regions with cool summers and cold winters, making it suitable for higher elevation areas. This plant is often found in mountainous regions of Europe, particularly in the Balkans and the Carpathian Mountains. Its introduction to new habitats has been limited due to its specific ecological requirements. However, it has shown adaptability in some cultivated settings where conditions are carefully managed."
}
