{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum",
    "plant_slug": "acer-dasycarpum",
    "plant_name_scientific": "acer dasycarpum",
    "intro": "Acer dasycarpum, commonly known as the Mongolian maple, is a deciduous tree native to the mountainous regions of central Asia. It is characterized by its distinctive palmate leaves that are deeply lobed and turn vibrant yellow in the fall. The tree produces small, clustered green flowers in the spring, followed by red-brown samaras that are winged and dispersed by the wind. It typically grows to a height of 10–15 meters and has a rounded, symmetrical crown. The bark is smooth and grayish-brown, becoming fissured with age, and the wood is valued for its strength and durability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum is primarily native to the mountainous regions of central and eastern China, including the provinces of Sichuan, Yunnan, and Hubei. It thrives in cool, temperate climates at elevations ranging from 1,500 to 3,500 meters above sea level. This species is commonly found in forests and rocky slopes, where it forms part of the understory vegetation. It is also present in parts of northern Vietnam and southern Tibet. The plant is well adapted to the humid and often misty conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acer dasycarpum was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and adaptability to temperate climates. It has been widely planted in urban and suburban landscapes for its aesthetic appeal and ability to thrive in various soil conditions. The distribution of this species has expanded beyond its native range in Asia, particularly in regions with mild winters and adequate rainfall. However, its introduction has raised concerns about potential ecological impacts on native plant communities. Despite these concerns, it remains a popular choice for landscaping in many parts of North America."
}
