{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. microcarpon",
    "plant_slug": "acer-campestre-f-microcarpon",
    "plant_name_scientific": "acer campestre f. microcarpon",
    "intro": "Acer campestre f. microcarpon, commonly known as the dwarf maple, is a compact, shrub-like form of the common maple. It features small, ovate leaves with a serrated margin and a vibrant green color that turns red in autumn. The plant produces small, red samaras that are dispersed by wind. It thrives in well-drained soil and partial shade, making it suitable for rock gardens or as a hedging plant. Its ornamental value lies in its dense foliage and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. microcarpon is primarily native to southern and central Europe, including regions such as France, Spain, Italy, and parts of the Balkans. This subspecies is commonly found in woodland edges, open forests, and rocky slopes. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed deciduous forests and can be found in both urban and rural landscapes. Its distribution reflects its adaptability to a variety of environmental conditions within its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. microcarpon was mainly introduced to enhance landscape diversity and provide ornamental value in urban and suburban settings. It is commonly used in parks, gardens, and along roadsides due to its compact size and adaptability to various soil conditions. This form is favored for its dense foliage and resistance to urban stressors such as pollution and compacted soils. Its introduction has helped in creating low-maintenance green spaces in developed areas. However, it is important to monitor its spread to prevent potential ecological impacts in natural habitats."
}
