{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum var. trinerve",
    "plant_slug": "acer-buergerianum-var-trinerve",
    "plant_name_scientific": "acer buergerianum var. trinerve",
    "intro": "Acer buergerianum var. trinerve, commonly known as the Japanese maple with three nerves, is a deciduous tree native to Japan. It is characterized by its finely dissected, trifoliate leaves that give it a delicate, lace-like appearance. The plant typically grows to a height of 4–8 meters and has a rounded, spreading crown. Its foliage changes color throughout the seasons, displaying shades of green, red, and orange in autumn. The tree is valued in horticulture for its ornamental beauty and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum var. trinerve is primarily native to the mountainous regions of eastern China, specifically in the provinces of Zhejiang, Jiangxi, and Fujian. This variety is also found in parts of southern Korea and northern Vietnam. It thrives in cool, humid climates and is commonly found in forested areas at elevations ranging from 500 to 1,500 meters. The plant is well adapted to rocky and well-drained soils, often growing in shaded or semi-shaded environments. Its native distribution is closely associated with the temperate forests of East Asia.",
    "distribution_introduced_art_desc": "Acer buergerianum var. trinerve was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forest understories and along stream banks. This variety is valued for its ornamental value, including its distinctive trifoliate leaves and vibrant fall coloration. It has been cultivated in both private and public landscapes for its aesthetic appeal. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
