{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum var. convexum",
    "plant_slug": "acer-amplum-var-convexum",
    "plant_name_scientific": "acer amplum var. convexum",
    "intro": "Acer amplum var. convexum, commonly known as the convex-leaf maple, is a variant of the European maple characterized by its distinctive, thickened, and often warty leaf margins. It is native to parts of Europe and western Asia, where it typically grows in moist, shady environments such as woodlands and stream banks. The plant produces small, yellow-green flowers in early spring, followed by winged seeds that are dispersed by wind. Its leaves are usually palmately lobed, with a rough, textured surface that distinguishes it from other maple species. This variety is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum var. convexum is primarily native to the mountainous regions of central and eastern Europe, including parts of the Carpathian Mountains and the Balkans. This variety of the horse chestnut is typically found in temperate climates with well-drained soils. It thrives in areas with moderate rainfall and is often associated with mixed forests and open woodlands. The plant is known for its distinctive convex-shaped nuts and is adapted to withstand colder winters. Its native range extends across several countries in Europe, including Romania, Hungary, and Serbia.",
    "distribution_introduced_art_desc": "Acer amplum var. convexum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in riparian zones and along stream banks. This variety is known for its distinctive convex leaf shape and vibrant autumn coloration. It has been introduced to several regions in the northeastern United States and parts of Canada. Due to its ornamental value, it is often cultivated in gardens and landscaping projects."
}
