{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. vulgare",
    "plant_slug": "acer-campestre-var-vulgare",
    "plant_name_scientific": "acer campestre var. vulgare",
    "intro": "Acer campestre var. vulgare, commonly known as the field maple, is a deciduous tree native to Europe and parts of western Asia. It typically grows to a height of 8–12 meters, featuring a rounded crown and smooth, grey bark. The leaves are palmately lobed, with five to seven pointed lobes, and turn vibrant shades of yellow and red in autumn. It produces small, yellowish flowers in early spring, followed by winged samaras that disperse its seeds. This species is often found in open woodlands and along riverbanks, where it thrives in moist, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. vulgare is primarily native to Europe, including parts of the British Isles, Scandinavia, and Central Europe. It is commonly found in woodlands, hedgerows, and along roadsides. This variety of the common maple is well adapted to a range of soil types and can thrive in both full sun and partial shade. It is often used in landscaping due to its ornamental value and hardiness. The plant is also known for its ability to tolerate urban environments, making it a popular choice in cities.",
    "distribution_introduced_art_desc": "Acer campestre var. vulgare was mainly introduced to North America, particularly in the eastern United States, as a ornamental tree due to its attractive fall color and hardy nature. It has been widely planted in urban and suburban landscapes for its adaptability to various soil types and its ability to thrive in partial shade. Despite its ornamental value, it has also become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant's rapid spread is attributed to its prolific seed production and ability to establish itself in disturbed habitats. Its introduction has raised concerns among ecologists regarding its impact on native plant communities and biodiversity."
}
