{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. hederifolium",
    "plant_slug": "acer-campestre-var-hederifolium",
    "plant_name_scientific": "acer campestre var. hederifolium",
    "intro": "Acer campestre var. hederifolium, commonly known as the creeping maple, is a compact shrub or small tree native to Europe and western Asia. It is characterized by its distinctive heart-shaped, lobed leaves that are often larger and more pronounced than those of the typical maple. The plant produces small, red or orange-red flowers in early spring, followed by winged seeds that are dispersed by the wind. It thrives in well-drained soils and is often used in landscaping for its ornamental value and adaptability. This variety is particularly valued for its ability to form dense ground cover and its tolerance to urban environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. hederifolium is primarily native to western and central Europe, including countries such as France, Germany, Italy, and the British Isles. It thrives in temperate climates and is commonly found in woodlands, hedgerows, and along stream banks. This variety is known for its distinctive heart-shaped leaves and is often used in landscaping due to its ornamental value. It prefers well-drained soils and partial to full sun exposure. The plant is also occasionally found in parts of northern Africa and the Middle East.",
    "distribution_introduced_art_desc": "Acer campestre var. hederifolium was mainly introduced to Europe and North America as an ornamental plant due to its attractive, heart-shaped leaves and adaptability to various soil conditions. It is commonly found in urban and suburban landscapes, where it is valued for its aesthetic appeal and hardiness. This variety is often used in landscaping for its ability to thrive in partial shade and its resistance to pests and diseases. Despite its popularity, it has raised concerns about its potential invasiveness in certain regions. Its distribution highlights the balance between ecological impact and horticultural value in introduced plant species."
}
