{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. albovariegatum",
    "plant_slug": "acer-campestre-var-albovariegatum",
    "plant_name_scientific": "acer campestre var. albovariegatum",
    "intro": "Acer campestre var. albovariegatum, commonly known as the white-veined maple, is a variant of the field maple characterized by its distinctive white or cream-colored veins on its leaves. It is a deciduous tree or shrub native to Europe, often found in woodland and hedgerow environments. The leaves are typically oval with serrated edges and display a striking contrast between the green foliage and the pale veins. It produces small, red flowers in early spring followed by winged samaras in the fall. This plant is valued for its ornamental appeal and is often used in landscaping for its unique leaf patterns.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. albovariegatum is primarily native to parts of Europe, particularly in the British Isles, including Great Britain and Ireland. This variety of the common horse chestnut is also found in regions of northern France and southern Germany. It thrives in temperate climates and is often associated with woodland edges and open landscapes. The plant is known for its distinctive variegated leaves, which give it ornamental value. Its native range reflects its adaptation to the mild, moist conditions of these regions.",
    "distribution_introduced_art_desc": "Acer campestre var. albovariegatum was mainly introduced to ornamental horticulture due to its attractive variegated foliage. It is commonly found in gardens and landscaped areas where its unique leaf patterns provide visual interest. The plant is valued for its adaptability to various soil types and its ability to thrive in urban environments. However, it is considered a non-native species in many regions, raising concerns about its potential impact on local ecosystems. Its introduction has led to its cultivation in several parts of Europe and North America."
}
