{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbinerve f. glabrescens",
    "plant_slug": "acer-barbinerve-f-glabrescens",
    "plant_name_scientific": "acer barbinerve f. glabrescens",
    "intro": "Acer barbinerve f. glabrescens, commonly known as the smooth-veined maple, is a variant of the barbinerve maple, characterized by its smooth, glabrous leaf surfaces. It belongs to the genus Acer, which includes various maple species known for their ornamental value. The leaves are typically palmately lobed with fine, parallel veins, giving the plant a distinctive appearance. It thrives in temperate climates and is often cultivated for its aesthetic appeal in gardens. This form is less common than the typical barbinerve maple, making it a sought-after specimen among horticulturists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbinerve f. glabrescens is primarily native to the southeastern United States, including parts of Georgia, South Carolina, and Florida. This species is commonly found in moist, well-drained soils along stream banks and in forested areas. It thrives in humid climates and is often associated with riparian habitats. The plant is known for its distinctive leaf morphology, featuring finely serrated edges and a smooth texture. It is a valued ornamental tree due to its vibrant fall color and adaptability to various environmental conditions.",
    "distribution_introduced_art_desc": "Acer barbinerve f. glabrescens was mainly introduced to North America as an ornamental plant due to its attractive foliage and unique leaf characteristics. It is commonly found in gardens and landscaped areas, particularly in the eastern United States. The distribution of this plant has expanded beyond its native range, leading to its presence in various regions where it is cultivated for aesthetic purposes. Despite its introduction, it does not typically naturalize in the wild and is primarily confined to human-modified environments. Its spread is largely limited by its preference for specific growing conditions and limited seed dispersal mechanisms."
}
