{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer capillipes",
    "plant_slug": "acer-capillipes",
    "plant_name_scientific": "acer capillipes",
    "intro": "Acer capillipes, commonly known as the slender maple, is a deciduous tree native to China. It is characterized by its finely toothed, ovate leaves that turn vibrant shades of red and yellow in autumn. The tree produces small, yellowish-green flowers in early spring, followed by samaras with winged seeds. It typically grows to a height of 10–15 meters and prefers well-drained soils in full sun. Its ornamental value makes it a popular choice for gardens and parks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer capillipes"
    },
    "taxonomy_art_desc": "Acer capillipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Sapindales, which consists of flowering plants with often showy flowers and includes families such as Sapindaceae and Rutaceae. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees, shrubs, and climbers with diverse leaf and flower forms. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer capillipes, a specific type of maple native to China, characterized by its slender leaves and preference for moist, shady environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer capillipes is primarily native to Japan. It is found in various regions across the country, including Honshu, Shikoku, and Kyushu. This species typically grows in moist, shaded environments such as mountain forests and streamside areas. It is a small to medium-sized tree known for its distinctive leaf structure. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acer capillipes was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It thrives in environments where it can receive adequate water without becoming waterlogged. This plant is often found in woodland edges, stream banks, and disturbed sites. Its introduction has been noted in several regions outside its native range, including parts of North America. Due to its adaptability, it has become a common ornamental species in horticulture."
}
