{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cordatum",
    "plant_slug": "acer-cordatum",
    "plant_name_scientific": "acer cordatum",
    "intro": "Acer cordatum, commonly known as the heartleaf maple, is a deciduous tree native to the eastern United States. It is characterized by its distinctive heart-shaped leaves that turn vibrant shades of red and yellow in the fall. The plant belongs to the Sapindaceae family and is known for its elegant, slender form. It typically grows to a height of 10 to 20 meters and prefers moist, well-drained soils. Its ornamental value makes it a popular choice for gardens and parks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer cordatum"
    },
    "taxonomy_art_desc": "Acer cordatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Sapindales, a group of flowering plants that includes families such as Sapindaceae and Rutaceae. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with diverse leaf and fruit structures. Its genus is Acer, which consists of deciduous trees and shrubs commonly known as maples, characterized by their opposite leaves and winged seeds. Its species is Acer cordatum, a specific type of maple known for its heart-shaped leaves and is native to eastern North America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Hainan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cordatum is primarily native to China South-Central, China Southeast, and Hainan. This species is commonly found in the mountainous regions of these areas. It thrives in temperate climates with well-drained soil. The plant is often associated with forest understories and rocky slopes. Its natural distribution reflects its adaptability to diverse ecological conditions within its native range.",
    "distribution_introduced_art_desc": "Acer cordatum was mainly introduced to regions with temperate climates where it can thrive in well-drained soils and partial to full sunlight. It is commonly found in gardens and landscapes due to its ornamental value, featuring heart-shaped leaves and vibrant fall colors. The plant is often cultivated for its aesthetic appeal and ability to adapt to a variety of environmental conditions. However, in some areas, it may become invasive if not properly managed. Its introduction has expanded its natural range beyond its native habitat in eastern North America."
}
