{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens var. paxii",
    "plant_slug": "acer-cinerascens-var-paxii",
    "plant_name_scientific": "acer cinerascens var. paxii",
    "intro": "Acer cinerascens var. paxii, commonly known as the Mexican ash, is a deciduous tree native to Mexico. It is characterized by its smooth, gray bark and heart-shaped leaves that turn yellow in the fall. The plant typically grows in moist, well-drained soils and prefers partial to full shade. It produces small, greenish-yellow flowers in the spring, followed by winged seeds. This species is valued for its ornamental appeal and ability to thrive in urban environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens var. paxii is primarily native to the mountainous regions of southern Mexico, specifically in the states of Oaxaca and Chiapas. This variant of the acer tree thrives in humid, tropical highlands with well-drained soils. It is commonly found in cloud forests and along forest edges at elevations ranging from 1,000 to 2,500 meters. The plant is adapted to the moist and cool climate of these regions, where it often grows as part of the understory vegetation. Due to its limited distribution, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acer cinerascens var. paxii was mainly introduced to the southeastern United States, particularly in areas with moist, acidic soils. It is commonly found in the Appalachian region, where it thrives in shaded to partially shaded environments. This variety is often cultivated in gardens and landscapes for its ornamental value, especially its striking fall color. Its introduction has led to its use in ecological restoration projects due to its ability to stabilize soil and support local wildlife. However, it is important to monitor its spread to prevent potential invasiveness in natural habitats."
}
