{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. palmatum",
    "plant_slug": "acer-dasycarpum-f-palmatum",
    "plant_name_scientific": "acer dasycarpum f. palmatum",
    "intro": "Acer dasycarpum f. palmatum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its vibrant, palmately lobed leaves that change color throughout the seasons. The plant belongs to the Sapindaceae family and is valued for its ornamental qualities in gardens. It typically grows to a height of 6–15 meters and prefers well-drained, acidic soils. Its autumn foliage displays shades of red, orange, and yellow, making it a popular choice for landscape design.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. palmatum is primarily native to the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Jiangxi, and Anhui. This variety is also found in parts of southern Korea and northern Vietnam. It typically grows at elevations ranging from 600 to 1,500 meters above sea level. The plant thrives in temperate climates with well-drained soils and partial shade. It is commonly found in mixed forests and along stream banks in its native habitat.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. palmatum was mainly introduced to urban and garden landscapes in temperate regions due to its ornamental value and adaptability. It is commonly found in public parks, private gardens, and along streets where it provides seasonal color with its vibrant foliage. This variety is favored for its compact growth habit and ability to thrive in a range of soil conditions. Its introduction has enhanced the aesthetic appeal of many landscapes, particularly in North America and Europe. However, it requires proper drainage and protection from extreme weather to ensure long-term health and vigor."
}
