{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. schneiderianum",
    "plant_slug": "acer-campbellii-subsp-schneiderianum",
    "plant_name_scientific": "acer campbellii subsp. schneiderianum",
    "intro": "Acer campbellii subsp. schneiderianum, commonly known as the Campbell's maple, is a rare and striking ornamental tree native to the mountainous regions of China. It is characterized by its distinctive, deeply lobed leaves that turn vibrant shades of red and orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. It prefers cool, moist climates and is often cultivated in gardens for its aesthetic value. Due to its limited natural range, it is considered a rare species in the wild.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. schneiderianum is primarily native to the mountainous regions of northern Vietnam and southern China. It is found in areas with high altitudes, typically between 1,500 and 3,000 meters above sea level. This subspecies thrives in temperate climates with cool summers and cold winters. It is commonly found in forests and rocky habitats. Its native distribution is limited to these specific regions in East Asia.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. schneiderianum was mainly introduced to regions with temperate climates that provide well-drained soils and moderate humidity. It is commonly found in areas with mild winters and cool summers, making it suitable for USDA hardiness zones 6 through 8. This subspecies is often cultivated in gardens and parks for its ornamental value, particularly its vibrant fall foliage. Its introduction has expanded its natural range beyond its native habitat in China. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
