{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. coloratum",
    "plant_slug": "acer-dasycarpum-var-coloratum",
    "plant_name_scientific": "acer dasycarpum var. coloratum",
    "intro": "Acer dasycarpum var. coloratum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its vibrant, colorful foliage that changes with the seasons, ranging from bright green in spring to fiery red, orange, and yellow in autumn. The plant has opposite, palmately compound leaves that are typically oval or elliptical in shape. It produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. This ornamental tree thrives in well-drained soil and partial to full sunlight, making it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. coloratum is primarily native to China, specifically the provinces of Zhejiang, Fujian, and Anhui. It grows in mountainous regions at elevations ranging from 500 to 1,500 meters. This variety is commonly found in humid, subtropical climates with well-drained soil. It is often associated with mixed evergreen and deciduous forests. The plant is known for its ornamental value due to its striking foliage and is sometimes cultivated in gardens.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. coloratum was mainly introduced to regions with temperate climates that provide adequate sunlight and well-drained soil. It is often cultivated in gardens and parks for its ornamental value, particularly its vibrant autumn foliage. This variety is favored for its compact size and ability to thrive in a range of soil types. It has been introduced to parts of Europe and North America, where it is used in landscaping and as a decorative plant. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
