{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subsp. marsicum",
    "plant_slug": "acer-campestre-subsp-marsicum",
    "plant_name_scientific": "acer campestre subsp. marsicum",
    "intro": "Acer campestre subsp. marsicum, commonly known as the Marsic maple, is a small to medium-sized deciduous tree native to parts of Europe and western Asia. It is characterized by its palmately lobed leaves, which are typically green on top and pale underneath, turning vibrant shades of red and orange in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and full sun to partial shade, making it a versatile choice for landscaping. Due to its ornamental value and adaptability, it is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campestre"
    },
    "taxonomy_art_desc": "Acer campestre subsp. marsicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Sapindales, which consists of flowering plants that typically have simple leaves and showy flowers, many of which are used for ornamental or medicinal purposes. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with fruits that often contain toxic compounds. Its genus is Acer, which refers to the maple trees, known for their distinctive leaves and colorful autumn foliage. Its species is Acer campestre, commonly known as the field maple, a small tree or shrub native to Europe, characterized by its rounded leaves and yellowish flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hungary",
        "NW. Balkan Pen.",
        "Romania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre subsp. marsicum is primarily native to Hungary, NW. Balkan Pen., and Romania. This subspecies is found in regions characterized by temperate climates and diverse forested landscapes. It typically grows in woodland areas, along forest edges, and in open habitats with well-drained soils. The plant is well adapted to the environmental conditions of these regions, including variations in temperature and precipitation. Its distribution reflects its ecological preferences and historical range expansion across Central and Eastern Europe.",
    "distribution_introduced_art_desc": "Acer campestre subsp. marsicum was mainly introduced to Europe, particularly in the Mediterranean region, as an ornamental plant due to its attractive autumn foliage and compact growth habit. It has been widely cultivated in gardens and urban landscapes for its aesthetic value. Despite its ornamental appeal, it has shown some invasive tendencies in certain areas, outcompeting native species in local ecosystems. Its introduction has led to concerns about its ecological impact, especially in regions with similar environmental conditions to its native habitat. However, it remains a popular choice for landscaping due to its hardiness and adaptability."
}
