{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cordatum var. subtrinervium",
    "plant_slug": "acer-cordatum-var-subtrinervium",
    "plant_name_scientific": "acer cordatum var. subtrinervium",
    "intro": "Acer cordatum var. subtrinervium, commonly known as the three-veined heartleaf maple, is a variant of the heart-shaped maple species. It is native to the mountainous regions of eastern China, particularly in Sichuan and Yunnan provinces. The plant is characterized by its distinctive trifoliate leaves, which are often deeply lobed and have a heart-shaped appearance. Its flowers are small and yellow-green, appearing in early spring before the leaves emerge. This species is valued for its ornamental value and is often cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cordatum var. subtrinervium is primarily native to the southeastern United States, specifically the Appalachian Mountains. It is found in regions spanning from Virginia through North Carolina, South Carolina, and Georgia. This variety thrives in moist, well-drained soils along streambanks and in shaded to partially shaded habitats. It is commonly associated with rocky or mountainous terrain where it forms dense thickets. Due to its limited range and specific habitat requirements, it is considered a rare and localized species within its native distribution.",
    "distribution_introduced_art_desc": "Acer cordatum var. subtrinervium was mainly introduced to the southeastern United States, particularly in states like Georgia, Florida, and South Carolina. It was introduced as an ornamental plant due to its attractive foliage and unique leaf patterns. This variety is often cultivated in gardens and parks for its aesthetic value. However, it has also been reported to naturalize in some areas, raising concerns about its potential invasiveness. Its distribution is largely limited to regions with warm, humid climates where it can thrive."
}
