{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer confertifolium",
    "plant_slug": "acer-confertifolium",
    "plant_name_scientific": "acer confertifolium",
    "intro": "Acer confertifolium, commonly known as the Japanese maple, is a deciduous tree native to eastern Asia. It is characterized by its vibrant, often variegated foliage that displays a range of colors throughout the growing season. The plant has opposite, palmately lobed leaves that are typically red or green, with a serrated margin. It produces small, yellowish-green flowers in early spring, followed by red or orange samaras in the autumn. This species thrives in well-drained soil and partial shade, making it a popular ornamental tree in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer confertifolium"
    },
    "taxonomy_art_desc": "Acer confertifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some mosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Sapindales, which consists of flowering plants with diverse forms, including some trees and shrubs. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with showy flowers and often toxic fruits. Its genus is Acer, which includes maple trees known for their distinctive leaves and ornamental value. Its species is Acer confertifolium, a specific type of maple native to North America, characterized by its dense foliage and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer confertifolium is primarily native to Southeast China. It is found in regions such as Yunnan, Sichuan, and Guizhou provinces. This species thrives in mountainous areas with temperate to subtropical climates. It is commonly associated with moist, well-drained soils in forested landscapes. The plant is well adapted to the diverse ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acer confertifolium was mainly introduced to the northeastern United States and parts of Canada as an ornamental tree due to its striking foliage and autumn color. It was popular in landscaping for its unique, broad leaves and its ability to thrive in a variety of soil conditions. However, its introduction has led to concerns about its potential invasiveness in certain regions. Despite its aesthetic appeal, it is now considered a non-native species in many areas where it has spread beyond cultivated settings. Its distribution has been influenced by both intentional planting and natural dispersal mechanisms."
}
