{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. argenteovariegatum",
    "plant_slug": "acer-campestre-f-argenteovariegatum",
    "plant_name_scientific": "acer campestre f. argenteovariegatum",
    "intro": "Acer campestre f. argenteovariegatum, commonly known as the silver-variegated hedge maple, is a cultivated form of the common maple. It is characterized by its distinctive leaves that feature a mix of green, white, and yellow variegation. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are palmately lobed and turn vibrant shades of red and orange in the autumn. This variety is often used in landscaping for its ornamental value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. argenteovariegatum is primarily native to Europe, particularly in the temperate regions of the continent. It is commonly found in countries such as France, Germany, and the United Kingdom. This variety thrives in woodland edges, open areas, and along riverbanks. It is well adapted to a range of soil types and can tolerate partial shade to full sun. Its distinctive variegated leaves make it a popular ornamental plant in gardens and landscapes.",
    "distribution_introduced_art_desc": "Acer campestre f. argenteovariegatum was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive variegated leaves. It is commonly found in temperate regions where it thrives in well-drained soils and full sun to partial shade conditions. This cultivar is often used in urban settings for its ability to tolerate pollution and compacted soils. Its introduction has led to its widespread cultivation in parks, residential areas, and along streets. However, it is important to note that it is not typically invasive in its introduced range."
}
