{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. longipetiolatum",
    "plant_slug": "acer-campestre-f-longipetiolatum",
    "plant_name_scientific": "acer campestre f. longipetiolatum",
    "intro": "Acer campestre f. longipetiolatum, commonly known as the long-petioled field maple, is a variant of the field maple, characterized by its elongated petioles. It is a deciduous tree or shrub native to Europe, often found in woodland edges and open areas. The leaves are typically palmately lobed, with a serrated margin and a green upper surface. It produces small, yellowish-green flowers in early spring, followed by winged samaras. This cultivar is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. longipetiolatum is primarily native to southern and central Europe, including regions such as Italy, France, Spain, and parts of the Balkans. This subspecies is commonly found in woodland areas, hedgerows, and along forest edges. It thrives in temperate climates with well-drained soils. The plant is often associated with limestone-rich habitats and can be found in both natural and cultivated landscapes. Its distribution is relatively localized, with limited occurrences in specific geographic areas.",
    "distribution_introduced_art_desc": "Acer campestre f. longipetiolatum was mainly introduced to ornamental horticulture due to its unique leaf morphology and adaptability to various soil conditions. This cultivar is prized for its elongated petioles and distinctive foliage, making it a popular choice for gardens and landscapes. It has been widely cultivated in temperate regions across Europe and North America. Despite its ornamental value, it is considered an invasive species in some areas where it outcompetes native vegetation. Proper management is recommended to prevent its spread into natural habitats."
}
