{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. pseudomonspessulanum",
    "plant_slug": "acer-campestre-var-pseudomonspessulanum",
    "plant_name_scientific": "acer campestre var. pseudomonspessulanum",
    "intro": "Acer campestre var. pseudomonspessulanum, commonly known as the False Monspessulanum maple, is a variant of the field maple. It is a small to medium-sized deciduous tree or shrub with distinctive lobed leaves that turn vibrant shades of red and orange in autumn. The plant has smooth, greyish-brown bark that becomes fissured with age. It thrives in well-drained soils and is often found in woodland edges or open areas. This variety is valued for its ornamental qualities and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. pseudomonspessulanum is primarily native to southern and central Europe, including countries such as France, Italy, Spain, and parts of the Balkans. This variety is commonly found in mountainous regions and forested areas, where it thrives in well-drained soils. It is often associated with limestone and calcareous substrates, which support its growth in these specific habitats. The plant is also present in some parts of northern Africa, extending its native range into the Mediterranean region. Due to its adaptability, it can occasionally be found in mixed woodlands and along forest edges.",
    "distribution_introduced_art_desc": "Acer campestre var. pseudomonspessulanum was mainly introduced to ornamental horticulture and urban landscaping due to its compact size and attractive fall color. It is often used in gardens and parks where space is limited. This variety is favored for its ability to thrive in a range of soil conditions and its resistance to common diseases. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its introduction has led to ecological concerns in areas where it has escaped cultivation."
}
