{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. lobelii",
    "plant_slug": "acer-cappadocicum-subsp-lobelii",
    "plant_name_scientific": "acer cappadocicum subsp. lobelii",
    "intro": "Acer cappadocicum subsp. lobelii, commonly known as the Cappadocian maple, is a deciduous tree native to Turkey. It is characterized by its distinctive palmate leaves, which are typically 5-7 lobes and turn vibrant red in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and prefers full sun to partial shade. This subspecies is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. lobelii is primarily native to the eastern United States, specifically the Appalachian Mountains. This subspecies is found in regions of Tennessee, Virginia, and North Carolina. It thrives in moist, well-drained soils along streams and in rocky habitats. The plant is commonly associated with forested areas and is often found in mixed hardwood forests. Its native range is limited, making it a relatively rare and localized species.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. lobelii was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and autumn color. It is commonly found in gardens and landscaped areas, particularly in regions with temperate climates. The plant thrives in well-drained soils and full sun, making it adaptable to various garden settings. However, it is considered invasive in some areas, outcompeting native species and altering local ecosystems. Its introduction has raised concerns among conservationists regarding its ecological impact."
}
