{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer confertifolium var. serrulatum",
    "plant_slug": "acer-confertifolium-var-serrulatum",
    "plant_name_scientific": "acer confertifolium var. serrulatum",
    "intro": "Acer confertifolium var. serrulatum, commonly known as the serrulate maple, is a deciduous tree native to the eastern United States. It is characterized by its broad, palmately lobed leaves that turn vibrant shades of red and orange in autumn. The tree produces small, greenish-yellow flowers in early spring, followed by winged seeds that are dispersed by the wind. It typically grows in moist, well-drained soils and thrives in partial to full shade. Its ornamental value makes it a popular choice for landscape planting in temperate regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer confertifolium var. serrulatum is primarily native to the mountainous regions of eastern Asia, particularly in China, Korea, and Japan. It is commonly found in temperate forests and rocky slopes at elevations ranging from 1,000 to 3,000 meters. This variety is known for its distinctive serrated leaf margins and is often associated with humid, cool climates. It thrives in well-drained soils and is often part of the understory vegetation in mixed deciduous forests. Due to its limited distribution, it is considered a rare and ecologically significant species in its native range.",
    "distribution_introduced_art_desc": "Acer confertifolium var. serrulatum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forests and streamside habitats. This variety is valued for its distinctive serrated leaf margins and vibrant fall coloration. It has been cultivated for ornamental purposes due to its aesthetic appeal. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
