{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer coptophyllum",
    "plant_slug": "acer-coptophyllum",
    "plant_name_scientific": "acer coptophyllum",
    "intro": "Acer coptophyllum, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its ornamental foliage, which displays vibrant colors during the growing season and in autumn. The plant has opposite, palmately compound leaves that are typically red or green, depending on the variety. It produces small, yellowish-green flowers in spring, followed by samaroid fruits. Acer coptophyllum thrives in well-drained soils and partial shade, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer coptophyllum is primarily native to the mountainous regions of central and eastern China, specifically in the provinces of Sichuan, Yunnan, and Guizhou. It thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,000 meters above sea level. This species is commonly found in forested areas, often growing on rocky slopes or in mountain valleys. It is a deciduous tree known for its distinctive palmate leaves and is part of the maple family, Aceraceae. Due to its limited range, Acer coptophyllum is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acer coptophyllum was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in full sun to partial shade. It is commonly found in regions with moderate rainfall and cool summers, making it suitable for cultivation in gardens and landscaped areas. This plant is often used as an ornamental species due to its attractive foliage and adaptability to various soil types. Its introduction has expanded its range beyond its native habitat, contributing to ecological diversity in new environments. However, it is important to monitor its spread to prevent potential impacts on local ecosystems."
}
