{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subsp. campestre",
    "plant_slug": "acer-campestre-subsp-campestre",
    "plant_name_scientific": "acer campestre subsp. campestre",
    "intro": "Acer campestre subsp. campestre, commonly known as the field maple, is a deciduous tree or shrub native to Europe and parts of western Asia. It typically grows to a height of 5–15 meters, featuring a broad, rounded crown and smooth, gray bark that becomes fissured with age. Its leaves are opposite, palmately lobed, and turn vibrant yellow in the autumn, contributing to its ornamental value. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras that disperse its seeds. It thrives in a variety of soil types and is often used in landscaping for its hardiness and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campestre"
    },
    "taxonomy_art_desc": "Acer campestre subsp. campestre belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Sapindales, which consists of flowering plants with typically showy flowers and includes families such as Sapindaceae and Rutaceae. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with often fragrant flowers and fruits that may have a soapy taste. Its genus is Acer, which includes maple trees known for their distinctive palmate leaves and samaras. Its species is Acer campestre, commonly known as the field maple, a small to medium-sized tree or shrub native to Europe and western Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Albania",
        "Algeria",
        "Austria",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Corse",
        "Czechia-Slovakia",
        "Denmark",
        "France",
        "Germany",
        "Great Britain",
        "Greece",
        "Hungary",
        "Iran",
        "Italy",
        "Krym",
        "Netherlands",
        "North Caucasus",
        "NW. Balkan Pen.",
        "Poland",
        "Romania",
        "Sardegna",
        "Sicilia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Transcaucasus",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan"
    ],
    "distribution_introduced": [
        "California",
        "Central European Russia",
        "Connecticut",
        "East European Russia",
        "Illinois",
        "Indiana",
        "Ireland",
        "Kazakhstan",
        "Kentucky",
        "Maryland",
        "Massachusetts",
        "Michigan",
        "New Jersey",
        "New York",
        "North Carolina",
        "Ohio",
        "Ontario",
        "Pennsylvania",
        "Portugal",
        "Prince Edward I.",
        "Rhode I.",
        "South European Russia",
        "Tadzhikistan",
        "Turkmenistan",
        "Vermont",
        "Virginia",
        "West Virginia"
    ],
    "distribution_native_art_desc": "Acer campestre subsp. campestre is primarily native to Albania, Algeria, Austria, Belarus, Belgium, Bulgaria, Corse, Czechia-Slovakia, Denmark, France, Germany, Great Britain, Greece, Hungary, Iran, Italy, Krym, Netherlands, North Caucasus, NW. Balkan Pen., Poland, Romania, Sardegna, Sicilia, Spain, Sweden, Switzerland, Transcaucasus, Türkey, Türkey-in-Europe, Ukraine, and Uzbekistan. This species is commonly found in a variety of habitats including woodlands, hedgerows, and rocky slopes. It is well adapted to temperate climates and can thrive in both urban and rural environments. The plant is known for its ornamental value, with its distinctive foliage and small red or orange fruits. Its wide distribution across Europe and parts of Asia reflects its ecological flexibility and historical dispersal patterns.",
    "distribution_introduced_art_desc": "Acer campestre subsp. campestre was mainly introduced to California, Central European Russia, Connecticut, East European Russia, Illinois, Indiana, Ireland, Kazakhstan, Kentucky, Maryland, Massachusetts, Michigan, New Jersey, New York, North Carolina, Ohio, Ontario, Pennsylvania, Portugal, Prince Edward Island, Rhode Island, South European Russia, Tadzhikistan, Turkmenistan, Vermont, Virginia, and West Virginia. This distribution suggests a wide geographic range across both North America and Europe. It is commonly found in temperate regions with well-drained soils. The plant is often cultivated for its ornamental value due to its attractive fall foliage. Its introduction to these areas may be the result of both natural dispersal and human-assisted spread."
}
