{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer capillipes var. morifolium",
    "plant_slug": "acer-capillipes-var-morifolium",
    "plant_name_scientific": "acer capillipes var. morifolium",
    "intro": "Acer capillipes var. morifolium, commonly known as the Japanese maple, is a deciduous tree native to eastern Asia. It is characterized by its delicate, palmate leaves that turn vibrant shades of red and orange in the autumn. The plant typically grows to a height of 6–12 meters and prefers well-drained, acidic soils. It is often cultivated for its ornamental value in gardens and parks. The flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer capillipes var. morifolium is primarily native to the mountainous regions of southern China, particularly in Yunnan and Sichuan provinces. It thrives in cool, humid climates at elevations ranging from 1,500 to 3,000 meters above sea level. This variety is commonly found in mixed forests and along streamside habitats. It is well adapted to the rocky and well-drained soils typical of its native environment. Due to its unique appearance and ecological significance, it is a valued species in both conservation and horticultural contexts.",
    "distribution_introduced_art_desc": "Acer capillipes var. morifolium was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in regions with temperate climates, such as parts of Asia and North America. This variety is known for its ornamental value, particularly its vibrant fall foliage. It is often cultivated in gardens and landscapes for its aesthetic appeal. However, it may pose a risk to native ecosystems if it spreads beyond controlled environments."
}
