{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbinerve",
    "plant_slug": "acer-barbinerve",
    "plant_name_scientific": "acer barbinerve",
    "intro": "Acer barbinerve, commonly known as the narrow-veined maple, is a deciduous tree native to eastern Asia. It is characterized by its distinctive palmate leaves with five lobes and finely serrated margins. The leaves turn vibrant shades of red and orange in the autumn, making it a popular ornamental plant. It typically grows to a height of 10–15 meters and prefers well-drained, fertile soils. The tree produces small, greenish flowers in early spring, followed by winged seeds that aid in its dispersal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer barbinerve"
    },
    "taxonomy_art_desc": "Acer barbinerve belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Sapindales, which consists of flowering plants with typically small, clustered flowers and includes several families such as the Sapindaceae. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with showy flowers and often toxic fruits. Its genus is Acer, commonly known as maples, which are well-known for their distinctive leaves and ornamental value. Its species is Acer barbinerve, a specific type of maple characterized by its finely serrated leaf margins and is native to parts of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Korea",
        "Manchuria",
        "Primorye"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbinerve is primarily native to Korea, Manchuria, and Primorye. This species is commonly found in the temperate forests of these regions. It thrives in areas with well-drained soil and moderate climates. The plant is often associated with mountainous terrain in its natural habitat. Its distribution is limited to these specific geographic locations in East Asia.",
    "distribution_introduced_art_desc": "Acer barbinerve was mainly introduced to North America as an ornamental tree due to its attractive foliage and unique leaf structure. It has been widely cultivated in gardens and parks, particularly in the eastern and central United States. The plant's introduction has led to its establishment in some natural areas, raising concerns about its potential invasive behavior. Despite its aesthetic appeal, its spread outside of cultivated settings is still being monitored. Its distribution remains largely confined to human-modified landscapes rather than wild ecosystems."
}
