{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. palmatifidum",
    "plant_slug": "acer-campestre-var-palmatifidum",
    "plant_name_scientific": "acer campestre var. palmatifidum",
    "intro": "Acer campestre var. palmatifidum, commonly known as the five-lobed hedge maple, is a deciduous shrub or small tree native to Europe and western Asia. It is characterized by its palmately lobed leaves, which are typically divided into five to seven pointed lobes. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. It thrives in a variety of soil types and is often used as a hedge or ornamental plant due to its compact growth habit and attractive foliage. This variety is closely related to the common hedge maple but exhibits more pronounced leaf lobes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. palmatifidum is primarily native to parts of Europe, particularly in the northern regions of Spain and Portugal. This variety of the common horse chestnut is also found in southern France and parts of Italy. It thrives in temperate climates with well-drained soils and is often seen in woodland edges and open areas. The plant is known for its distinctive palmate leaves and is sometimes cultivated for ornamental purposes. Its distribution is limited compared to the broader Acer campestre species, making it a less common but notable variant.",
    "distribution_introduced_art_desc": "Acer campestre var. palmatifidum was mainly introduced to urban and suburban landscapes in North America for its ornamental value. It is valued for its distinctive palmate leaves and adaptability to various soil conditions. This variety is commonly used in landscaping due to its compact size and tolerance to pollution. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns among ecologists regarding its potential impact on local ecosystems."
}
