{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cordifolium",
    "plant_slug": "acer-cordifolium",
    "plant_name_scientific": "acer cordifolium",
    "intro": "Acer cordifolium, commonly known as the heart-leaved maple, is a deciduous tree native to the eastern United States. It is characterized by its palmately lobed leaves, which are heart-shaped and turn vibrant shades of red and orange in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse with the wind. It typically grows to a height of 20 to 40 feet and prefers moist, well-drained soils. Its ornamental value makes it a popular choice for gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cordifolium is primarily native to the eastern United States, specifically the Appalachian Mountains. It is found in regions spanning from New York to Georgia. This species thrives in moist, well-drained soils and is commonly found in mixed hardwood forests. It is also present in parts of southeastern Canada. The plant is known for its heart-shaped leaves and is often used in ornamental horticulture.",
    "distribution_introduced_art_desc": "Acer cordifolium was mainly introduced to North America, particularly in the northeastern United States and eastern Canada. It was brought there for ornamental purposes due to its attractive heart-shaped leaves and vibrant fall coloration. The plant thrives in moist, well-drained soils and is often found in forested areas or along stream banks. It has become naturalized in some regions, sometimes outcompeting native species. Despite its beauty, it is considered invasive in certain areas where it spreads rapidly."
}
