{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. laetum",
    "plant_slug": "acer-campestre-f-laetum",
    "plant_name_scientific": "acer campestre f. laetum",
    "intro": "Acer campestre f. laetum, commonly known as the white maple, is a variety of the field maple. It is characterized by its distinctive white to pale yellow flowers that appear in early spring. The leaves are typically oval-shaped with a smooth margin and a slightly serrated edge. This plant is native to parts of Europe and is often found in woodland areas. It is valued for its ornamental appeal and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. laetum is primarily native to Europe, particularly in the temperate regions of the continent. This variety of the field maple is commonly found in the British Isles, including parts of England, Scotland, and Ireland. It also occurs in southern Scandinavia, such as in Denmark and southern Sweden. The plant thrives in woodland edges, hedgerows, and open areas with well-drained soils. Its distribution includes regions with a mild climate and sufficient sunlight for growth.",
    "distribution_introduced_art_desc": "Acer campestre f. laetum was mainly introduced to North America, particularly in the eastern United States, as an ornamental plant due to its attractive foliage and adaptability. It has been widely cultivated in gardens and parks for its aesthetic value, especially during the fall when it displays vibrant yellow and orange hues. This introduction has led to its establishment in some natural areas, where it can compete with native species. Despite its ornamental appeal, it is considered invasive in certain regions due to its rapid spread and ecological impact. Its introduction highlights the balance between horticultural beauty and environmental responsibility."
}
