{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum var. ningpoense",
    "plant_slug": "acer-buergerianum-var-ningpoense",
    "plant_name_scientific": "acer buergerianum var. ningpoense",
    "intro": "Acer buergerianum var. ningpoense, commonly known as the Ningpo maple, is a deciduous tree native to eastern China. It is characterized by its palmate leaves, which are typically green on top and pale underneath. The plant produces small, red or yellow flowers in early spring, followed by winged seeds in the autumn. It thrives in moist, well-drained soils and prefers partial to full shade. This variety is valued for its ornamental foliage and is often used in horticultural landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum var. ningpoense is primarily native to eastern China, specifically the regions of Zhejiang, Jiangsu, and Anhui provinces. This variety is typically found in mountainous areas and forested regions, where it thrives in moist, well-drained soils. It is often associated with secondary growth forests and is known for its ornamental value due to its vibrant autumn foliage. The plant is also occasionally cultivated in other parts of East Asia for its aesthetic appeal. Its distribution is limited to specific habitats within its native range, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acer buergerianum var. ningpoense was mainly introduced to ornamental horticulture and landscaping due to its attractive, maple-like foliage and compact growth habit. It is often cultivated in gardens and urban environments for its aesthetic value. This variety is particularly favored in regions with mild climates where it can thrive without extreme temperature fluctuations. Its introduction has expanded its presence beyond its native range in China. However, it is important to monitor its spread to prevent potential ecological impacts in non-native areas."
}
