{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. obtusangulum",
    "plant_slug": "acer-campestre-var-obtusangulum",
    "plant_name_scientific": "acer campestre var. obtusangulum",
    "intro": "Acer campestre var. obtusangulum, commonly known as the blunt-angled hedge maple, is a compact, slow-growing deciduous shrub or small tree native to Europe. It is characterized by its rounded, dense foliage and small, palmately lobed leaves that are typically broader and more rounded than those of the typical *Acer campestre*. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. It thrives in well-drained soils and is often used in landscaping for its ornamental value and hardiness. This variety is particularly valued for its compact form and ability to tolerate urban environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. obtusangulum is primarily native to southern and central Europe, including countries such as France, Italy, Spain, and Portugal. This variety of the common horse chestnut is typically found in woodland edges, open forests, and rocky slopes. It thrives in temperate climates with well-drained soils and partial to full sunlight. The plant is known for its distinctive rounded leaves and showy white flowers that appear in spring. It is often used in landscaping due to its ornamental value and adaptability to various soil conditions.",
    "distribution_introduced_art_desc": "Acer campestre var. obtusangulum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly found in woodland edges and open areas. This variety is known for its rounded leaves and moderate growth habit, making it a popular ornamental plant. It has been introduced to several regions outside its native range for landscaping and ecological purposes. Due to its adaptability, it can sometimes become invasive in non-native environments."
}
