{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cucullobracteatum",
    "plant_slug": "acer-cucullobracteatum",
    "plant_name_scientific": "acer cucullobracteatum",
    "intro": "Acer cucullobracteatum, commonly known as the hooded maple, is a rare and unique species of maple native to the mountainous regions of China. It is characterized by its distinctive, broad, hood-like bracts that surround the flowers, giving it its common name. The plant produces small, yellowish-green flowers in early spring, followed by samaras that are typically red or orange in color. Its leaves are palmately lobed, with a coarsely toothed margin, and they turn vibrant shades of red and orange in the fall. Due to its limited distribution and habitat specificity, Acer cucullobracteatum is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cucullobracteatum is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. This species thrives in temperate to subtropical climates at high altitudes, often found in forested areas with well-drained soils. It is commonly associated with secondary growth and is adapted to the unique microclimates of its native habitat. The plant is also occasionally found in neighboring regions of northern Myanmar and western Yunnan. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acer cucullobracteatum was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It thrives in regions with moderate rainfall and sufficient sunlight. This plant is commonly used in landscaping due to its ornamental value and adaptability. It has been introduced to several parts of the world, including North America and Europe. However, its spread is limited by its specific environmental requirements."
}
