{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum f. schneckii",
    "plant_slug": "acer-barbatum-f-schneckii",
    "plant_name_scientific": "acer barbatum f. schneckii",
    "intro": "Acer barbatum f. schneckii, commonly known as the Japanese maple with twisted bark, is a unique variant of the Japanese maple characterized by its distinctive, contorted trunk and branches. This cultivar is prized for its ornamental value, particularly its vibrant foliage that ranges from emerald green to fiery red in autumn. The plant is native to Japan and thrives in USDA hardiness zones 6 to 8, preferring partial shade and well-drained soil. Its slow growth rate makes it ideal for small gardens or as a specimen tree. The twisted bark adds a dramatic, almost sculptural appearance, making it a popular choice in horticultural collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum f. schneckii is primarily native to the eastern United States, particularly in the Appalachian Mountains. This plant is found in areas of Virginia, North Carolina, and Tennessee. It thrives in moist, well-drained soils along stream banks and in rocky woodlands. The subspecies is known for its distinctive foliage and is often associated with cool, humid climates. It is a rare and localized plant, with a limited geographic range.",
    "distribution_introduced_art_desc": "Acer barbatum f. schneckii was mainly introduced to North America, particularly in the eastern United States. It is commonly found in moist, acidic soils in woodland areas. This cultivar is valued for its unique, finely dissected leaves that provide ornamental interest throughout the growing season. It is often used in gardens and landscapes for its aesthetic appeal. However, it is considered invasive in some regions due to its rapid spread and ability to outcompete native vegetation."
}
