{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. tauricum",
    "plant_slug": "acer-campestre-var-tauricum",
    "plant_name_scientific": "acer campestre var. tauricum",
    "intro": "Acer campestre var. tauricum, commonly known as the Taurian hedge maple, is a variant of the common maple. It is a small to medium-sized deciduous tree or shrub that typically grows to a height of 3–6 meters. The leaves are palmately lobed, with five to seven pointed lobes, and are often covered in fine hairs when young. It produces small, yellowish-green flowers in early spring, followed by winged fruits that aid in seed dispersal. This plant is native to southern Europe and thrives in well-drained soils, making it a hardy and ornamental species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. tauricum is primarily native to southern and central Europe, including countries such as Italy, France, Spain, and parts of Eastern Europe. This variety of the common horse chestnut is typically found in woodlands, hedgerows, and along stream banks. It thrives in temperate climates with well-drained soil and partial to full sunlight. The plant is known for its ornamental value, featuring showy white or pink flowers in spring. Its natural range has also been extended through cultivation in various regions beyond its original habitat.",
    "distribution_introduced_art_desc": "Acer campestre var. tauricum was mainly introduced to Europe from its native range in the Caucasus and parts of Turkey. It was brought to Europe during the 18th and 19th centuries as a ornamental plant due to its attractive foliage and adaptability. This variety is often cultivated in gardens and parks for its aesthetic value and ability to thrive in a variety of soil conditions. It has since become naturalized in some regions of western Europe, particularly in the UK and France. However, its spread is generally limited and it is not considered an invasive species."
}
