{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer creticum var. sublobatum",
    "plant_slug": "acer-creticum-var-sublobatum",
    "plant_name_scientific": "acer creticum var. sublobatum",
    "intro": "Acer creticum var. sublobatum, commonly known as the narrow-lobed maple, is a deciduous shrub or small tree native to the mountainous regions of Turkey. It is characterized by its distinctive palmate leaves with five to seven narrow lobes, which are typically bright green in summer and turn vibrant red or orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by red or orange samaras that aid in seed dispersal. It thrives in well-drained soils and full sun, making it a suitable ornamental plant for gardens and landscapes. Due to its unique foliage, it is often cultivated for its aesthetic value in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer creticum var. sublobatum is primarily native to the eastern Himalayas, including regions of Nepal, Bhutan, and northern India. It is commonly found in temperate forested areas at elevations ranging from 1,500 to 3,000 meters. This variant of the maple species thrives in moist, well-drained soils and is often associated with mixed deciduous forests. It is particularly prevalent in the Indian state of Sikkim and the northeastern parts of India. Due to its limited distribution, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acer creticum var. sublobatum was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions with mild winters and warm summers. It thrives in full sun to partial shade and is often found in forested areas or along stream banks. This variety is known for its distinctive lobed leaves and vibrant fall coloration, making it a popular ornamental plant. It has been introduced to several parts of the United States, including the Pacific Northwest and the eastern coastal regions. However, its spread has been limited due to its specific environmental requirements and susceptibility to certain pests and diseases."
}
