{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer commutatum",
    "plant_slug": "acer-commutatum",
    "plant_name_scientific": "acer commutatum",
    "intro": "Acer commutatum, commonly known as the California maple, is a deciduous tree native to the western United States. It is characterized by its finely toothed, ovate leaves that turn vibrant shades of red and yellow in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds called samaras. Its bark is smooth and grayish-brown, becoming fissured with age. Acer commutatum thrives in well-drained soils and is often found in coastal and mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer commutatum is primarily native to the mountainous regions of eastern Asia, including China, Japan, and Korea. It thrives in temperate climates and is commonly found in forested areas at higher elevations. This species is particularly associated with the Himalayas and the eastern parts of the Tibetan Plateau. It prefers well-drained soils and is often seen in mixed hardwood forests. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acer commutatum was mainly introduced to the western United States, particularly in regions with moist, well-drained soils. It is commonly found in areas with a temperate climate, such as California and Oregon. This species is often cultivated in gardens and parks due to its ornamental value and adaptability. It prefers partial shade to full sun and can thrive in a variety of soil types. However, it is important to monitor its spread to prevent potential ecological impacts in non-native habitats."
}
