{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. puncticulatum",
    "plant_slug": "acer-campestre-f-puncticulatum",
    "plant_name_scientific": "acer campestre f. puncticulatum",
    "intro": "Acer campestre f. puncticulatum, commonly known as the dotted wood maple, is a cultivar of the European maple tree. It is characterized by its distinctive foliage, which features small, raised dots on the leaves, giving it a unique appearance. The plant is typically deciduous, shedding its leaves in the autumn season. It thrives in well-drained soil and partial to full sunlight, making it suitable for garden cultivation. This ornamental tree is valued for its aesthetic appeal and adaptability to various climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. puncticulatum is primarily native to southern Europe, including countries such as Spain, Portugal, Italy, France, and parts of the Balkans. This variety of the common horse chestnut is adapted to temperate climates and thrives in well-drained soils. It is commonly found in woodlands, hedgerows, and along riverbanks. The plant is known for its ornamental value, particularly its vibrant autumn foliage. Its distribution is largely restricted to the western part of the Palearctic region.",
    "distribution_introduced_art_desc": "Acer campestre f. puncticulatum was mainly introduced to ornamental horticulture and landscaping due to its attractive, finely serrated leaves and adaptability to various soil conditions. It is commonly used in urban environments for its tolerance to pollution and compact growth habit. This cultivar is also favored for its ability to thrive in partial shade, making it suitable for a wide range of garden settings. Its introduction has expanded its presence beyond its native range, contributing to its status as an invasive species in some regions. However, its ornamental value continues to drive its cultivation and spread."
}
