{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amoenum var. matsumurae",
    "plant_slug": "acer-amoenum-var-matsumurae",
    "plant_name_scientific": "acer amoenum var. matsumurae",
    "intro": "Acer amoenum var. matsumurae, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its ornamental value, featuring delicate, palmate leaves that change color with the seasons. The plant typically grows to a height of 5–10 meters and thrives in well-drained soil with partial shade. Its flowers are small and inconspicuous, appearing in early spring before the leaves emerge. The species is valued in horticulture for its aesthetic appeal and adaptability to various garden environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amoenum var. matsumurae is primarily native to the mountainous regions of southern Japan, particularly in the islands of Kyushu and Shikoku. This variant of the maple tree thrives in humid, subtropical climates and is commonly found in forested areas at moderate to high elevations. It is often associated with evergreen and mixed deciduous forests, where it contributes to the biodiversity of the understory. The plant is well adapted to the moist and cool conditions typical of these regions. Its native distribution is limited to specific geographic areas within Japan, reflecting its ecological niche and environmental requirements.",
    "distribution_introduced_art_desc": "Acer amoenum var. matsumurae was mainly introduced to regions with temperate climates and well-drained soils, particularly in parts of East Asia. It thrives in areas with moderate rainfall and partial to full sunlight. This variety is often cultivated for its ornamental value due to its vibrant fall foliage. It has been introduced to gardens and parks in North America and Europe as a landscape plant. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
