{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. curvatum",
    "plant_slug": "acer-dasycarpum-f-curvatum",
    "plant_name_scientific": "acer dasycarpum f. curvatum",
    "intro": "Acer dasycarpum f. curvatum, commonly known as the curly-leaf maple, is a unique variant of the Chinese maple. It is characterized by its distinctive, wavy, and curled leaf margins, which set it apart from typical maple species. The plant is native to China and is often cultivated for its ornamental value due to its striking foliage. It prefers well-drained soil and partial to full sunlight, making it suitable for gardens and landscapes. Its botanical features make it a popular choice for those seeking unique and visually appealing tree specimens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. curvatum is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in temperate to cool climates at elevations ranging from 2,000 to 4,000 meters above sea level. This plant is commonly found in dense forests and along stream banks in these high-altitude areas. It is well adapted to the moist, shaded conditions typical of its native habitat. The species is known for its distinctive curved samaras, which aid in its dispersal across the rugged terrain.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. curvatum was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in full sun to partial shade. It is commonly found in areas with moderate rainfall and cool summers, making it suitable for gardens and landscaped areas in the northern hemisphere. This cultivar is valued for its unique, curling leaves that add ornamental interest throughout the growing season. It is often used in horticulture for its aesthetic appeal and adaptability to various soil types. However, it requires protection from strong winds and extreme temperature fluctuations to ensure optimal growth."
}
