{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. glabratum",
    "plant_slug": "acer-campestre-f-glabratum",
    "plant_name_scientific": "acer campestre f. glabratum",
    "intro": "Acer campestre f. glabratum, commonly known as the smooth field maple, is a variant of the field maple tree native to Europe. It is characterized by its smooth, glabrous bark and heart-shaped leaves that are typically lobed. This plant thrives in moist, well-drained soils and is often found in woodland edges or open areas. It produces small, yellowish-green flowers in early spring, followed by winged seeds. The smooth field maple is valued for its ornamental appeal and ecological benefits in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. glabratum is primarily native to parts of Eastern Europe and Western Asia. It is found in countries such as Ukraine, Russia, and the Caucasus region. This plant typically grows in open woodlands, forest edges, and rocky slopes. It thrives in temperate climates with well-drained soils. Its distribution is characterized by its adaptability to various environmental conditions.",
    "distribution_introduced_art_desc": "Acer campestre f. glabratum was mainly introduced to North America as an ornamental plant due to its attractive appearance and hardy nature. It is commonly found in urban and suburban landscapes, where it is valued for its tolerance to pollution and compact growth habit. This distribution is primarily the result of horticultural cultivation rather than natural dispersal. It has been widely planted in gardens and along streets, contributing to its widespread presence in the region. However, its introduction has raised concerns about potential ecological impacts in native habitats."
}
