{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer changhuaense var. glabrescens",
    "plant_slug": "acer-changhuaense-var-glabrescens",
    "plant_name_scientific": "acer changhuaense var. glabrescens",
    "intro": "Acer changhuaense var. glabrescens, commonly known as the Changhua glabrous maple, is a deciduous tree native to southern China. It belongs to the Sapindaceae family and is characterized by its smooth, glabrous bark and vibrant autumn foliage. The leaves are typically palmately lobed, with a serrated margin and a glossy green surface. It thrives in temperate climates with well-drained soil and partial to full sunlight. This variety is valued for its ornamental appeal and is often planted in gardens and parks for its seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer changhuaense var. glabrescens is primarily native to China, specifically the provinces of Yunnan and Sichuan. This variant of the Acer changhuaense is found in the mountainous regions of these areas. It thrives in temperate climates with high altitudes and is commonly found in mixed forests. The plant is adapted to the cool and moist conditions typical of its native habitat. It is a relatively rare species within its range.",
    "distribution_introduced_art_desc": "Acer changhuaense var. glabrescens was mainly introduced to regions with temperate climates that provide adequate moisture and well-drained soils. It thrives in areas with mild winters and warm summers, making it suitable for cultivation in parts of East Asia and North America. This variety is often planted as an ornamental tree due to its attractive foliage and compact growth habit. It has been introduced to botanical gardens and urban landscapes for its aesthetic value and adaptability. However, its natural range remains limited, and it is not commonly found in the wild."
}
