{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum f. rubrum",
    "plant_slug": "acer-cappadocicum-f-rubrum",
    "plant_name_scientific": "acer cappadocicum f. rubrum",
    "intro": "Acer cappadocicum f. rubrum, commonly known as the Crimson Maple, is a rare and striking variant of the Cappadocian maple. This plant is characterized by its vibrant red foliage, which intensifies during the autumn season. It is a deciduous tree that typically grows in rocky, well-drained soils in temperate climates. The leaves are opposite, ovate, and have a serrated margin, adding to its ornamental value. Due to its limited natural range and unique coloration, it is often cultivated in specialized gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum f. rubrum is primarily native to the mountainous regions of southeastern Turkey, particularly in the Cappadocia area. This unique variety is found in the Taurus Mountains and surrounding areas, where it thrives in rocky and well-drained soils. It is commonly associated with dry, sunny slopes and is often found in mixed forests or as a solitary tree. The plant is adapted to the harsh climatic conditions of the region, including cold winters and hot, dry summers. Due to its limited distribution, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acer cappadocicum f. rubrum was mainly introduced to the United States as an ornamental plant due to its vibrant red foliage. It is commonly cultivated in gardens and landscaped areas for its aesthetic appeal. The introduction has led to its presence in several regions, particularly in the eastern and central parts of the country. However, it is not considered invasive and does not pose a significant threat to native plant communities. Its distribution remains largely confined to cultivated settings."
}
