{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. molle",
    "plant_slug": "acer-campestre-f-molle",
    "plant_name_scientific": "acer campestre f. molle",
    "intro": "Acer campestre f. molle, commonly known as the soft-leaved field maple, is a variant of the field maple tree native to Europe. It is characterized by its smooth, thin leaves that are typically lighter in color compared to the standard species. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by the wind. It thrives in sunny to partially shaded environments and is often found in woodland edges or open areas. This cultivar is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. molle is primarily native to southern Europe, including parts of Spain, Portugal, Italy, and the Balkans. It is also found in North Africa, particularly in countries such as Morocco and Algeria. This plant thrives in temperate climates and is commonly associated with rocky or limestone soils. It is often found in open woodlands, along roadsides, and in disturbed areas. Its distribution is largely limited to the western and southern regions of the European continent.",
    "distribution_introduced_art_desc": "Acer campestre f. molle was mainly introduced to Europe and North America as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly used in landscaping and urban environments because of its tolerance to pollution and compact growth habit. The distribution of this plant has expanded beyond its native range in eastern Asia, leading to its naturalization in several regions. It thrives in temperate climates and can be found in gardens, parks, and along roadsides. However, its introduction has raised concerns about potential ecological impacts in non-native areas."
}
