{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. flabellatum",
    "plant_slug": "acer-campbellii-subsp-flabellatum",
    "plant_name_scientific": "acer campbellii subsp. flabellatum",
    "intro": "Acer campbellii subsp. flabellatum, commonly known as the Campbell's maple, is a deciduous tree native to the mountainous regions of western China. It is characterized by its striking, palmate leaves that turn vibrant shades of red and orange in autumn. The plant typically grows to a height of 10–15 meters and prefers well-drained, acidic soils. It is relatively slow-growing and tolerant of cold climates, making it suitable for temperate gardens. Its ornamental value is largely due to its distinctive foliage and autumn coloration.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campbellii"
    },
    "taxonomy_art_desc": "Acer campbellii subsp. flabellatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Sapindales, which comprises flowering plants with diverse forms, including trees, shrubs, and vines, often found in tropical and temperate regions. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with distinctive flowers and fruits. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs known for their ornamental leaves and sap. Its species is Acer campbellii, a maple species native to China, characterized by its unique foliage and often used in horticulture.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Laos",
        "Myanmar",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. flabellatum is primarily native to China South-Central, China Southeast, Laos, Myanmar, and Vietnam. This subspecies is commonly found in the mountainous regions of these countries. It thrives in temperate to subtropical climates with well-drained soils. The plant is often associated with forested areas and rocky outcrops. Its native distribution reflects its adaptation to the diverse ecosystems of Southeast Asia.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. flabellatum was mainly introduced to specific regions in the Pacific Northwest of the United States and parts of British Columbia, Canada. It was introduced primarily as an ornamental plant due to its unique foliage and aesthetic appeal. This subspecies is often cultivated in gardens and parks for its decorative value. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on native ecosystems. Its introduction has led to increased interest in its ecological role and management in the wild."
}
