{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatum var. prattii",
    "plant_slug": "acer-caudatum-var-prattii",
    "plant_name_scientific": "acer caudatum var. prattii",
    "intro": "Acer caudatum var. prattii, commonly known as the Pratts' maple, is a variant of the weeping maple native to the eastern United States. It is characterized by its distinctive, cascading branches that give it a unique, almost tree-like appearance. The leaves are typically palmately lobed, with a bright green upper surface and a lighter, sometimes hairy underside. It produces small, red flowers in the spring, followed by winged seeds that are dispersed by the wind. This plant thrives in moist, well-drained soils and is often found in woodland areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatum var. prattii is primarily native to the southeastern United States, specifically occurring in parts of Georgia, South Carolina, and North Carolina. This variety is commonly found in moist, well-drained soils along stream banks and in shaded woodlands. It thrives in temperate climates with moderate humidity and is often associated with riparian habitats. The plant is known for its distinctive, drooping branches and is a valued ornamental species. Its native range is limited, reflecting its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acer caudatum var. prattii was mainly introduced to specific regions in the eastern United States, particularly in areas with moist, well-drained soils. It is often found in riparian zones and along stream banks, where it thrives in humid, temperate climates. This variety is valued for its ornamental value, especially its distinctive weeping form and vibrant fall color. However, it is considered an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting efforts to manage its spread in natural habitats."
}
