{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dactylophyllum",
    "plant_slug": "acer-dactylophyllum",
    "plant_name_scientific": "acer dactylophyllum",
    "intro": "Acer dactylophyllum, commonly known as the New Zealand maple, is a small deciduous tree native to New Zealand. It is characterized by its distinctive palmate leaves, which are typically five-lobed and have a bright green upper surface. The tree produces small, yellowish-green flowers in spring, followed by red or orange samaras that disperse its seeds. It thrives in cool, moist environments and is often found in forest understories. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dactylophyllum is primarily native to the tropical regions of Southeast Asia, particularly Indonesia and the Philippines. It is commonly found in lowland rainforests and moist mountainous areas. This species thrives in humid climates with high rainfall and well-drained soils. It is often associated with secondary growth and disturbed habitats. Due to its limited range, it is considered a rare and endemic plant in its native regions.",
    "distribution_introduced_art_desc": "Acer dactylophyllum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its beauty, it has become invasive in some areas, outcompeting native species for resources. The plant thrives in a variety of soil types and can grow in both full sun and partial shade. Its rapid growth and ability to spread through seedlings make it a challenging species to control."
}
