{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum f. floridanum",
    "plant_slug": "acer-barbatum-f-floridanum",
    "plant_name_scientific": "acer barbatum f. floridanum",
    "intro": "Acer barbatum f. floridanum, commonly known as the Florida maple, is a deciduous shrub or small tree native to the southeastern United States. It features opposite, ovate leaves that are typically red or orange in the fall, adding vibrant color to the landscape. The plant produces small, clustered flowers in the spring, followed by winged samaras as its fruit. It prefers moist, well-drained soils and partial to full sun, making it suitable for wetland or riparian habitats. Its ornamental value and adaptability make it a desirable plant for ecological and landscape restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum f. floridanum is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This plant thrives in moist, acidic soils along stream banks and in wetlands. It is commonly found in the Florida Panhandle and the coastal regions of Georgia. The species is adapted to the humid climate and frequent rainfall of these areas. It plays an important ecological role in supporting local wildlife and maintaining wetland ecosystems.",
    "distribution_introduced_art_desc": "Acer barbatum f. floridanum was mainly introduced to the southeastern United States, particularly in Florida and surrounding regions. It was introduced as an ornamental plant due to its unique foliage and adaptability to warm climates. This distribution is primarily the result of horticultural interest rather than natural dispersal. It has been cultivated in gardens and landscapes, contributing to its presence in local ecosystems. However, its spread outside of cultivated areas is limited."
}
