{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer anhweiense",
    "plant_slug": "acer-anhweiense",
    "plant_name_scientific": "acer anhweiense",
    "intro": "Acer anhweiense, commonly known as the Anhwei maple, is a deciduous tree native to China. It belongs to the Sapindaceae family and is characterized by its vibrant autumn foliage, which displays shades of red, orange, and yellow. The tree has palmate leaves with five to seven lobes, and it produces small, yellowish flowers in early spring. It typically grows to a height of 10–15 meters and prefers well-drained soil in full sun. This ornamental tree is valued for its aesthetic appeal and is often planted in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer anhweiense is primarily native to China, specifically the provinces of Anhui, Jiangsu, and Zhejiang. It is commonly found in mountainous regions and along riverbanks in these areas. This species thrives in moist, well-drained soils and is often associated with secondary growth forests. It is an important component of the local flora and is sometimes cultivated for its ornamental value. The plant is also found in parts of Korea and Japan, where it is considered a rare and relict species.",
    "distribution_introduced_art_desc": "Acer anhweiense was mainly introduced to the eastern and central regions of China, where it thrives in temperate climates. It is commonly found in forested areas and along riverbanks, preferring well-drained soil. This species is valued for its ornamental value due to its vibrant autumn foliage. It has also been introduced to parts of Southeast Asia for horticultural purposes. However, its natural range remains primarily within its native habitat in China."
}
