{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. brachypterum",
    "plant_slug": "acer-campestre-f-brachypterum",
    "plant_name_scientific": "acer campestre f. brachypterum",
    "intro": "Acer campestre f. brachypterum, commonly known as the narrow-leaved maple, is a shrub or small tree native to Europe and parts of Asia. It is a compact form of the common maple, characterized by its narrow, elongated leaves that are typically dark green on top and lighter underneath. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by the wind. It thrives in well-drained soils and is often used in gardens for its ornamental value and hardiness. This cultivar is valued for its compact growth habit and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. brachypterum is primarily native to central and eastern Europe, including countries such as Germany, Poland, and the Czech Republic. This subspecies is commonly found in woodland edges, open forests, and rocky soils. It thrives in temperate climates and is often associated with mixed deciduous forests. The plant is known for its distinctive short-winged samaras and its ability to tolerate a variety of soil conditions. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. brachypterum was mainly introduced to urban and suburban areas for ornamental purposes due to its compact size and attractive foliage. It is commonly used in landscaping to provide shade and visual interest in smaller garden spaces. This variety is valued for its adaptability to various soil types and resistance to urban environmental stressors. However, it can become invasive in certain regions if not managed properly. Its introduction has led to both aesthetic benefits and ecological concerns in some local ecosystems."
}
