{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbinerve var. glabrescens",
    "plant_slug": "acer-barbinerve-var-glabrescens",
    "plant_name_scientific": "acer barbinerve var. glabrescens",
    "intro": "Acer barbinerve var. glabrescens, commonly known as the smooth-veined maple, is a variant of the barbinerve maple characterized by its smooth, glabrous undersides of leaves. It is a deciduous tree native to eastern Asia, particularly China, where it thrives in temperate climates. The leaves are typically palmately lobed with a distinctive, finely serrated margin. Its flowers are small and greenish-yellow, appearing in early spring before the leaves emerge. The tree produces samaras, or winged seeds, which aid in its dispersal and contribute to its ecological role in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbinerve var. glabrescens is primarily native to the eastern United States, specifically the Appalachian region. This variety of the maple tree is found in states such as Virginia, West Virginia, and North Carolina. It thrives in moist, well-drained soils along stream banks and in forested areas. The plant is commonly associated with mixed hardwood forests and riparian habitats. Its native range is limited, making it a regionally significant species within its ecological zone.",
    "distribution_introduced_art_desc": "Acer barbinerve var. glabrescens was mainly introduced to ornamental horticulture due to its striking foliage and unique leaf morphology. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant prefers well-drained soils and full sun to partial shade conditions. It is native to China but has been introduced to various regions worldwide. However, it is considered non-invasive and does not pose a significant threat to native ecosystems."
}
