{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer coriaceifolium var. microcarpum",
    "plant_slug": "acer-coriaceifolium-var-microcarpum",
    "plant_name_scientific": "acer coriaceifolium var. microcarpum",
    "intro": "Acer coriaceifolium var. microcarpum, commonly known as the dwarf maple, is a rare and compact variant of the common maple. It is characterized by its small, elliptical leaves that are typically dark green on top and pale underneath. The plant produces tiny, red-orange samaras, which are its characteristic seeds. It thrives in cool, moist climates and is often found in mountainous regions. Due to its limited distribution and unique appearance, it is considered a valuable ornamental and conservation species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer coriaceifolium var. microcarpum is primarily native to the mountainous regions of eastern Asia, specifically China, where it thrives in cool, temperate climates. This variety is commonly found in the provinces of Sichuan, Yunnan, and Tibet, growing at elevations ranging from 2,000 to 4,000 meters. It is often associated with mixed forests and rocky slopes, where it adapts well to the harsh environmental conditions. The plant is known for its distinctive small, heart-shaped leaves and is a member of the maple family. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer coriaceifolium var. microcarpum was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in temperate forest environments. It thrives in regions with cool summers and cold winters, making it suitable for northern and high-altitude habitats. This variant is often found in association with other shade-tolerant species, such as ferns and mosses, in forest understories. Its introduction has been documented in several regions of Europe and parts of Asia where similar climatic conditions exist. Due to its ornamental value, it has also been cultivated in botanical gardens and private collections."
}
