{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum var. glaucum",
    "plant_slug": "acer-barbatum-var-glaucum",
    "plant_name_scientific": "acer barbatum var. glaucum",
    "intro": "Acer barbatum var. glaucum, commonly known as the glaucous maple, is a variant of the Japanese maple characterized by its distinctive blue-green foliage. It is native to the mountainous regions of Japan and thrives in cool, humid climates. The leaves are typically ovate or elliptic, with a serrated margin and a striking coloration that ranges from pale green to bluish-gray. This plant prefers well-drained soil and partial to full shade, making it suitable for woodland gardens. Its ornamental value lies in its unique leaf color and seasonal changes, which add visual interest throughout the growing season.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum var. glaucum is primarily native to the eastern Himalayas, including regions in India, Nepal, and Bhutan. This variant of the maple tree thrives in high-altitude forests and alpine meadows. It is commonly found in areas with cool, moist climates and well-drained soils. The plant is adapted to the rugged terrain and harsh conditions of its native habitat. Its distribution is limited to specific elevational ranges within these mountainous regions.",
    "distribution_introduced_art_desc": "Acer barbatum var. glaucum was mainly introduced to areas with cool, moist climates and well-drained soils, often found in mountainous regions. It thrives in environments with partial to full shade, making it suitable for woodland gardens and shaded landscapes. This variety is valued for its distinctive blue-green foliage and ornamental value, which makes it a popular choice for horticultural use. Its introduction has expanded its range beyond its native habitat, contributing to biodiversity in new ecosystems. However, it requires careful management to prevent potential invasiveness in non-native regions."
}
