{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer argutum",
    "plant_slug": "acer-argutum",
    "plant_name_scientific": "acer argutum",
    "intro": "Acer argutum, commonly known as the Japanese maple, is a deciduous tree native to East Asia. It is characterized by its delicate, palmately lobed leaves that turn vibrant shades of red and orange in autumn. The plant typically grows to a height of 6 to 15 meters, with a rounded crown and smooth, gray bark. Its flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring. Acer argutum is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer argutum"
    },
    "taxonomy_art_desc": "Acer argutum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Sapindales, which consists of flowering plants that are often found in tropical and subtropical regions and include trees and shrubs. Its family is Sapindaceae, commonly known as the soapberry family, which includes a variety of trees and shrubs with often showy flowers. Its genus is Acer, commonly known as maples, which are well-known for their distinctive leaves and ornamental value. Its species is Acer argutum, a specific type of maple native to East Asia, characterized by its serrated leaves and yellowish flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer argutum is primarily native to Japan. It is commonly found in the mountainous regions of central and southern Japan. This species thrives in temperate climates with well-drained soil. It is often seen in forests and along stream sides. Acer argutum is known for its distinctive palmate leaves and is a valued ornamental plant.",
    "distribution_introduced_art_desc": "Acer argutum was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly found in gardens and urban environments where it serves as a decorative tree. This plant has been cultivated in regions with temperate climates, including parts of North America and Europe. Its introduction has sometimes led to naturalization in areas where it can thrive without human intervention. However, it is generally considered non-invasive and poses minimal risk to native ecosystems."
}
