{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatum subsp. ukurunduense",
    "plant_slug": "acer-caudatum-subsp-ukurunduense",
    "plant_name_scientific": "acer caudatum subsp. ukurunduense",
    "intro": "Acer caudatum subsp. ukurunduense, commonly known as the U kurundu maple, is a rare and distinctive species native to the mountainous regions of eastern Africa. It is characterized by its striking, cascading foliage, with leaves that turn vibrant shades of red and orange in the fall. The plant typically grows as a shrub or small tree, reaching heights of up to 10 meters. Its bark is smooth and reddish-brown, and it produces small, yellowish-green flowers in early spring. This subspecies is valued for its ornamental appeal and is often cultivated in botanical gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatum subsp. ukurunduense is primarily native to the eastern Andes of Ecuador. This subspecies is found in the cloud forests of this region, where it thrives in humid, temperate climates. It is commonly associated with elevations ranging from 1,200 to 2,500 meters above sea level. The plant is often found in secondary growth and disturbed areas within its native range. Due to its limited distribution, it is considered a rare and endemic species in Ecuador.",
    "distribution_introduced_art_desc": "Acer caudatum subsp. ukurunduense was mainly introduced to the region of eastern Brazil, specifically the state of Pará, where it is found in the dense tropical rainforests. This subspecies is typically associated with moist, shaded environments along riverbanks and in forest understories. It has been recorded in several protected areas, including the Anavilhanas Archipelago, which is part of the Rio Negro basin. Due to its limited natural range and specific habitat requirements, it is considered a rare and endemic species. Conservation efforts are ongoing to protect its habitat from deforestation and habitat degradation."
}
