{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer carpinifolium",
    "plant_slug": "acer-carpinifolium",
    "plant_name_scientific": "acer carpinifolium",
    "intro": "Acer carpinifolium, commonly known as the European maple, is a deciduous tree native to central and southern Europe. It typically grows to a height of 8–15 meters, featuring a rounded crown and smooth, light grey bark. The leaves are opposite, palmately lobed, and turn yellow in the fall, adding ornamental value. It prefers well-drained soils and full sun, making it suitable for gardens and urban landscapes. The tree produces small, red samaras that are dispersed by wind, aiding in its natural propagation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer carpinifolium"
    },
    "taxonomy_art_desc": "Acer carpinifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their complex vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are part of the more advanced angiosperms. Its order is Sapindales, which includes plants with simple, often alternate leaves and flowers that are typically clustered. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with distinctive fruits and often aromatic leaves. Its genus is Acer, commonly known as maples, which are well-known for their ornamental leaves and sap that can be tapped for syrup. Its species is Acer carpinifolium, a specific type of maple known for its unique leaf shape and habitat preferences in certain regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer carpinifolium is primarily native to Japan. It is commonly found in the mountainous regions of Honshu, Shikoku, and Kyushu. This plant thrives in temperate climates and is often associated with forested areas. It is known for its distinctive foliage and is a valued ornamental species. Its distribution is limited to specific geographic regions within Japan.",
    "distribution_introduced_art_desc": "Acer carpinifolium was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in forested regions. It thrives in temperate climates and is often found in the understory of hardwood forests. This species is valued for its ornamental value, particularly its vibrant fall foliage. It has been introduced to several regions outside its native range, including parts of the United States and Europe. However, its introduction has raised concerns about its potential invasiveness in non-native habitats."
}
