{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum var. formosanum",
    "plant_slug": "acer-buergerianum-var-formosanum",
    "plant_name_scientific": "acer buergerianum var. formosanum",
    "intro": "Acer buergerianum var. formosanum, commonly known as the Formosan maple, is a deciduous tree native to Taiwan. It is characterized by its heart-shaped leaves that turn vibrant shades of red and yellow in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds. It typically grows to a height of 10–15 meters and prefers well-drained soils. The Formosan maple is valued for its ornamental appeal and is often planted in gardens and parks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer buergerianum"
    },
    "taxonomy_art_desc": "Acer buergerianum var. formosanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns, horsetails, and other spore-producing plants, known for their primitive vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of growth forms. Its order is Sapindales, a group of flowering plants that includes trees, shrubs, and herbs, many of which produce fruits with a distinctive structure. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with palmately lobed leaves and often fragrant flowers. Its genus is Acer, commonly known as maples, which are known for their distinctive foliage and ornamental value. Its species is Acer buergerianum, a maple species native to East Asia, characterized by its slender form and unique leaf shape, with the varietal form formosanum being a specific variant found in Taiwan.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum var. formosanum is primarily native to Taiwan. This variety of the maple tree is found in the mountainous regions of the island. It thrives in temperate climates with high humidity and well-drained soil. The plant is commonly seen in forested areas and along stream sides. Its natural distribution is limited to specific habitats in Taiwan.",
    "distribution_introduced_art_desc": "Acer buergerianum var. formosanum was mainly introduced to the United States as an ornamental tree due to its unique appearance and adaptability to various climates. It is commonly found in urban and suburban landscapes, particularly in regions with mild winters and well-drained soils. The plant's introduction has led to its establishment in several states, including California, Oregon, and Washington. However, it is considered a non-native species and has not been widely reported as invasive in the regions where it has been introduced. Its distribution is primarily limited to cultivated areas rather than natural ecosystems."
}
