{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. compactum",
    "plant_slug": "acer-campestre-f-compactum",
    "plant_name_scientific": "acer campestre f. compactum",
    "intro": "Acer campestre f. compactum, commonly known as the dwarf maple, is a compact, slow-growing shrub or small tree native to Europe. It features dense, rounded foliage with palmately lobed leaves that turn vibrant shades of red and orange in autumn. The plant produces small, winged samaras that aid in seed dispersal. It thrives in well-drained soil and full to partial sun, making it suitable for rock gardens or as a specimen plant. Its ornamental value lies in its compact form and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. compactum is primarily native to southern and central Europe, including countries such as France, Italy, Spain, and parts of the Balkans. It thrives in temperate climates and is commonly found in woodlands, hedgerows, and rocky areas. This compact form of the European horse chestnut is well adapted to a variety of soil types and can tolerate partial shade. It is often used in horticulture for its ornamental value and hardy nature. The plant's native range reflects its historical presence in the natural landscapes of Europe.",
    "distribution_introduced_art_desc": "Acer campestre f. compactum was mainly introduced to urban and suburban landscapes due to its compact growth habit and ornamental value. It is often used as a hedge or specimen plant in gardens and public spaces. This introduction has led to its establishment in some areas beyond its native range. The plant's ability to thrive in various soil types and its tolerance to pollution make it a popular choice for landscaping. However, its spread can sometimes pose a risk to native plant communities if not managed properly."
}
