{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum var. kaiscianense",
    "plant_slug": "acer-buergerianum-var-kaiscianense",
    "plant_name_scientific": "acer buergerianum var. kaiscianense",
    "intro": "Acer buergerianum var. kaiscianense, commonly known as the Kaisi maple, is a rare and distinctive variant of the maple genus native to the mountainous regions of China. It is characterized by its striking, palmately lobed leaves that turn vibrant shades of red and orange in the fall. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in cool, moist environments and is often found in shaded forest understories. Due to its limited distribution and unique morphology, it is of interest to botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer buergerianum"
    },
    "taxonomy_art_desc": "Acer buergerianum var. kaiscianense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Sapindales, which comprises a variety of flowering plants, many of which are known for their ornamental value and fruit production. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with often showy flowers and tropical origins. Its genus is Acer, which includes the maple trees, known for their distinctive leaves and samaras, commonly found in temperate regions. Its species is Acer buergerianum, a type of maple native to East Asia, characterized by its unique leaf shape and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum var. kaiscianense is primarily native to China North-Central and China South-Central. This variant of the maple tree is found in specific regions within these areas, typically in mountainous or forested habitats. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed forests and is part of the natural flora in these regions. Its distribution is limited to these geographic areas, reflecting its ecological preferences and historical range.",
    "distribution_introduced_art_desc": "Acer buergerianum var. kaiscianense was mainly introduced to urban and suburban landscapes in North America as an ornamental tree due to its attractive foliage and adaptability. It is often planted for its vibrant autumn color and compact size, making it suitable for smaller gardens and street-side planting. However, its introduction has raised concerns due to its potential to become invasive in certain regions. The plant's ability to spread through seed dispersal by wind and animals has led to its establishment in natural areas. Despite its aesthetic appeal, careful management is recommended to prevent ecological disruption."
}
