{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum var. villipes",
    "plant_slug": "acer-barbatum-var-villipes",
    "plant_name_scientific": "acer barbatum var. villipes",
    "intro": "Acer barbatum var. villipes, commonly known as the Japanese maple, is a deciduous shrub or small tree native to Japan. It is characterized by its delicate, palmate leaves that turn vibrant shades of red and orange in the fall. The plant typically grows to a height of 3 to 6 meters, with a broad, spreading crown. Its flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring. The bark is smooth and reddish-brown, becoming more fissured with age.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum var. villipes is primarily native to the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Jiangxi, and Hubei. It thrives in humid, temperate climates at elevations ranging from 500 to 1,500 meters. This variety is commonly found in forested areas, often growing in association with other shade-tolerant species. It is well adapted to the moist, well-drained soils of its native habitat. Due to its limited range, it is considered a rare and endemic species within its geographic distribution.",
    "distribution_introduced_art_desc": "Acer barbatum var. villipes was mainly introduced to the northeastern United States and parts of Canada. It was brought there primarily for its ornamental value due to its unique foliage and growth habits. This variety is often cultivated in gardens and parks for its aesthetic appeal. However, it has also been reported to spread into natural areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact in non-native regions."
}
