{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre schwerinii",
    "plant_slug": "acer-campestre-schwerinii",
    "plant_name_scientific": "acer campestre schwerinii",
    "intro": "Acer campestre schwerinii, commonly known as the Schwerin hedge maple, is a cultivar of the common maple tree. It is characterized by its dense, upright growth habit and is often used as a hedge or privacy screen. The plant features oval-shaped leaves that are typically dark green on top and lighter green underneath. It produces small, yellowish-green flowers in early spring, followed by red or orange-red samaras in the fall. This variety is valued for its ornamental qualities and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre schwerinii is primarily native to Central Europe, particularly Germany and the surrounding regions. It is found in areas with moist, well-drained soils and is often associated with forest understories. This species is commonly distributed in the lowlands and hills of Central Europe, including parts of Poland, the Czech Republic, and Austria. It thrives in temperate climates and is adapted to a variety of soil types. Due to its ornamental value, it has been cultivated beyond its native range in many parts of the world.",
    "distribution_introduced_art_desc": "Acer campestre schwerinii was mainly introduced to Europe in the 19th century as an ornamental tree due to its attractive foliage and adaptability. It was particularly popular in the United Kingdom and parts of western Europe for its compact size and vibrant autumn colors. The introduction of this species was part of broader efforts to enhance urban and garden landscapes with non-native tree species. Despite its ornamental value, it has since naturalized in some areas, raising concerns about its impact on local ecosystems. Its distribution today includes parts of Europe, especially in regions with temperate climates."
}
