{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subsp. hebecarpum",
    "plant_slug": "acer-campestre-subsp-hebecarpum",
    "plant_name_scientific": "acer campestre subsp. hebecarpum",
    "intro": "Acer campestre subsp. hebecarpum, commonly known as the narrow-leaved maple, is a deciduous shrub or small tree native to Europe and western Asia. It typically grows to a height of 3–8 meters, featuring a rounded crown and slender branches. The leaves are ovate to elliptic, with a serrated margin and a dark green upper surface. In the autumn, it produces vibrant red or orange foliage, making it a striking ornamental plant. Its samaras, or winged seeds, are distinctive and contribute to its ecological role in supporting wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre subsp. hebecarpum is primarily native to southern and central Europe, including countries such as France, Italy, Spain, and Portugal. This subspecies is also found in parts of North Africa, particularly in regions like Morocco and Algeria. It thrives in temperate climates and is commonly found in woodlands, hedgerows, and rocky soils. The plant is well adapted to mild winters and can tolerate some degree of shade. Its distribution is closely associated with areas that have a Mediterranean climate or transitional zones between continental and Mediterranean regions.",
    "distribution_introduced_art_desc": "Acer campestre subsp. hebecarpum was mainly introduced to areas where its unique characteristics, such as its cold tolerance and adaptability to poor soils, make it suitable for ecological restoration and ornamental landscaping. It has been introduced in regions of Europe, particularly in the British Isles, where it thrives in moist, shaded environments. The plant's ability to grow in urban settings has also contributed to its introduction in cities with green space initiatives. However, its spread has been limited due to its specific habitat requirements and slower growth rate compared to other maple species. Despite its introduction, it remains a relatively rare and localized species in most regions."
}
