{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bodinieri",
    "plant_slug": "acer-bodinieri",
    "plant_name_scientific": "acer bodinieri",
    "intro": "Acer bodinieri, commonly known as the Bodinier maple, is a deciduous tree native to Southeast Asia. It is characterized by its striking, palmately lobed leaves that turn vibrant shades of red and orange in the fall. The tree produces small, yellowish-green flowers in early spring, followed by samaras with winged seeds. It typically grows to a height of 10-20 meters and prefers well-drained, acidic soils. Due to its ornamental value, it is often cultivated in gardens and parks for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bodinieri is primarily native to the mountainous regions of China, specifically in the provinces of Sichuan, Yunnan, and Guizhou. It thrives in temperate climates at high altitudes, often found in forested areas with well-drained soils. This species is adapted to the cool and moist conditions typical of these regions. It is commonly found in the Hengduan Mountains and other parts of the eastern Himalayas. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer bodinieri was mainly introduced to regions with temperate climates where it can thrive in well-drained soils. It is commonly found in areas with mild winters and warm summers, making it suitable for gardens and urban landscapes. This plant is valued for its ornamental qualities, including its striking foliage and unique leaf shape. It has been introduced to several countries in Europe and North America as a decorative tree. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
