{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum subsp. bodinieri",
    "plant_slug": "acer-amplum-subsp-bodinieri",
    "plant_name_scientific": "acer amplum subsp. bodinieri",
    "intro": "Acer amplum subsp. bodinieri, commonly known as the Bohemian maple, is a deciduous tree native to Central Europe. It is characterized by its palmate leaves with five to seven lobes, which are typically green on the upper surface and lighter in color on the underside. The tree produces small, yellow-green flowers in early spring, followed by winged seeds that are dispersed by the wind. It thrives in moist, well-drained soils and is often found in riparian zones or along stream banks. The Bohemian maple is valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer amplum"
    },
    "taxonomy_art_desc": "Acer amplum subsp. bodinieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Sapindales, a group of flowering plants that includes many trees and shrubs, often with showy flowers and fruits. Its family is Sapindaceae, commonly known as the soapberry family, which includes a variety of trees and shrubs with distinctive fruit types. Its genus is Acer, commonly known as maple, which includes a wide range of deciduous trees and shrubs known for their colorful autumn foliage. Its species is Acer amplum, a specific type of maple that is further divided into subspecies, with Acer amplum subsp. bodinieri being one of its recognized subspecies.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum subsp. bodinieri is primarily native to China South-Central, China Southeast, and Vietnam. This species is commonly found in mountainous regions within these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed forests and rocky slopes. Its distribution reflects its adaptation to the diverse ecosystems of southern China and neighboring regions.",
    "distribution_introduced_art_desc": "Acer amplum subsp. bodinieri was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It thrives in environments where it can receive adequate moisture without being waterlogged. This subspecies is often found in forest edges, stream banks, and rocky slopes. Its introduction has been noted in several regions outside its native range, including parts of Europe and North America. Due to its adaptability and ornamental value, it has been cultivated for landscaping and ecological restoration purposes."
}
