{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer catalpifolium",
    "plant_slug": "acer-catalpifolium",
    "plant_name_scientific": "acer catalpifolium",
    "intro": "Acer catalpifolium, commonly known as the Catalpa-leaf maple, is a deciduous tree native to China. It is characterized by its heart-shaped leaves that resemble those of the catalpa tree, hence its common name. The plant produces small, yellowish-green flowers in clusters, which appear before the leaves in early spring. Its fruits are samaras, which are winged seeds that aid in wind dispersal. The tree is valued for its ornamental appeal and is often cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer catalpifolium is primarily native to China, specifically the regions of Sichuan, Yunnan, and Guizhou. It is commonly found in mountainous areas at elevations ranging from 1,500 to 3,000 meters. This species thrives in temperate climates with well-drained soils and is often found in mixed forests. It is known for its distinctive heart-shaped leaves and showy white flowers that bloom in early spring. The plant plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acer catalpifolium was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and floral characteristics. It has been cultivated in gardens and parks, particularly in regions with temperate climates. The plant's introduction has led to its presence in various states, including Pennsylvania, New York, and Virginia. Despite its ornamental value, it is considered a non-native species in these areas. Its distribution is primarily limited to cultivated settings rather than natural habitats."
}
