{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer capillipes subsp. insulare",
    "plant_slug": "acer-capillipes-subsp-insulare",
    "plant_name_scientific": "acer capillipes subsp. insulare",
    "intro": "Acer capillipes subsp. insulare, commonly known as the Ryukyu maple, is a deciduous shrub or small tree native to the Ryukyu Islands of Japan. It is characterized by its finely serrated, palmate leaves that turn vibrant red or orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in moist, shaded environments and is often found in mountainous regions. Its ornamental value makes it a popular choice for horticultural cultivation in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer capillipes subsp. insulare is primarily native to the Ryukyu Islands, including Okinawa, Ishigaki, and Iriomote in Japan. This subspecies is commonly found in moist, shaded forest environments on these tropical islands. It thrives in coastal and lowland areas with high humidity and moderate temperatures. The plant is often associated with limestone substrates and is an important component of the island's understory vegetation. Due to its limited distribution, it is considered a rare and endemic species within the Ryukyu archipelago.",
    "distribution_introduced_art_desc": "Acer capillipes subsp. insulare was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in forested or woodland environments. It thrives in temperate climates and is often found in regions with cool summers and mild winters. This subspecies is commonly used in horticulture for its ornamental value, including its vibrant fall foliage and unique leaf structure. It has been introduced to several regions beyond its native habitat, including parts of North America and Europe. However, its introduction has raised concerns about its potential impact on local ecosystems due to its adaptability and growth rate."
}
