{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. citreovariegatum",
    "plant_slug": "acer-dasycarpum-f-citreovariegatum",
    "plant_name_scientific": "acer dasycarpum f. citreovariegatum",
    "intro": "Acer dasycarpum f. citreovariegatum, commonly known as the variegated maple, is a decorative cultivar of the maple tree characterized by its distinctive leaf patterns. The leaves are typically heart-shaped with a serrated margin and display a striking combination of yellow, white, and green variegation. This plant is native to China and thrives in temperate climates, preferring well-drained soil and partial to full sunlight. It produces small, red or orange flowers in early spring, followed by winged seeds in the fall. The variegated maple is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. citreovariegatum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. This variegated form of the Chinese maple is typically found in high-altitude forests and rocky slopes at elevations ranging from 2,000 to 3,500 meters. It thrives in cool, moist climates with well-drained soils, often growing in mixed deciduous forests. The plant is adapted to the unique ecological conditions of its native habitat, which includes significant temperature variations and seasonal rainfall patterns. Its natural distribution is closely linked to the biodiversity of the Himalayan and adjacent mountain ranges.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. citreovariegatum was mainly introduced to ornamental horticulture and landscape design due to its unique foliage characteristics. It is valued for its vibrant yellow and green variegated leaves, which add visual interest to gardens and urban environments. This cultivar is commonly found in temperate regions where it is cultivated for its aesthetic appeal rather than for its ecological role. It is often used in parks, public spaces, and private gardens to enhance the visual diversity of plant collections. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
