{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. cultratum",
    "plant_slug": "acer-cappadocicum-var-cultratum",
    "plant_name_scientific": "acer cappadocicum var. cultratum",
    "intro": "Acer cappadocicum var. cultratum, commonly known as the Cappadocian maple, is a deciduous tree native to Turkey. It is characterized by its distinctive palmate leaves that are often lobed and have a serrated edge. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by wind. It typically grows in mountainous regions and is adapted to rocky, well-drained soils. The varietal form cultratum is distinguished by its more elongated leaf lobes compared to the typical species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. cultratum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. This variety of the maple tree is commonly found in rocky and mountainous areas, particularly in the Cappadocia region of Turkey. It thrives in temperate climates with well-drained soils and is often associated with limestone formations. The plant is adapted to dry and semi-arid environments, making it a characteristic species of the region's flora. Its distribution is relatively limited, reflecting its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. cultratum was mainly introduced to specific regions in the United States, particularly in the southeastern states, as a ornamental tree due to its unique foliage and adaptability. It has been cultivated in gardens and parks for its aesthetic appeal, especially its striking copper-colored leaves in the fall. Despite its ornamental value, it is considered an invasive species in some areas, outcompeting native plants and altering local ecosystems. The distribution is largely limited to areas where it has been intentionally planted by horticulturists and landscape designers. However, its spread has been restricted by environmental factors and human intervention in certain regions."
}
