{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer aidzuense",
    "plant_slug": "acer-aidzuense",
    "plant_name_scientific": "acer aidzuense",
    "intro": "Acer aidzuense, commonly known as the Aizu maple, is a deciduous tree native to Japan. It is characterized by its vibrant autumn foliage, which displays shades of red, orange, and yellow. The plant has simple, alternate leaves that are usually ovate to elliptical in shape. It produces small, yellowish-green flowers in early spring, followed by winged seeds. This species is valued for its ornamental qualities and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer aidzuense is primarily native to Japan, specifically the island of Honshu. It is found in the mountainous regions of central and northern Honshu, where it thrives in cool, moist climates. This species is commonly associated with forested areas and is often found in the understory of mixed deciduous forests. It is a small to medium-sized tree that prefers well-drained soils and partial to full shade. Due to its limited distribution, Acer aidzuense is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acer aidzuense was mainly introduced to Japan, where it has been cultivated in gardens and as an ornamental plant. It is native to China and has been introduced to several other regions for its aesthetic value. The plant is known for its distinctive leaves and is often used in horticulture. It thrives in temperate climates and requires well-drained soil. Despite its ornamental appeal, it is not widely naturalized in the wild outside its introduced areas."
}
