{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. longifolium",
    "plant_slug": "acer-dasycarpum-var-longifolium",
    "plant_name_scientific": "acer dasycarpum var. longifolium",
    "intro": "Acer dasycarpum var. longifolium, commonly known as the long-leaved maple, is a deciduous tree native to the mountainous regions of central and southern China. It is characterized by its distinctive, elongated leaves that are typically 5 to 10 inches long and have a serrated margin. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. Its bark is smooth and grayish-brown, with shallow furrows that become more pronounced as the tree matures. This species is valued for its ornamental appeal and is often cultivated in gardens for its vibrant fall foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. longifolium is primarily native to the mountainous regions of central and western China, including the provinces of Sichuan, Yunnan, and Tibet. It thrives in temperate to cold climates at high altitudes, often found in mixed forests and on rocky slopes. This variety is adapted to the harsh conditions of the Himalayan foothills and adjacent areas. Its natural range extends into parts of northern India and Nepal as well. It is commonly found in elevations ranging from 2,000 to 4,000 meters above sea level.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. longifolium was mainly introduced to areas with temperate climates that provide well-drained soil and partial to full sunlight. This variety is particularly suited for regions with mild winters and warm summers, making it a popular choice for ornamental gardening. It is often planted in parks, along streets, and in private gardens due to its attractive foliage and adaptability. The introduction of this plant has enhanced biodiversity in urban and suburban landscapes. However, it requires regular maintenance to thrive in non-native environments."
}
