{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer creticum f. parvifolium",
    "plant_slug": "acer-creticum-f-parvifolium",
    "plant_name_scientific": "acer creticum f. parvifolium",
    "intro": "Acer creticum f. parvifolium, commonly known as the narrow-leaved maple, is a variant of the European maple characterized by its smaller, more delicate leaves. It is a deciduous tree or shrub native to parts of Europe and western Asia. The leaves are typically ovate to elliptical in shape, with a serrated margin and a pale green underside. It produces small, yellowish-green flowers in early spring, followed by red or orange samaras in late summer. This plant is valued for its ornamental appeal and is often cultivated in gardens for its aesthetic foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer creticum f. parvifolium is primarily native to the mountainous regions of central and southern Europe, particularly in the Alps and Carpathian Mountains. This plant thrives in rocky and well-drained soils at elevations ranging from 1,000 to 2,500 meters. It is commonly found in forested areas and open slopes, often growing in association with other alpine flora. The species is adapted to cool, temperate climates and is known for its small, ovate leaves and distinctive red autumn foliage. Its limited distribution reflects its specific ecological requirements and preference for high-altitude environments.",
    "distribution_introduced_art_desc": "Acer creticum f. parvifolium was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It thrives in temperate climates and is often found in woodland edges or along stream banks. This plant is known for its small, delicate leaves and bright red autumn foliage. It has been cultivated for ornamental purposes due to its aesthetic appeal. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
