{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cavaleriei",
    "plant_slug": "acer-cavaleriei",
    "plant_name_scientific": "acer cavaleriei",
    "intro": "Acer cavaleriei, commonly known as the Chinese maple, is a deciduous tree native to China. It is characterized by its palmate leaves that turn vibrant shades of red and yellow in the fall. The tree produces small, yellowish-green flowers in the spring, followed by winged samaras as its fruit. It typically grows to a height of 10–20 meters and prefers well-drained soil. The bark is smooth and grayish-brown, with shallow furrows that become more pronounced as the tree matures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cavaleriei is primarily native to the mountainous regions of central and southern China, particularly in provinces such as Sichuan, Yunnan, and Hubei. It thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,000 meters. This species is commonly found in mixed forests and along stream banks in these areas. It is well adapted to the humid and often misty conditions of its native habitat. Due to its ornamental value, it is sometimes cultivated outside its natural range.",
    "distribution_introduced_art_desc": "Acer cavaleriei was mainly introduced to the northeastern United States as an ornamental tree due to its unique foliage and aesthetic appeal. It was first brought to North America in the early 20th century by botanists and horticulturists interested in introducing exotic species. The plant has since been cultivated in gardens and parks, particularly in regions with temperate climates. However, it is not considered invasive and has not established itself in the wild. Its introduction has contributed to the diversity of cultivated tree species in the region."
}
