{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum f. commune",
    "plant_slug": "acer-barbatum-f-commune",
    "plant_name_scientific": "acer barbatum f. commune",
    "intro": "Acer barbatum f. commune, commonly known as the Japanese maple, is a cultivar of the maple tree native to Japan. It is characterized by its delicate, lace-like leaves that display a range of colors from bright green to vibrant red and orange, especially in the fall. The plant typically grows as a small to medium-sized tree or shrub, reaching heights of up to 10 meters. It prefers well-drained soil and partial to full sun, making it a popular choice for ornamental gardening. Its unique foliage and seasonal color changes make it a standout feature in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum f. commune is primarily native to the mountainous regions of eastern Asia, including parts of China, Korea, and Japan. It thrives in temperate climates with well-drained soils and is commonly found in forested areas at elevations ranging from 1,000 to 3,000 meters. This variety is particularly adapted to cool, moist environments and is often associated with mixed deciduous forests. Its natural range extends into the Korean Peninsula and the eastern Himalayas. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most closely tied to its native habitat in East Asia.",
    "distribution_introduced_art_desc": "Acer barbatum f. commune was mainly introduced to the northeastern United States and southeastern Canada. It was introduced as an ornamental tree due to its unique foliage and adaptability to various soil types. This plant is commonly found in urban and suburban landscapes where it thrives in partial to full sun. It has been widely cultivated for its aesthetic value and relatively low maintenance requirements. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
