{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. corniforme",
    "plant_slug": "acer-campestre-f-corniforme",
    "plant_name_scientific": "acer campestre f. corniforme",
    "intro": "Acer campestre f. corniforme, commonly known as the weeping maple, is a unique cultivar of the common maple. It is characterized by its cascading branches that create a distinctive, flowing appearance. The leaves are typically oval-shaped and turn vibrant shades of red in the fall. This plant thrives in moist, well-drained soils and partial to full sunlight. It is often used in landscaping for its ornamental value and ability to add a graceful touch to gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. corniforme is primarily native to parts of Europe, including the British Isles, western France, and southern Germany. This plant is commonly found in woodlands, hedgerows, and along the edges of forests. It thrives in temperate climates with well-drained soils. The species is known for its distinctive, umbrella-shaped growth habit, which gives it a unique appearance. It is often used in landscaping due to its ornamental value and adaptability to various soil conditions.",
    "distribution_introduced_art_desc": "Acer campestre f. corniforme was mainly introduced to urban and suburban landscapes due to its ornamental value and adaptability to various soil types. It is commonly found in parks, along streets, and in residential areas where it serves as a decorative tree. This variety is prized for its unique, twisted branches that create an attractive, sculptural appearance. It thrives in full sun to partial shade and is relatively low maintenance once established. However, it may require periodic pruning to maintain its shape and prevent structural issues."
}
