{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. hebercarpum",
    "plant_slug": "acer-campestre-var-hebercarpum",
    "plant_name_scientific": "acer campestre var. hebercarpum",
    "intro": "Acer campestre var. hebercarpum, commonly known as the Hebercarpum maple, is a variant of the field maple, characterized by its distinctive leaf morphology. This plant typically exhibits palmately lobed leaves with serrated edges, which are often a vibrant green during the growing season. It thrives in temperate climates and prefers well-drained, acidic soils. The Hebercarpum maple is known for its ornamental value, particularly in autumn when its foliage displays shades of red and orange. It is a relatively slow-growing shrub or small tree, often used in horticulture for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. hebercarpum is primarily native to the mountainous regions of central and southern Europe, including parts of Italy, Austria, and the Balkans. This variety of the common horse chestnut is adapted to temperate climates and thrives in well-drained soils. It is commonly found in forested areas and along riverbanks, where it benefits from partial shade and moist conditions. The plant is known for its ornamental value, with distinctive foliage and showy white flowers. Its native range reflects its historical distribution across the European continent.",
    "distribution_introduced_art_desc": "Acer campestre var. hebercarpum was mainly introduced to the United States as an ornamental plant due to its unique foliage and hardy nature. It is commonly found in gardens and landscaped areas across the eastern and central regions of the country. This variety is valued for its bright yellow autumn color and compact growth habit. However, it has also been reported to spread into natural areas, raising concerns about its potential invasiveness. Despite its ornamental appeal, its ecological impact remains a topic of ongoing study."
}
