{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum subsp. catalpifolium",
    "plant_slug": "acer-amplum-subsp-catalpifolium",
    "plant_name_scientific": "acer amplum subsp. catalpifolium",
    "intro": "Acer amplum subsp. catalpifolium, commonly known as the Catalpa-leaved maple, is a rare and distinctive subspecies native to parts of eastern Europe. It is characterized by its large, heart-shaped leaves that resemble those of the catalpa tree, giving it its common name. The plant typically grows in moist, calcareous soils and is often found in woodland areas or along streambanks. Its flowers are small, yellowish-green, and appear in clusters, followed by winged samaras that aid in seed dispersal. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species in many regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer amplum"
    },
    "taxonomy_art_desc": "Acer amplum subsp. catalpifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and leaves. Its class is Equisetopsida, a group that includes ferns, horsetails, and other primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Sapindales, which comprises a diverse group of flowering plants, including many with fruits that split open to release seeds. Its family is Sapindaceae, known as the soapberry family, which includes trees and shrubs with often showy flowers. Its genus is Acer, commonly known as maples, which are well-known for their ornamental leaves and edible fruits. Its species is Acer amplum, a maple species native to eastern Asia, known for its distinctive leaves and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum subsp. catalpifolium is primarily native to China South-Central and China Southeast. This subspecies is found in regions that include parts of southern and central China. It typically grows in mountainous areas and forested regions within its native range. The plant thrives in temperate climates with well-drained soils. Its distribution is limited to specific ecological niches within these geographic areas.",
    "distribution_introduced_art_desc": "Acer amplum subsp. catalpifolium was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forest understories and along stream banks. This subspecies has been reported in Washington, Oregon, and northern California. It is often mistaken for the native catalpa species due to its similar leaf shape. Its introduction has raised concerns about potential ecological impacts on local flora."
}
