{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. aegaeicum",
    "plant_slug": "acer-campestre-f-aegaeicum",
    "plant_name_scientific": "acer campestre f. aegaeicum",
    "intro": "Acer campestre f. aegaeicum, commonly known as the dwarf maple, is a compact variety of the common maple. It is characterized by its small, rounded leaves that are typically green in summer and turn vibrant red or orange in the autumn. The plant has a slow growth rate, making it ideal for small spaces or as a decorative shrub. It prefers well-drained soil and partial to full sun exposure. Its ornamental value comes from its seasonal color changes and compact form.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. aegaeicum is primarily native to southern and central Europe, including regions such as Italy, France, Spain, and parts of the Balkans. This variety of the common maple is typically found in woodland margins, rocky slopes, and open hillsides. It thrives in temperate climates with well-drained soils and partial to full sun exposure. The plant is known for its distinctive foliage, which often displays a striking yellow or orange hue in the autumn. It is a hardy species that has adapted well to a variety of ecological conditions across its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. aegaeicum was mainly introduced to Europe, particularly in the United Kingdom and parts of northern Europe, as an ornamental plant due to its attractive foliage and compact growth habit. It is commonly found in gardens, parks, and along roadsides where it thrives in well-drained soils and full sun to partial shade. The introduction of this plant has led to its establishment in some natural habitats, raising concerns about its potential invasiveness in certain regions. Despite its ornamental value, it is not considered a major ecological threat in most areas where it is cultivated. Its distribution is primarily limited to human-modified landscapes rather than wild, natural environments."
}
