{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. aureovariegatum",
    "plant_slug": "acer-dasycarpum-var-aureovariegatum",
    "plant_name_scientific": "acer dasycarpum var. aureovariegatum",
    "intro": "Acer dasycarpum var. aureovariegatum, commonly known as the golden-leaved maple, is a deciduous tree native to the Himalayas. It is characterized by its striking foliage, which displays a vibrant yellow variegation during the growing season. The leaves are typically palmately lobed and turn brilliant red or orange in the fall. It produces small, red flowers in early spring, followed by winged seeds that are dispersed by the wind. This ornamental tree is valued for its aesthetic appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. aureovariegatum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. It thrives in temperate climates with high humidity and well-drained soil. This variety is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. It is often associated with mixed deciduous and coniferous forests. The plant is known for its striking yellow-variegated leaves, making it a popular ornamental species.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. aureovariegatum was mainly introduced to ornamental horticulture due to its attractive yellow-variegated foliage. It is commonly found in gardens and parks where its unique leaf patterns add visual interest. The plant is typically cultivated in temperate climates with well-drained soil and partial sunlight. Its introduction has been limited to specific regions where it can thrive without becoming invasive. Despite its ornamental value, it is not widely distributed in the wild."
}
