{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii",
    "plant_slug": "acer-campbellii",
    "plant_name_scientific": "acer campbellii",
    "intro": "Acer campbellii, commonly known as the Campbell's maple, is a deciduous tree native to the mountainous regions of central China. It is characterized by its distinctive, deeply lobed leaves that turn vibrant shades of red and orange in the fall. The tree typically grows to a height of 10 to 15 meters, with a broad, rounded canopy. Its small, yellowish-green flowers appear in early spring before the leaves emerge. The bark is smooth and greyish-brown, becoming fissured with age, and the tree is prized for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campbellii"
    },
    "taxonomy_art_desc": "Acer campbellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, a group of flowering plants that includes trees and shrubs with showy flowers and often aromatic fruits. Its family is Sapindaceae, commonly known as the soapberry family, which includes a variety of trees and shrubs with compound leaves and fleshy fruits. Its genus is Acer, commonly known as maples, which are well-known deciduous trees with distinctive foliage and samaras. Its species is Acer campbellii, a rare maple native to New Zealand, characterized by its unique foliage and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Laos",
        "Myanmar",
        "Nepal",
        "Tibet",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii is primarily native to China South-Central, China Southeast, East Himalaya, Laos, Myanmar, Nepal, Tibet, Vietnam, West Himalaya. This species is commonly found in mountainous regions across these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with forested areas and rocky slopes. Its native range spans a diverse geographical region in Asia.",
    "distribution_introduced_art_desc": "Acer campbellii was mainly introduced to North America as an ornamental tree due to its unique appearance and cold hardiness. It is commonly found in gardens and parks, particularly in regions with temperate climates. The plant has been cultivated for its striking red foliage in the fall, making it a popular choice among horticulturists. However, it is not native to North America and has been introduced primarily through horticultural trade. Its distribution is limited to areas where it has been intentionally planted by humans."
}
