{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. platypterum",
    "plant_slug": "acer-campestre-f-platypterum",
    "plant_name_scientific": "acer campestre f. platypterum",
    "intro": "Acer campestre f. platypterum, commonly known as the flat-leaf field maple, is a cultivar of the European field maple. It is characterized by its broad, ovate leaves that are typically smaller and flatter than those of the typical species. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. It is a hardy, deciduous tree or shrub that thrives in well-drained soils and full sun. This cultivar is often used in landscaping for its ornamental value and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. platypterum is primarily native to southern and central Europe, including countries such as Spain, Italy, France, and parts of the Balkans. This subspecies is commonly found in woodlands, hedgerows, and open areas with well-drained soils. It thrives in temperate climates and is often associated with mixed forests and shrublands. The plant is known for its distinctive broad, flat-lobed leaves and is often used in horticulture for its ornamental value. Its distribution is closely linked to the historical expansion of human activity and natural vegetation patterns in the region.",
    "distribution_introduced_art_desc": "Acer campestre f. platypterum was mainly introduced to urban and suburban landscapes for its ornamental value. It is valued for its compact size, attractive foliage, and ability to thrive in a variety of soil conditions. This cultivar is often used in gardens and as a street tree due to its tolerance of pollution and compact growth habit. It has been widely planted in Europe and North America as a decorative plant. However, its introduction has raised concerns about its potential to become invasive in certain regions."
}
