{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amoenum f. latialatum",
    "plant_slug": "acer-amoenum-f-latialatum",
    "plant_name_scientific": "acer amoenum f. latialatum",
    "intro": "Acer amoenum f. latialatum, commonly known as the broad-leaf maple, is a striking ornamental tree characterized by its large, palmately lobed leaves that turn vibrant shades of red and orange in autumn. Native to China, this variety is prized for its showy, clusters of small yellow flowers that appear before the leaves in early spring. The tree typically grows to a height of 10-15 meters, with a rounded crown and smooth, grey bark. It thrives in full sun to partial shade and prefers well-drained, fertile soil. Due to its aesthetic appeal, it is often cultivated in gardens and parks for its seasonal color changes and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amoenum f. latialatum is primarily native to China, specifically the provinces of Sichuan and Yunnan. This plant thrives in the mountainous regions of these areas, where it is found in forests and on rocky slopes. It is commonly associated with humid temperate climates and is often found at elevations ranging from 1,500 to 3,000 meters. The species is known for its distinctive foliage and is a valued ornamental plant in horticulture. Its natural habitat is characterized by well-drained soils and partial to full shade.",
    "distribution_introduced_art_desc": "Acer amoenum f. latialatum was mainly introduced to regions with temperate climates that provide adequate moisture and well-drained soils. It is commonly found in areas where it has been cultivated for ornamental purposes due to its attractive foliage. This plant thrives in partial shade to full sun and is often used in landscaping and gardens. Its introduction has been noted in parts of North America and Europe, where it has been adapted to local conditions. However, its spread is generally limited to cultivated areas and does not typically invade natural ecosystems."
}
