{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatum",
    "plant_slug": "acer-caudatum",
    "plant_name_scientific": "acer caudatum",
    "intro": "Acer caudatum, commonly known as the weeping maple, is a deciduous tree native to the eastern United States. It is characterized by its distinctive cascading branches that create a weeping appearance, giving it a unique and ornamental look. The tree produces small, inconspicuous greenish-yellow flowers in early spring, followed by winged seeds that are dispersed by the wind. Its leaves are palmately lobed, turning vibrant shades of red and yellow in the fall. Acer caudatum thrives in moist, well-drained soils and is often found in riparian zones and along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer caudatum"
    },
    "taxonomy_art_desc": "Acer caudatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a true root system and vascular tissue. Its class is Equisetopsida, a group that includes ferns and their allies, characterized by their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Sapindales, which consists of flowering plants with distinctive features such as stipules and flowers with five petals. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with compound leaves and showy flowers. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs known for their distinctive leaves and colorful autumn foliage. Its species is Acer caudatum, commonly known as the weeping maple, a small tree native to the southeastern United States, recognized for its drooping branches and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Inner Mongolia",
        "Myanmar",
        "Nepal",
        "Tibet",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatum is primarily native to Assam, China North-Central, China South-Central, China Southeast, East Himalaya, Inner Mongolia, Myanmar, Nepal, Tibet, West Himalaya. It is commonly found in mountainous regions across these areas. This species thrives in temperate climates with well-drained soils. It is often associated with forested areas at higher elevations. Its natural range spans a wide geographic area across eastern and central Asia.",
    "distribution_introduced_art_desc": "Acer caudatum was mainly introduced to the eastern United States, particularly in areas with moist, well-drained soils. It is commonly found in forested regions, often growing in association with other shade-tolerant species. The plant is valued for its ornamental qualities, including its striking red foliage in the fall. It has been cultivated in gardens and parks for its aesthetic appeal. However, it is considered invasive in some regions due to its rapid spread and ability to outcompete native vegetation."
}
