{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. quinquelobum",
    "plant_slug": "acer-campestre-f-quinquelobum",
    "plant_name_scientific": "acer campestre f. quinquelobum",
    "intro": "Acer campestre f. quinquelobum, commonly known as the five-lobed field maple, is a variant of the field maple tree native to Europe. It is characterized by its distinctive five-lobed leaves that are typically gray-green in color and have a serrated margin. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. It thrives in well-drained soils and is often found in woodland edges or open areas. This cultivar is valued for its ornamental appeal and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. quinquelobum is primarily native to Europe, particularly in the temperate regions of the continent. This subspecies is commonly found in the British Isles, including England, Wales, and parts of Ireland. It also occurs in southern Scandinavia and extends into parts of northern France and western Germany. It thrives in woodland edges, hedgerows, and open areas with well-drained soil. This plant is well adapted to mild climates and is often seen as a characteristic element of traditional landscapes.",
    "distribution_introduced_art_desc": "Acer campestre f. quinquelobum was mainly introduced to urban and suburban landscapes for its ornamental value. It is valued for its distinctive five-lobed leaves and its ability to thrive in a variety of soil conditions. This cultivar is often used in landscaping due to its adaptability and aesthetic appeal. It has become a popular choice for street trees and garden plantings in temperate regions. However, its introduction has raised concerns about its potential impact on native plant communities."
}
