{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. pendulum",
    "plant_slug": "acer-dasycarpum-var-pendulum",
    "plant_name_scientific": "acer dasycarpum var. pendulum",
    "intro": "Acer dasycarpum var. pendulum, commonly known as the weeping maple, is a variant of the hairy maple characterized by its distinctive cascading branches. It is native to China and is valued for its ornamental appearance, with delicate, palmate leaves that turn vibrant colors in autumn. The plant typically grows as a small to medium-sized tree or shrub, reaching heights of up to 10 meters. Its flowers are inconspicuous, producing small greenish-yellow catkins, while the fruit is a samara with a winged structure. It thrives in temperate climates and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. pendulum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Hubei, and Shaanxi. It thrives in temperate climates with high altitudes, often found in mixed forests and on rocky slopes. This variety is known for its distinctive weeping growth habit, which makes it a striking ornamental plant. It prefers well-drained soil and partial to full sunlight, making it suitable for cultivation in cooler regions. The plant's natural range is limited, reflecting its adaptation to specific ecological conditions in its native habitat.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. pendulum was mainly introduced to ornamental horticulture and landscape design due to its unique weeping growth habit and aesthetic appeal. It is commonly cultivated in gardens and parks for its visual interest throughout the growing season. The plant is well-suited for temperate climates and can thrive in a variety of soil types with adequate drainage. Its introduction has expanded its presence in both private and public green spaces across regions with suitable growing conditions. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
