{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. lasiocarpum",
    "plant_slug": "acer-campestre-var-lasiocarpum",
    "plant_name_scientific": "acer campestre var. lasiocarpum",
    "intro": "Acer campestre var. lasiocarpum, commonly known as the downy maple, is a variant of the common maple. It is characterized by its distinctive hairy (pubescent) fruits, which set it apart from other maple varieties. The plant typically grows in woodland areas and thrives in well-drained soils. Its leaves are usually oval with a pointed tip and a serrated margin. This variety is valued for its ornamental appeal and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. lasiocarpum is primarily native to Europe, particularly in regions of the western and central parts of the continent. This variety of the common maple is found in countries such as France, Germany, and the United Kingdom. It thrives in temperate climates and is often associated with woodland edges and open habitats. The plant is known for its distinctive, hairy fruits and is a common sight in naturalized areas. Its distribution is largely limited to its native European range, though it may occasionally be found in other regions through cultivation.",
    "distribution_introduced_art_desc": "Acer campestre var. lasiocarpum was mainly introduced to regions with temperate climates where it can thrive in well-drained soils. It is commonly found in woodland edges, hedgerows, and open areas with partial shade. This variety is known for its distinctive hairy fruits, which set it apart from other maple species. It has been introduced as an ornamental plant due to its attractive autumn foliage and adaptability. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
