{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum f. rubrocarpum",
    "plant_slug": "acer-cappadocicum-f-rubrocarpum",
    "plant_name_scientific": "acer cappadocicum f. rubrocarpum",
    "intro": "Acer cappadocicum f. rubrocarpum, commonly known as the red-leaf maple, is a variant of the Cappadocian maple. It is characterized by its striking red foliage, which becomes more vibrant in the autumn. The plant is native to Turkey and thrives in temperate climates with well-drained soil. It typically grows as a small to medium-sized tree, reaching heights of up to 10 meters. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum f. rubrocarpum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. This plant is commonly found in rocky and mountainous areas, often growing in dry, sunny environments. It thrives in well-drained soils and is adapted to the temperate climate of its native habitat. The subspecies is known for its distinctive red-brown foliage, which adds to its ornamental value. Its distribution is limited to specific regions where the climate and soil conditions match its ecological requirements.",
    "distribution_introduced_art_desc": "Acer cappadocicum f. rubrocarpum was mainly introduced to the United States as an ornamental tree due to its distinctive red foliage. It is commonly found in gardens and urban landscapes, particularly in the eastern and midwestern regions. This variety is valued for its autumn color and compact growth habit, making it suitable for smaller spaces. However, it is considered invasive in some areas where it can outcompete native vegetation. Its introduction has led to increased management efforts in natural habitats to control its spread."
}
