{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii var. fantsipanense",
    "plant_slug": "acer-campbellii-var-fantsipanense",
    "plant_name_scientific": "acer campbellii var. fantsipanense",
    "intro": "Acer campbellii var. fantsipanense, commonly known as the Fantsipane maple, is a rare and ornamental tree native to the mountainous regions of western Africa. It is characterized by its striking, palmately lobed leaves that turn vibrant shades of red and orange in the fall. The plant thrives in cool, moist climates and is often found in shaded forest understories. Its small, clustered flowers appear in early spring, followed by winged seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii var. fantsipanense is primarily native to the mountainous regions of western Madagascar. This variety is found in the rainforests of the northeastern part of the island, specifically in the area known as the northeastern rainforest. It thrives in humid, shaded environments with high rainfall and rich, well-drained soils. The plant is endemic to this region and is not found anywhere else in the world. Due to its limited distribution, it is considered a rare and valuable species in its native habitat.",
    "distribution_introduced_art_desc": "Acer campbellii var. fantsipanense was mainly introduced to ornamental horticulture and botanical collections due to its unique foliage and ornamental value. It is commonly found in gardens and private collections in temperate regions where it is cultivated for its aesthetic appeal. The plant is often grown as a specimen tree or hedge, appreciated for its vibrant autumn colors and compact growth habit. Its introduction has been limited to specific areas with suitable climate conditions that mimic its native habitat. Despite its ornamental use, it remains a relatively rare and specialized plant in the horticultural trade."
}
