{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. brevialatum",
    "plant_slug": "acer-cappadocicum-var-brevialatum",
    "plant_name_scientific": "acer cappadocicum var. brevialatum",
    "intro": "Acer cappadocicum var. brevialatum, commonly known as the short-leaved maple, is a unique variant of the Cappadocian maple. It is characterized by its compact growth habit and shorter, broader leaves compared to the typical species. The leaves are typically dark green on top and lighter underneath, with a serrated edge. This variety is native to the Cappadocia region of Turkey and thrives in temperate climates. It is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. brevialatum is primarily native to the mountainous regions of central and southeastern Turkey, particularly in the Cappadocia area. This variety of the maple tree is adapted to the unique climatic and geological conditions of this region. It thrives in rocky, well-drained soils and is often found in forested areas at elevations ranging from 1,000 to 2,500 meters. The plant is known for its distinctive short, broad leaves and is a characteristic species of the local flora. Its distribution is relatively limited, making it a regionally significant and ecologically important tree.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. brevialatum was mainly introduced to the United States as an ornamental tree due to its unique foliage and adaptability to various soil conditions. It is commonly found in the eastern and central regions, particularly in states like Pennsylvania, New York, and Ohio. This variety is valued for its compact growth habit and vibrant fall colors, making it a popular choice for landscaping and urban forestry. However, it has also been reported in some areas where it may compete with native species. Its introduction has raised concerns about its potential impact on local ecosystems."
}
