{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cassiifolium",
    "plant_slug": "acer-cassiifolium",
    "plant_name_scientific": "acer cassiifolium",
    "intro": "Acer cassiifolium, commonly known as the Persian maple, is a deciduous tree native to the mountainous regions of Central Asia. It is characterized by its distinctive palmate leaves, which are typically lobed and turn vibrant shades of red and orange in the fall. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by the wind. It thrives in temperate climates with well-drained soil and is often found in rocky or mountainous habitats. Due to its ornamental value, it is occasionally cultivated in botanical gardens and arboreta.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cassiifolium is primarily native to the mountainous regions of Central Asia, particularly in countries such as Afghanistan, Pakistan, and northern India. It thrives in high-altitude environments, often found in forests and shrublands at elevations ranging from 1,500 to 3,500 meters. This species is adapted to cold and dry climates, making it a characteristic plant of the temperate and alpine zones. It is commonly found in rocky soils and is often associated with other high-altitude flora. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acer cassiifolium was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions with moderate rainfall. It thrives in sunny to partially shaded locations and is often found in forested or woodland environments. This plant is known for its distinctive palmate leaves and is valued for its ornamental appeal. It has been introduced to several parts of Europe and North America as a garden and landscape plant. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
