{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. sinense",
    "plant_slug": "acer-campbellii-subsp-sinense",
    "plant_name_scientific": "acer campbellii subsp. sinense",
    "intro": "Acer campbellii subsp. sinense, commonly known as the Chinese maple, is a deciduous tree native to eastern China. It belongs to the Acer genus in the Sapindaceae family and is characterized by its distinctive palmate leaves with five lobes. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras in the fall. It typically grows to a height of 8–12 meters and prefers well-drained, acidic soils. This ornamental tree is valued for its vibrant fall color and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. sinense is primarily native to China, specifically the provinces of Sichuan and Yunnan. It grows in mountainous regions at elevations ranging from 1,500 to 3,000 meters. This subspecies is typically found in humid, temperate forests with well-drained soils. It is a deciduous tree that thrives in areas with moderate rainfall and cool summers. Due to its limited natural range, it is considered a rare and endangered species in the wild.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. sinense was mainly introduced to the Pacific Northwest of the United States. It is commonly found in moist, shaded areas such as forests and streamside habitats. This species is valued for its ornamental qualities, including its distinctive foliage and growth habit. It has been cultivated in botanical gardens and private collections due to its unique appearance. However, it is not considered invasive and is generally easy to maintain in suitable conditions."
}
