{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. trilobum",
    "plant_slug": "acer-cappadocicum-var-trilobum",
    "plant_name_scientific": "acer cappadocicum var. trilobum",
    "intro": "Acer cappadocicum var. trilobum, commonly known as the Cappadocian maple, is a deciduous tree native to the Cappadocia region of Turkey. It is characterized by its distinctive trifoliate leaves, which are deeply lobed and give it a unique appearance. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by the wind. Its bark is smooth and grayish-brown, becoming more fissured with age. This variety is valued for its ornamental qualities and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. trilobum is primarily native to the eastern United States, specifically the Appalachian Mountains. This variety of the striped maple is found in regions spanning from Pennsylvania to Virginia. It thrives in moist, well-drained soils along stream banks and in forested areas. The plant is commonly associated with rocky and mountainous terrain. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. trilobum was mainly introduced to the eastern United States as an ornamental tree due to its unique foliage and adaptability to various soil types. It has been cultivated in gardens and parks, particularly in regions with temperate climates. The plant's introduction has led to its presence in several states, including Pennsylvania, New York, and Virginia. However, it is not considered invasive and does not pose a significant threat to native ecosystems. Its distribution remains largely confined to human-modified landscapes."
}
