{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum f. pseudosieboldianum",
    "plant_slug": "acer-circumlobatum-f-pseudosieboldianum",
    "plant_name_scientific": "acer circumlobatum f. pseudosieboldianum",
    "intro": "Acer circumlobatum f. pseudosieboldianum, commonly known as the dwarf maple, is a compact, slow-growing deciduous shrub or small tree native to the mountainous regions of western North America. It is characterized by its finely dissected, palmate leaves that turn vibrant shades of red and orange in autumn. The plant produces small, yellowish-green flowers in early spring, followed by red, winged samaras as its fruit. It thrives in well-drained, acidic soils and prefers partial to full sun exposure. Due to its ornamental value and unique foliage, it is often cultivated in gardens and landscapes for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum f. pseudosieboldianum is primarily native to the mountainous regions of central and southern China, particularly in areas such as Sichuan, Yunnan, and Guizhou provinces. This subspecies thrives in temperate to subtropical climates, often growing at elevations between 1,500 and 3,000 meters. It is commonly found in mixed forests, often associated with other broadleaf and coniferous tree species. The plant prefers well-drained soils and is adapted to the cooler, moist conditions of its native habitat. Its distribution is relatively restricted, making it a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Acer circumlobatum f. pseudosieboldianum was mainly introduced to North America, particularly in the United States and Canada, as an ornamental tree due to its distinctive foliage and adaptability to various soil conditions. It is commonly found in urban and suburban landscapes, where it is valued for its aesthetic appeal and relatively low maintenance requirements. This cultivar is often used in parks, along streets, and in residential gardens to add visual interest throughout the growing season. While it is not native to these regions, it has become naturalized in some areas, raising concerns about its potential impact on local ecosystems. Its introduction has contributed to the diversity of tree species available for landscaping purposes in temperate climates."
}
