{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. lasiophyllum",
    "plant_slug": "acer-campestre-var-lasiophyllum",
    "plant_name_scientific": "acer campestre var. lasiophyllum",
    "intro": "Acer campestre var. lasiophyllum, commonly known as the silver-leaf maple, is a variant of the common maple tree. It is characterized by its distinctive silvery-white undersides on its leaves, which give it a striking appearance. This plant is native to Europe and parts of western Asia, often found in woodland areas. It typically grows to a height of 5–10 meters and has a rounded, dense canopy. The leaves are palmately lobed and turn vibrant yellow in the autumn, adding to its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. lasiophyllum is primarily native to parts of Central and Eastern Europe, including countries such as Germany, Poland, and the Czech Republic. This variety of the field maple is typically found in woodland edges, hedgerows, and rocky soils. It thrives in temperate climates and is commonly associated with mixed forests and open landscapes. The plant is well adapted to moderate sunlight and well-drained soils. Its native range reflects its historical distribution across these regions of Europe.",
    "distribution_introduced_art_desc": "Acer campestre var. lasiophyllum was mainly introduced to North America as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in urban and suburban landscapes, where it is valued for its ability to thrive in compacted soils and tolerate pollution. This variety is often used in landscaping for its dense growth habit and vibrant fall color. However, it has also been reported to spread into natural areas, raising concerns about its potential impact on native plant communities. Its introduction has led to increased interest in its ecological role and management in invaded habitats."
}
