{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. varbossanium",
    "plant_slug": "acer-campestre-var-varbossanium",
    "plant_name_scientific": "acer campestre var. varbossanium",
    "intro": "Acer campestre var. varbossanium, commonly known as the Varbossa maple, is a variant of the field maple, native to the mountainous regions of southern Italy. It is a small to medium-sized deciduous tree or shrub, typically reaching heights of up to 8 meters. The plant features palmate leaves with five to seven lobes, which turn vibrant shades of red and yellow in autumn. Its flowers are small and inconspicuous, appearing in clusters, while the fruit is a samara, a winged seed vessel. The Varbossa maple is valued for its ornamental value and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. varbossanium is primarily native to southern and eastern Europe, including parts of Italy, France, Spain, and the Balkans. This variety of the common horse chestnut is found in regions with temperate climates and well-drained soils. It typically grows in woodland edges, open areas, and along roadsides. The plant is adapted to a variety of soil types but prefers slightly acidic to neutral conditions. Its native range extends into parts of Turkey and the Caucasus region as well.",
    "distribution_introduced_art_desc": "Acer campestre var. varbossanium was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. The introduction occurred in the late 19th century during the period of European colonization. It has since become naturalized in several regions, particularly in coastal and urban areas. However, it is not considered invasive and poses minimal ecological risk in its introduced range."
}
