{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum heterophyllum-laciniatum",
    "plant_slug": "acer-dasycarpum-heterophyllum-laciniatum",
    "plant_name_scientific": "acer dasycarpum heterophyllum-laciniatum",
    "intro": "Acer dasycarpum heterophyllum-laciniatum, commonly known as the Chinese maple, is a deciduous tree native to China. It belongs to the Aceraceae family and is characterized by its distinctive palmate leaves that are finely lobed and have a serrated margin. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras that disperse its seeds. It thrives in temperate climates and is often cultivated for its ornamental value due to its vibrant autumn foliage. The plant is also valued in traditional Chinese medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum heterophyllum-laciniatum is primarily native to the mountainous regions of southwestern China, particularly in the Sichuan and Yunnan provinces. It thrives in temperate to subalpine climates, often growing at elevations between 2,000 and 3,500 meters. This species is commonly found in dense forests and rocky slopes, where it benefits from the cool, moist conditions. It is also occasionally encountered in the eastern Himalayas, including parts of northern India and Nepal. Due to its specific habitat requirements, it is considered a rare and localized plant.",
    "distribution_introduced_art_desc": "Acer dasycarpum heterophyllum-laciniatum was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in partial to full sunlight. It is commonly found in regions with moderate rainfall and cool summers, making it suitable for gardens and landscapes in such environments. This plant is often cultivated for its ornamental value, particularly its distinctive foliage and autumn coloration. It has been introduced to several parts of Europe and North America, where it has been successfully integrated into horticultural practices. However, its spread is limited due to its specific climatic requirements and the need for well-prepared planting sites."
}
