{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer davidii subsp. grosseri",
    "plant_slug": "acer-davidii-subsp-grosseri",
    "plant_name_scientific": "acer davidii subsp. grosseri",
    "intro": "Acer davidii subsp. grosseri, commonly known as the Chinese maple or David's maple, is a deciduous tree native to China. It features palmately lobed leaves that are typically green on top and silvery-white underneath. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. It thrives in temperate climates and is often cultivated for its ornamental value. The subspecies is characterized by its robust growth and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer davidii"
    },
    "taxonomy_art_desc": "Acer davidii subsp. grosseri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, which consists of flowering plants that typically have compound leaves and fruits that are capsules or berries. Its family is Sapindaceae, known as the soapberry family, which includes trees and shrubs with often showy flowers and edible fruits. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer davidii, a rare maple native to China, known for its ornamental value and specific ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer davidii subsp. grosseri is primarily native to China North-Central, China South-Central, and China Southeast. This species is commonly found in mountainous regions within these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed forests and rocky slopes. Its distribution reflects its adaptation to the diverse topography of central and southern China.",
    "distribution_introduced_art_desc": "Acer davidii subsp. grosseri was mainly introduced to the eastern United States as an ornamental tree due to its attractive foliage and unique growth habit. It is commonly found in gardens and landscaped areas where it is valued for its autumn color and ability to thrive in a variety of soil conditions. This subspecies is often cultivated for its aesthetic appeal rather than for ecological purposes. While it is not native to the region, it has become a popular choice for urban and suburban planting. However, its introduction has raised concerns about potential impacts on local ecosystems if it spreads beyond controlled environments."
}
