{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. angustilobum",
    "plant_slug": "acer-campestre-f-angustilobum",
    "plant_name_scientific": "acer campestre f. angustilobum",
    "intro": "Acer campestre f. angustilobum, commonly known as the narrow-leaf hedge maple, is a cultivar of the common maple tree. It is characterized by its narrow, elongated leaves that are typically 4–8 inches long. The plant is deciduous, shedding its leaves in the autumn season. It thrives in full sun to partial shade and prefers well-drained soil. This cultivar is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. angustilobum is primarily native to Europe, particularly the British Isles, and parts of western and central Europe. This variety of the common horse chestnut is typically found in woodland edges, hedgerows, and open areas with well-drained soils. It thrives in temperate climates and is often associated with disturbed or semi-natural habitats. The plant is also occasionally found in parts of northern Africa and western Asia. Its native range includes regions such as the UK, France, Germany, and parts of southern Scandinavia.",
    "distribution_introduced_art_desc": "Acer campestre f. angustilobum was mainly introduced to urban and suburban landscapes due to its adaptability and ornamental value. It is often used in landscaping for its compact size and ability to thrive in various soil conditions. This cultivar is favored for its narrow, elongated leaves that provide a unique visual appeal. It is commonly planted along streets, in parks, and as hedges. However, it requires regular pruning to maintain its shape and prevent overgrowth."
}
