{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer ambiguum",
    "plant_slug": "acer-ambiguum",
    "plant_name_scientific": "acer ambiguum",
    "intro": "Acer ambiguum, commonly known as the ambiguous maple, is a deciduous tree native to the mountainous regions of central and eastern Asia. It is characterized by its alternate, palmately lobed leaves that vary in shape and size depending on the environment. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. Its bark is smooth and grayish-brown, becoming fissured with age. Acer ambiguum is valued for its ornamental appeal and is often cultivated in gardens for its vibrant fall foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer ambiguum is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forests at elevations ranging from 1,000 to 3,000 meters. This species is particularly associated with the Korean Peninsula and the northeastern parts of China. It prefers well-drained soils and is often seen in mixed hardwood forests. Due to its limited range, it is considered a rare and endemic species in its native habitats.",
    "distribution_introduced_art_desc": "Acer ambiguum was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically found in temperate regions. It thrives in environments with cool summers and cold winters, making it suitable for northern and high-altitude regions. This plant is often used in landscaping for its ornamental value, particularly its vibrant fall foliage. It is also valued for its ability to stabilize soil and prevent erosion in woodland settings. However, its introduction can sometimes lead to competition with native species in certain ecosystems."
}
