{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cissifolium",
    "plant_slug": "acer-cissifolium",
    "plant_name_scientific": "acer cissifolium",
    "intro": "Acer cissifolium, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its delicate, palmately lobed leaves that turn vibrant shades of red and orange in autumn. The tree typically grows to a height of 8 to 15 meters, with a rounded crown and smooth, gray bark. Its small, inconspicuous flowers appear in early spring before the leaves, and it produces samaroid fruits that disperse its seeds. The plant thrives in well-drained soil and partial shade, making it a popular ornamental species in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer cissifolium"
    },
    "taxonomy_art_desc": "Acer cissifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive vascular structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Sapindales, which comprises flowering plants with typically alternate leaves and often fragrant flowers. Its family is Sapindaceae, a family of flowering plants commonly known as the soapberry family, many of which produce fruits with a waxy coating. Its genus is Acer, which includes maple trees, known for their distinctive palmate leaves and ornamental value. Its species is Acer cissifolium, a specific type of maple characterized by its delicate, heart-shaped leaves and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cissifolium is primarily native to Japan. It is commonly found in the mountainous regions of Honshu, Shikoku, and Kyushu. This species thrives in temperate climates with well-drained soil. It is often seen in forested areas and rocky slopes. The plant is known for its distinctive foliage and is valued for its ornamental qualities.",
    "distribution_introduced_art_desc": "Acer cissifolium was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique leaf shape. It is commonly found in gardens and urban green spaces where its visual appeal is valued. The plant thrives in temperate climates and prefers well-drained soil with partial to full sunlight. Its introduction has led to its cultivation in various regions outside its native range. However, it is important to monitor its spread to prevent potential ecological impacts."
}
