{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer carolinianum",
    "plant_slug": "acer-carolinianum",
    "plant_name_scientific": "acer carolinianum",
    "intro": "Acer carolinianum, commonly known as the Carolina maple, is a deciduous tree native to the eastern United States. It belongs to the Sapindaceae family and is characterized by its opposite, palmate leaves that turn vibrant shades of red and orange in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds called samaras. It typically grows to a height of 10–30 feet and prefers moist, well-drained soils. The bark is smooth and grayish-brown, becoming fissured with age.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer carolinianum is primarily native to the southeastern United States, including parts of Georgia, South Carolina, North Carolina, and Florida. It is commonly found in moist, well-drained soils along stream banks, in forested areas, and in shaded understories. This species thrives in temperate climates and is often associated with mixed hardwood forests. It is also known to occur in parts of Tennessee and Alabama. The plant is valued for its ornamental value and ecological importance in supporting local wildlife.",
    "distribution_introduced_art_desc": "Acer carolinianum was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically found in forested regions. It is commonly found in the eastern United States, particularly in the Appalachian Mountains and the southeastern states. This plant thrives in temperate climates and is often used in landscaping for its ornamental value. Its introduction has been largely due to its adaptability and aesthetic appeal in both natural and cultivated settings. However, it is important to monitor its spread to prevent potential ecological impacts in non-native regions."
}
