{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. hirtivalvum",
    "plant_slug": "acer-campestre-var-hirtivalvum",
    "plant_name_scientific": "acer campestre var. hirtivalvum",
    "intro": "Acer campestre var. hirtivalvum, commonly known as the hairy-leaf maple, is a small deciduous tree or shrub native to Europe. It is characterized by its distinctive hairy leaves that are often glandular-pubescent on the underside. The leaves are typically ovate to elliptic in shape, with coarsely toothed margins. It produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. This variety is valued for its ornamental appeal and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. hirtivalvum is primarily native to southern and central Europe, including countries such as France, Spain, Italy, and parts of the Balkans. It thrives in temperate climates and is commonly found in woodlands, hedgerows, and rocky soils. This variety is known for its distinctive hairy leaves and is often used in ecological restoration projects. It prefers well-drained soils and can tolerate partial shade to full sun. The plant plays an important role in supporting local biodiversity and is a common sight in the understory of mixed forests.",
    "distribution_introduced_art_desc": "Acer campestre var. hirtivalvum was mainly introduced to the United Kingdom as an ornamental plant due to its unique leaf characteristics and adaptability to various soil conditions. It is commonly found in woodland edges, hedgerows, and urban environments where it thrives in partial shade to full sun. The variety is valued for its hairy, elongated leaf margins, which distinguish it from the typical smooth-leafed Acer campestre. It has been widely cultivated for its aesthetic appeal and ecological benefits, supporting local wildlife and improving biodiversity in garden settings. However, its introduction has raised concerns about potential invasiveness in certain regions outside its native range."
}
