{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circinatum",
    "plant_slug": "acer-circinatum",
    "plant_name_scientific": "acer circinatum",
    "intro": "Acer circinatum, commonly known as the mountain maple, is a deciduous tree native to western North America. It is characterized by its distinctive whorled arrangement of leaves, which are typically palmately lobed and turn vibrant yellow in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds called samaras. It prefers moist, well-drained soils and is often found in mountainous regions. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer circinatum"
    },
    "taxonomy_art_desc": "Acer circinatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, often with compound leaves and fruit types such as drupes or capsules. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with showy flowers and often toxic fruits. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer circinatum, commonly known as the vine maple, a small tree or shrub native to western North America, characterized by its weeping growth habit and palmate leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "British Columbia",
        "California",
        "Oregon",
        "Washington"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circinatum is primarily native to British Columbia, California, Oregon, and Washington. This species is commonly found in the Pacific Northwest region of North America. It thrives in moist, well-drained soils along streambanks and in forested areas. The plant is known for its distinctive whorled leaves and vibrant fall coloration. It plays an important ecological role in its native habitats.",
    "distribution_introduced_art_desc": "Acer circinatum was mainly introduced to areas with moist, well-drained soils and cool climates, often found in mountainous regions. It thrives in environments with partial to full sunlight and is commonly found in the Pacific Northwest of North America. This plant is known for its distinctive whorled leaves and vibrant autumn foliage. It has been introduced to various regions beyond its native range, including parts of Europe and Asia. However, it is generally not considered invasive and is often cultivated for its ornamental value."
}
