{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer crispum",
    "plant_slug": "acer-crispum",
    "plant_name_scientific": "acer crispum",
    "intro": "Acer crispum, commonly known as the Japanese maple, is a deciduous tree native to East Asia. It is characterized by its delicate, finely toothed leaves that turn vibrant shades of red and orange in autumn. The plant typically grows to a height of 5 to 10 meters, with a rounded canopy and branching habit. Its flowers are small and inconspicuous, appearing in early spring before the leaves emerge. The bark is smooth and greyish, becoming more fissured with age.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer crispum is primarily native to the mountainous regions of central and eastern Europe, including parts of the Carpathian Mountains and the Balkans. It is commonly found in alpine and subalpine habitats, growing at elevations ranging from 1,000 to 2,500 meters. This species thrives in well-drained soils and is often associated with rocky or forested slopes. It is also present in some areas of western Asia, particularly in the Caucasus region. Due to its specific habitat requirements, it is considered a rare and localized plant in its native range.",
    "distribution_introduced_art_desc": "Acer crispum was mainly introduced to the Pacific Northwest region of the United States. It was brought there for its ornamental value due to its attractive, serrated leaves. The plant has since become naturalized in several areas, often found in moist, shady woodland habitats. It is commonly cultivated in gardens and parks for its aesthetic appeal. However, it is considered invasive in some regions, outcompeting native plant species."
}
