{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. tauricum",
    "plant_slug": "acer-campestre-f-tauricum",
    "plant_name_scientific": "acer campestre f. tauricum",
    "intro": "Acer campestre f. tauricum, commonly known as the Tauric hedge maple, is a compact shrub or small tree native to southern Europe. It is a variant of the common hedge maple, characterized by its dense, upright growth habit and small, ovate leaves with coarsely toothed margins. The leaves are typically dark green on top and lighter beneath, turning yellow in autumn. It produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by wind. This cultivar is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. tauricum is primarily native to southern Europe, particularly the Iberian Peninsula, Italy, and parts of the Balkans. This variety of the European horse chestnut is adapted to a variety of soil types and can thrive in both sunny and partially shaded environments. It is commonly found in woodlands, hedgerows, and along roadsides in its native range. The plant is known for its distinctive leaves and is often used in landscaping due to its ornamental value. However, it is not widely cultivated outside its natural habitat.",
    "distribution_introduced_art_desc": "Acer campestre f. tauricum was mainly introduced to Europe as an ornamental plant due to its attractive autumn foliage and compact growth habit. It is commonly found in gardens and parks across the continent, particularly in the United Kingdom and Germany. This cultivar is valued for its ability to thrive in a variety of soil types and its tolerance to urban environments. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on local ecosystems. Its introduction has contributed to the diversity of tree species in horticultural settings across Europe."
}
