{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum f. platylobum",
    "plant_slug": "acer-barbatum-f-platylobum",
    "plant_name_scientific": "acer barbatum f. platylobum",
    "intro": "Acer barbatum f. platylobum, commonly known as the flat-lobed maple, is a distinctive cultivar of the maple tree characterized by its unique leaf morphology. Its leaves are broader and more rounded compared to the typical species, featuring a flattened, almost heart-shaped lobes. The plant is native to the mountainous regions of eastern Asia, particularly China, where it thrives in cooler, humid climates. It produces small, clustered flowers in the spring, followed by winged seeds that are dispersed by the wind. This cultivar is often cultivated for its ornamental value, especially for its vibrant autumn foliage that displays shades of red and orange.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum f. platylobum is primarily native to the mountainous regions of eastern Asia, specifically China, Korea, and Japan. This plant thrives in cool, temperate climates and is often found in forested areas at higher elevations. It is commonly associated with mixed deciduous and coniferous forests, where it benefits from partial shade and well-drained soils. The species is known for its distinctive broad, rounded leaves and is a valued ornamental plant in horticulture. Its native range reflects its adaptation to the unique ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Acer barbatum f. platylobum was mainly introduced to ornamental horticulture due to its unique foliage and aesthetic appeal. It is commonly cultivated in gardens and landscapes for its striking, broad-lobed leaves. This form is a natural variant of Acer barbatum, known for its adaptability to various soil types and climates. It thrives in temperate regions and is often used as a decorative tree or shrub. Its introduction has expanded its presence beyond its native range, contributing to its popularity in horticultural settings."
}
