{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum var. floridanum",
    "plant_slug": "acer-barbatum-var-floridanum",
    "plant_name_scientific": "acer barbatum var. floridanum",
    "intro": "Acer barbatum var. floridanum, commonly known as the Florida maple, is a deciduous shrub or small tree native to the southeastern United States. It features opposite, ovate leaves with a serrated margin and a dark green upper surface. The plant produces clusters of small, yellowish-green flowers in early spring, followed by red or orange-red samaras in the fall. It thrives in moist, well-drained soils and is often found in swampy or wetland habitats. The Florida maple is valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum var. floridanum is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetlands, swamps, and along stream banks in these regions. This variety of the striped maple is adapted to moist, acidic soils and thrives in humid climates. It is an important component of the local flora in these areas, providing habitat and food for various wildlife species. Due to its specific habitat requirements, it is often found in isolated populations rather than widespread across the landscape.",
    "distribution_introduced_art_desc": "Acer barbatum var. floridanum was mainly introduced to the southeastern United States, particularly in Florida and parts of Georgia. It is commonly found in wetland areas, along the edges of ponds, and in swampy habitats. This plant is often associated with disturbed sites and can thrive in moist, acidic soils. It plays a role in stabilizing soil and providing habitat for various wildlife species. However, its introduction has raised concerns about its potential impact on native plant communities."
}
