{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens f. medicum",
    "plant_slug": "acer-cinerascens-f-medicum",
    "plant_name_scientific": "acer cinerascens f. medicum",
    "intro": "Acer cinerascens f. medicum, commonly known as the medicinal maple, is a rare and distinctive variant of the smoke tree maple. It is characterized by its finely serrated, dark green leaves that turn vibrant shades of red and orange in the fall. The plant produces small, inconspicuous yellowish-green flowers in early spring, followed by winged seeds that aid in its dispersal. It thrives in well-drained soils and partial to full sunlight, making it suitable for garden cultivation. Due to its limited distribution and unique foliage, it is often sought after by horticulturists and botanists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens f. medicum is primarily native to the southeastern United States, specifically occurring in parts of Georgia, North Carolina, and South Carolina. This variety is typically found in moist, well-drained soils in forested areas. It thrives in the humid climate of the Appalachian region. The plant is often associated with mixed hardwood forests and streamside habitats. Its distribution is relatively limited, making it a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Acer cinerascens f. medicum was mainly introduced to the United States as an ornamental tree due to its unique weeping form and aesthetic appeal. It is commonly found in botanical gardens and private collections, particularly in the eastern and southern regions of the country. The plant has been cultivated for its visual interest and is sometimes used in landscape design to add a dramatic effect. However, it is not considered invasive and does not spread aggressively in natural environments. Its introduction has primarily been for horticultural purposes rather than ecological or agricultural reasons."
}
