{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer buergerianum subsp. formosanum",
    "plant_slug": "acer-buergerianum-subsp-formosanum",
    "plant_name_scientific": "acer buergerianum subsp. formosanum",
    "intro": "Acer buergerianum subsp. formosanum, commonly known as the Formosan maple, is a deciduous tree native to Taiwan. It belongs to the Sapindaceae family and is characterized by its distinctive palmate leaves with five to seven lobes. The tree produces small, yellowish-green flowers in early spring, followed by red to orange-red samaras in late summer. It thrives in moist, well-drained soils and is often found in mountainous regions. The species is valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer buergerianum subsp. formosanum is primarily native to the mountainous regions of Taiwan. This subspecies is found in the central and southern parts of the island, particularly in areas with high elevation and cool, humid climates. It thrives in forest understories and rocky slopes, often in association with other temperate forest species. The plant is adapted to the unique ecological conditions of Taiwan's native forests. Its distribution is limited to this specific geographic region, making it an important component of the local flora.",
    "distribution_introduced_art_desc": "Acer buergerianum subsp. formosanum was mainly introduced to ornamental horticulture and urban landscaping due to its attractive foliage and adaptability to various soil conditions. It is commonly used in parks, gardens, and along streets for its aesthetic value and ability to thrive in temperate climates. The species has also been introduced to regions outside its native range, such as parts of North America and Europe, where it is cultivated for its ornamental qualities. Its introduction has led to its establishment in some areas, raising concerns about its potential ecological impact. Despite its popularity, it is generally considered non-invasive in most environments where it is planted."
}
