{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum subsp. tientaiense",
    "plant_slug": "acer-amplum-subsp-tientaiense",
    "plant_name_scientific": "acer amplum subsp. tientaiense",
    "intro": "Acer amplum subsp. tientaiense, commonly known as the Tiantai maple, is a deciduous tree native to eastern China. It belongs to the Sapindaceae family and is characterized by its palmate leaves with five to seven lobes. The tree produces small, yellowish-green flowers in early spring, followed by red or orange samaras in late summer. It typically grows in mountainous regions and thrives in well-drained soils. The species is valued for its ornamental qualities and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer amplum"
    },
    "taxonomy_art_desc": "Acer amplum subsp. tientaiense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as magnolias and citrus. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, many of which produce fruits with hard pits. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with often showy flowers and fruits that may be toxic. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive sap. Its species is Acer amplum, a maple species native to China, characterized by its broad leaves and typically yellow or red autumn foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum subsp. tientaiense is primarily native to China Southeast. This subspecies is typically found in the mountainous regions of southern China, including areas such as Guangdong, Guangxi, and Fujian. It thrives in humid, subtropical climates with well-drained soils. The plant is commonly associated with secondary forests and mixed hardwood ecosystems. Its distribution is relatively localized, reflecting its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acer amplum subsp. tientaiense was mainly introduced to regions with moist, temperate climates where it can thrive in well-drained soils. It is commonly found in areas with ample sunlight and moderate temperatures, making it suitable for cultivation in gardens and parks. This subspecies is valued for its ornamental value, particularly its vibrant autumn foliage. It has been introduced to parts of eastern Asia, including China, where it has been cultivated for its aesthetic appeal. However, its spread is limited due to its specific environmental requirements."
}
