{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. mono",
    "plant_slug": "acer-cappadocicum-subsp-mono",
    "plant_name_scientific": "acer cappadocicum subsp. mono",
    "intro": "Acer cappadocicum subsp. mono, commonly known as the single-leaf maple, is a rare and distinctive species native to the mountainous regions of Turkey. It is characterized by its unique foliage, featuring large, palmately lobed leaves that are typically single rather than compound. The plant produces small, yellowish-green flowers in early spring, followed by winged fruits that aid in seed dispersal. It thrives in cool, moist environments and is often found in forested areas with well-drained soil. Due to its limited distribution and specific habitat requirements, it is considered a conservation concern in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. mono is primarily native to the eastern and central regions of Turkey, specifically the Cappadocia area. It is also found in parts of northeastern Syria and southeastern Anatolia. This subspecies thrives in rocky and mountainous terrain, often growing in open woodlands and on slopes. It is adapted to the dry and semi-arid climate of its native range. The plant is part of the maple family and is known for its distinctive foliage and ecological significance in its habitat.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. mono was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It is commonly cultivated as an ornamental tree due to its attractive foliage and unique growth habit. This species is particularly suited for regions with mild winters and warm summers. It has been introduced to several parts of the United States, including the Pacific Northwest and the eastern seaboard. However, its spread is limited by its specific environmental requirements and is not considered invasive in most regions."
}
