{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. arbusculum",
    "plant_slug": "acer-dasycarpum-f-arbusculum",
    "plant_name_scientific": "acer dasycarpum f. arbusculum",
    "intro": "Acer dasycarpum f. arbusculum, commonly known as the dwarf maple, is a unique variant of the genus Acer. It is characterized by its compact growth habit and small, rounded leaves that are typically a vibrant green during the growing season. The plant produces small, red-orange samaras, which are its distinctive seeds enclosed in a winged structure. This form is often cultivated for its ornamental value in gardens and landscapes. It thrives in well-drained soil and prefers partial to full sun exposure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. arbusculum is primarily native to the mountainous regions of central and eastern China, specifically in provinces such as Sichuan, Yunnan, and Tibet. It thrives in temperate to cold climates at high altitudes, typically between 2,000 and 4,000 meters above sea level. This variety is often found in mixed forests and on rocky slopes, where it adapts well to harsh environmental conditions. Its distribution is limited to these specific geographic areas, making it a rare and endemic species in its native habitat. The plant plays an important ecological role in the high-altitude ecosystems of these regions.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. arbusculum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded environments such as along stream banks and in forest understories. This variety is valued for its ornamental value, particularly its distinctive yellow fall color. It has been cultivated in gardens and landscapes due to its adaptability and aesthetic appeal. However, it is important to note that it may naturalize in certain areas, requiring careful management to prevent ecological disruption."
}
