{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. laevigatum",
    "plant_slug": "acer-campestre-var-laevigatum",
    "plant_name_scientific": "acer campestre var. laevigatum",
    "intro": "Acer campestre var. laevigatum, commonly known as the smooth-leaved field maple, is a deciduous shrub or small tree native to Europe. It is characterized by its smooth, pale green bark and palmate leaves with five to seven lobes. The plant produces small, yellow-green flowers in early spring, followed by winged samaras as fruit. It thrives in full sun to partial shade and is often found in woodland edges or open areas. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. laevigatum is primarily native to parts of Central and Eastern Europe, including countries such as Germany, Poland, the Czech Republic, and parts of Austria. This variety of the common maple is typically found in woodland edges, open forests, and rocky slopes. It thrives in temperate climates with well-drained soils. The plant is well adapted to a range of environmental conditions, making it a common sight in natural and semi-natural habitats. Its distribution is closely linked to the historical and current landscape patterns of these regions.",
    "distribution_introduced_art_desc": "Acer campestre var. laevigatum was mainly introduced to ornamental horticulture and landscape design due to its compact size and aesthetic appeal. It is commonly used in urban settings for its ability to thrive in limited spaces and tolerate pollution. This variety is also favored for its adaptability to various soil types and its resistance to common diseases. Its introduction has expanded its presence in gardens and parks across temperate regions. However, its spread has raised concerns about potential ecological impacts in non-native habitats."
}
