{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. bedoi",
    "plant_slug": "acer-campestre-f-bedoi",
    "plant_name_scientific": "acer campestre f. bedoi",
    "intro": "Acer campestre f. bedoi, commonly known as the Bedöi mountain maple, is a rare and distinctive variant of the common maple. It is characterized by its compact growth habit and unique foliage, featuring leaves with a broader, more rounded shape compared to the typical species. The plant exhibits a slow growth rate and is often found in rocky or mountainous habitats where it thrives in well-drained soils. Its ornamental value lies in its striking autumn coloration, which can range from deep red to orange. Due to its limited distribution and specific ecological requirements, it is considered a rare and valuable addition to botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. bedoi is primarily native to southern and eastern Europe, including regions such as Italy, Austria, Slovenia, Croatia, and parts of the Balkans. This variety is commonly found in forested areas and along riverbanks, where it thrives in well-drained soils. It is particularly associated with the Carpathian and Dinaric mountain ranges, where its habitat is characterized by moderate temperatures and adequate moisture. The plant is often found in association with other species of the genus Acer, forming part of the understory vegetation in mixed forests. Due to its limited distribution, it is considered a relatively rare and localized species within its range.",
    "distribution_introduced_art_desc": "Acer campestre f. bedoi was mainly introduced to the United States as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in urban and suburban landscapes, particularly in regions with temperate climates. This cultivar is valued for its compact growth habit and ability to thrive in challenging environments. However, it has also been noted to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its distribution is primarily limited to the eastern and central parts of the United States."
}
