{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum subsp. amplum",
    "plant_slug": "acer-amplum-subsp-amplum",
    "plant_name_scientific": "acer amplum subsp. amplum",
    "intro": "Acer amplum subsp. amplum, commonly known as the European maple, is a deciduous tree native to Europe and western Asia. It typically grows to a height of 10–20 meters, featuring a broad, rounded crown and smooth, gray bark. The leaves are palmately lobed, with five to seven pointed lobes, and turn vibrant shades of red and yellow in autumn. It produces small, greenish-yellow flowers in early spring, followed by winged samaras as its fruit. This species is often found in moist, well-drained soils along riverbanks and in woodland areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer amplum"
    },
    "taxonomy_art_desc": "Acer amplum subsp. amplum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, often with distinctive fruits. Its family is Sapindaceae, commonly known as the soapberry family, which includes plants with showy flowers and often fleshy fruits. Its genus is Acer, which consists of maple trees, known for their opposite leaves and distinctive samaras. Its species is Acer amplum, a specific type of maple native to certain regions of Europe, recognized by its unique leaf shape and growth habit.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum subsp. amplum is primarily native to China South-Central and China Southeast. This species is commonly found in mountainous regions within these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with forested landscapes and rocky outcrops. Its native range reflects its adaptation to the diverse ecological conditions of southern and central China.",
    "distribution_introduced_art_desc": "Acer amplum subsp. amplum was mainly introduced to North America, particularly in the northeastern United States and eastern Canada. It was brought there during the 19th and early 20th centuries as an ornamental tree due to its attractive autumn foliage and adaptability to various soil conditions. This subspecies thrives in moist, well-drained soils and is often found in riparian zones and along stream banks. It has become naturalized in some areas, contributing to local biodiversity but also raising concerns about its potential impact on native plant communities. Its introduction has led to its cultivation in urban and suburban landscapes across the continent."
}
