{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum var. heyhachii",
    "plant_slug": "acer-circumlobatum-var-heyhachii",
    "plant_name_scientific": "acer circumlobatum var. heyhachii",
    "intro": "Acer circumlobatum var. heyhachii, commonly known as the Heyhachii maple, is a deciduous tree native to the Pacific Northwest of the United States. It is characterized by its distinctive palmate leaves that are typically 5 to 7 lobes, with a bright green upper surface and a lighter, sometimes hairy underside. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras that aid in seed dispersal. Its bark is smooth and grayish-brown, becoming fissured with age, and it thrives in moist, well-drained soils. This variety is valued for its ornamental appeal and is often planted in gardens and parks for its seasonal color and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum var. heyhachii is primarily native to the mountainous regions of central and southern California, particularly in the Sierra Nevada and coastal ranges. This variety is typically found in moist, shaded habitats such as mixed evergreen forests and chaparral areas. It thrives in cool, humid climates with well-drained soils. The plant is often associated with areas that have a Mediterranean climate, characterized by dry summers and wet winters. It is an important component of the native flora in these regions, contributing to local biodiversity.",
    "distribution_introduced_art_desc": "Acer circumlobatum var. heyhachii was mainly introduced to areas with temperate climates that provide adequate moisture and well-drained soils. It thrives in regions with moderate sunlight and is often found in woodland edges or along streams. This variety is valued for its ornamental qualities, including its vibrant fall foliage and unique leaf shape. It has been cultivated in gardens and parks across North America, particularly in the eastern United States. Due to its adaptability, it has become a popular choice for landscaping in urban and suburban settings."
}
