{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum subvar. normale",
    "plant_slug": "acer-dasycarpum-subvar-normale",
    "plant_name_scientific": "acer dasycarpum subvar. normale",
    "intro": "Acer dasycarpum subvar. normale, commonly known as the Chinese maple, is a deciduous tree native to China. It belongs to the Sapindaceae family and is characterized by its ornamental value due to its vibrant autumn foliage. The tree typically grows to a height of 10–15 meters, with a rounded crown and smooth, gray bark. Its leaves are palmately lobed, turning red or orange in the fall, and it produces small, yellowish flowers in early spring. The species is valued in horticulture for its aesthetic appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum subvar. normale is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. It thrives in temperate climates with high altitudes, often found in mixed forests and on rocky slopes. This subvariety is commonly associated with areas of high biodiversity and is adapted to the cooler, moist conditions of its native habitat. It is also found in parts of northern Vietnam and southern Tibet. The plant plays an important ecological role in its native ecosystems, contributing to forest structure and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acer dasycarpum subvar. normale was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of Europe and North America. It thrives in full sun to partial shade and is often used in ornamental landscaping due to its attractive foliage and autumn color. This variety is known for its slow growth and compact form, making it suitable for smaller garden spaces. It is also valued for its ability to tolerate urban environments and air pollution. However, it requires regular pruning to maintain its shape and health."
}
