{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. pendulum",
    "plant_slug": "acer-campestre-f-pendulum",
    "plant_name_scientific": "acer campestre f. pendulum",
    "intro": "Acer campestre f. pendulum, commonly known as the weeping hedge maple, is a cultivar of the common maple tree. It is characterized by its pendulous branches that droop gracefully, creating a distinctive weeping appearance. The plant produces small, greenish-yellow flowers in early spring, followed by red or orange samaras in the fall. Its leaves are typically ovate to elliptical, with a serrated edge and a bronze underside. This ornamental tree is often used in landscaping for its aesthetic appeal and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. pendulum is primarily native to parts of Europe, particularly the British Isles, including England, Wales, and parts of southern Scotland. This distinctive cultivar is known for its weeping growth habit and is often found in hedgerows and woodland edges. It thrives in temperate climates with well-drained soil and partial to full sunlight. The plant is commonly used in ornamental landscaping due to its unique appearance. Its native range reflects its adaptation to the varied habitats of western Europe.",
    "distribution_introduced_art_desc": "Acer campestre f. pendulum was mainly introduced to the eastern United States as an ornamental tree due to its unique weeping form and aesthetic appeal. It has been cultivated in gardens and landscapes since the 19th century, particularly in regions with temperate climates. The plant is often used in urban settings for its visual interest and ability to thrive in a variety of soil conditions. However, it is not considered invasive and does not spread aggressively in natural ecosystems. Its introduction has primarily focused on horticultural purposes rather than ecological impact."
}
