{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campbellii subsp. heptaphlebium",
    "plant_slug": "acer-campbellii-subsp-heptaphlebium",
    "plant_name_scientific": "acer campbellii subsp. heptaphlebium",
    "intro": "Acer campbellii subsp. heptaphlebium, commonly known as the Campbell's maple, is a deciduous tree native to the mountainous regions of China. It is characterized by its striking, palmate leaves that turn vibrant shades of red and yellow in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds. It typically grows to a height of 10–15 meters and prefers well-drained, acidic soils. This subspecies is valued for its ornamental appeal and is often cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campbellii subsp. heptaphlebium is primarily native to the mountainous regions of central China, specifically in the provinces of Sichuan and Yunnan. This subspecies is found in high-altitude areas with cool, humid climates. It thrives in rocky soils and is often associated with coniferous forests. The plant is part of the maple family and is known for its distinctive leaf morphology. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer campbellii subsp. heptaphlebium was mainly introduced to North America, particularly in the United States and Canada, as an ornamental tree due to its unique foliage and aesthetic appeal. It has been cultivated in botanical gardens and private collections, where it is valued for its striking red and yellow autumn colors. Although not widely naturalized, it has been observed growing in some urban and suburban areas where it has escaped cultivation. Its introduction has raised concerns among conservationists due to its potential invasive tendencies in certain environments. Despite its ornamental value, its distribution remains limited compared to other maple species."
}
