{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. albomaculatum",
    "plant_slug": "acer-campestre-f-albomaculatum",
    "plant_name_scientific": "acer campestre f. albomaculatum",
    "intro": "Acer campestre f. albomaculatum, commonly known as the white-spotted maple, is a cultivar of the common maple tree. It is characterized by its distinctive white or pale yellow spots on the leaves, which contrast with its green or bronze foliage. The plant is a deciduous shrub or small tree, typically reaching heights of up to 5 meters. Its leaves are palmately lobed, and it produces small, yellowish flowers in early spring. This cultivar is valued for its ornamental appeal and is often used in gardens for its unique leaf patterns.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. albomaculatum is primarily native to parts of Europe, including western and central regions. This plant is commonly found in countries such as France, Germany, and the United Kingdom. It thrives in temperate climates and is often associated with woodlands and hedgerows. The species is known for its distinctive white-veined leaves, which set it apart from other maple varieties. It has a historical presence in the flora of these regions, with records dating back to the early 19th century.",
    "distribution_introduced_art_desc": "Acer campestre f. albomaculatum was mainly introduced to ornamental horticulture and landscape design due to its distinctive white-veined leaves. This cultivar is valued for its aesthetic appeal, making it a popular choice for gardens and public spaces. It is often used as a decorative tree or shrub in temperate climates. The introduction of this plant has expanded its distribution beyond its native range. However, its spread is limited to areas where it can thrive in suitable soil and climate conditions."
}
