{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. pulverulentum",
    "plant_slug": "acer-campestre-f-pulverulentum",
    "plant_name_scientific": "acer campestre f. pulverulentum",
    "intro": "Acer campestre f. pulverulentum, commonly known as the powdered maple, is a shrub or small tree native to Europe and parts of western Asia. It belongs to the maple family, Aceraceae, and is characterized by its distinctive, finely textured leaves that are often covered in a powdery coating. The plant typically grows in moist, shaded environments such as woodlands and stream sides. Its small, inconspicuous flowers appear in early spring, followed by red or orange samaras that disperse its seeds. This variety is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. pulverulentum is primarily native to Central and Eastern Europe, including parts of Germany, Poland, and the Czech Republic. This plant is commonly found in forested areas and along woodland edges. It thrives in well-drained soils and is often associated with mixed deciduous forests. The species is known for its distinctive, finely divided leaves and is a common understory plant in its native habitat. Its distribution is largely limited to temperate regions of Europe where it has adapted to a variety of soil and climatic conditions.",
    "distribution_introduced_art_desc": "Acer campestre f. pulverulentum was mainly introduced to North America as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in urban and suburban landscapes, where it thrives in full sun to partial shade. This variety is valued for its compact size and ability to tolerate pollution, making it suitable for planting in city environments. However, its introduction has raised concerns about its potential to become invasive in certain regions. Despite its ornamental appeal, its ecological impact remains a topic of ongoing study."
}
