{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. subtrilobum",
    "plant_slug": "acer-campestre-f-subtrilobum",
    "plant_name_scientific": "acer campestre f. subtrilobum",
    "intro": "Acer campestre f. subtrilobum, commonly known as the three-lobed field maple, is a variant of the common maple. It is a small to medium-sized deciduous tree or shrub native to Europe. The leaves are palmately lobed, typically with three distinct lobes, giving it its common name. It produces small, yellowish-green flowers in early spring, followed by winged samaras. This plant thrives in well-drained soils and is often found in woodland edges or open areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. subtrilobum is primarily native to parts of eastern and central Europe, including countries such as Germany, Poland, and the Czech Republic. It is also found in some regions of northern Italy and parts of western Russia. This subspecies typically grows in open woodlands, forest edges, and rocky soils. It is commonly associated with temperate climates and can thrive in both sunny and partially shaded environments. Its native range reflects its adaptability to a variety of soil types and climatic conditions within its geographical region.",
    "distribution_introduced_art_desc": "Acer campestre f. subtrilobum was mainly introduced to Europe as an ornamental plant due to its distinctive three-lobed leaves and adaptability to various soil conditions. It has been widely cultivated in gardens and parks across the continent, particularly in the United Kingdom and Germany. The plant's ability to thrive in urban environments has contributed to its popularity in landscaping. However, its introduction has raised concerns about potential invasiveness in certain regions. Despite its ornamental value, it is important to monitor its ecological impact in the wild."
}
