{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amoenum f. palmatipartitum",
    "plant_slug": "acer-amoenum-f-palmatipartitum",
    "plant_name_scientific": "acer amoenum f. palmatipartitum",
    "intro": "Acer amoenum f. palmatipartitum, commonly known as the Japanese maple with palmate leaves, is a variant of the Amur maple. It is characterized by its striking, palmately lobed leaves that are often deeply divided, giving it a distinctive, almost fern-like appearance. The plant is native to eastern Asia and thrives in temperate climates. It produces small, red flowers in early spring, followed by ornamental samaras that add visual interest in the fall. Its foliage changes color throughout the seasons, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amoenum f. palmatipartitum is primarily native to the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Jiangxi, and Sichuan. This plant thrives in humid, temperate climates and is commonly found in forested areas at elevations ranging from 500 to 1,500 meters. It is often associated with mixed evergreen and deciduous forests, where it benefits from partial shade and well-drained soil. The species is known for its distinctive palmate leaves, which give it a unique appearance in its natural habitat. Due to its ornamental value, it has also been cultivated in other parts of Asia and occasionally in North America.",
    "distribution_introduced_art_desc": "Acer amoenum f. palmatipartitum was mainly introduced to enhance ornamental value in gardens and landscapes due to its unique foliage. It is characterized by its palmately lobed leaves that create a striking visual effect. This cultivar is often favored for its adaptability to various soil types and moderate climate conditions. It has been widely cultivated in temperate regions for its aesthetic appeal. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
