{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum subsp. truncatum",
    "plant_slug": "acer-cappadocicum-subsp-truncatum",
    "plant_name_scientific": "acer cappadocicum subsp. truncatum",
    "intro": "Acer cappadocicum subsp. truncatum, commonly known as the Cappadocian maple, is a deciduous tree native to the Cappadocia region of Turkey. It is characterized by its distinctive, deeply lobed leaves that turn vibrant shades of red and orange in the fall. The plant produces small, greenish-yellow flowers in early spring, followed by winged seeds that are dispersed by wind. It thrives in well-drained soils and prefers full sun to partial shade. This subspecies is valued for its ornamental appeal and is often cultivated in gardens and parks for its seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum subsp. truncatum is primarily native to southeastern Europe, specifically the regions of Turkey, Greece, and parts of the Balkans. It is commonly found in the mountainous areas of Cappadocia in Turkey, where it thrives in rocky and limestone-rich soils. This subspecies is adapted to temperate climates with cold winters and warm, dry summers. It often grows in open woodlands and along rocky slopes. Its native range is limited, making it a rare and endemic species in its habitat.",
    "distribution_introduced_art_desc": "Acer cappadocicum subsp. truncatum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly found in regions with a mild summer and cold winter. This subspecies is often cultivated for its ornamental value due to its unique foliage and autumn coloration. It has been introduced to several parts of the United States, particularly in the eastern and central regions. However, it is important to note that its introduction may have ecological implications in non-native habitats."
}
