{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre subsp. leiocarpum",
    "plant_slug": "acer-campestre-subsp-leiocarpum",
    "plant_name_scientific": "acer campestre subsp. leiocarpum",
    "intro": "Acer campestre subsp. leiocarpum, commonly known as the smooth-leaf horse chestnut, is a deciduous tree native to parts of Europe and western Asia. It is characterized by its oval, glossy, dark green leaves that remain smooth and hairless on both sides. The tree produces small, yellowish-green flowers in clusters, followed by spiny, orange-brown fruits. Its bark is typically smooth and light gray, becoming fissured with age. This subspecies is often found in moist, well-drained soils and is valued for its ornamental qualities in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer campestre"
    },
    "taxonomy_art_desc": "Acer campestre subsp. leiocarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and a well-developed vascular system. Its order is Sapindales, which includes a variety of flowering plants, many of which are known for their showy flowers and economically important fruits. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with often fragrant flowers and fleshy fruits. Its genus is Acer, which consists of deciduous trees and shrubs commonly known as maples, characterized by their opposite leaves and samaroid fruits. Its species is Acer campestre, commonly known as the field maple, a small to medium-sized tree native to Europe, known for its distinctive bark and winged seeds.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Austria",
        "Bulgaria",
        "Czechia-Slovakia",
        "Germany",
        "Hungary",
        "Iran",
        "NW. Balkan Pen.",
        "Poland",
        "Switzerland",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre subsp. leiocarpum is primarily native to Austria, Bulgaria, Czechia-Slovakia, Germany, Hungary, Iran, NW. Balkan Pen., Poland, Switzerland, Transcaucasus, and Turkey. This subspecies is found across a range that spans Central and Eastern Europe, as well as parts of the Middle East. It thrives in temperate climates and is commonly found in forested areas and along river valleys. The distribution includes both mountainous and lowland regions, reflecting its adaptability to various environmental conditions. Its presence in these regions highlights its ecological significance in local ecosystems.",
    "distribution_introduced_art_desc": "Acer campestre subsp. leiocarpum was mainly introduced to New Zealand as an ornamental tree due to its attractive foliage and hardy nature. It has been widely planted in urban and rural landscapes across the country. The species is commonly found in gardens, parks, and along roadsides, where it thrives in a variety of soil types. However, its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its popularity, its ecological impact remains a topic of ongoing study."
}
