{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer californicum var. texanum",
    "plant_slug": "acer-californicum-var-texanum",
    "plant_name_scientific": "acer californicum var. texanum",
    "intro": "Acer californicum var. texanum, commonly known as the Texas maple, is a deciduous shrub or small tree native to the southwestern United States. It features palmate leaves with five to seven lobes, typically turning vibrant shades of red and orange in the fall. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. It thrives in well-drained soils and full sun, making it adaptable to various garden settings. Its ornamental value is enhanced by its seasonal color changes and compact growth habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer californicum var. texanum is primarily native to the southwestern United States, specifically Texas and parts of New Mexico. It grows in rocky soils and is commonly found in limestone hills and canyons. This variety is adapted to arid and semi-arid climates, thriving in regions with well-drained soil. It is often seen in open woodlands and along stream banks in its native range. The plant is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acer californicum var. texanum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in riparian zones and along stream banks in its native range. This variety is known for its vibrant fall color and is often used in landscaping due to its ornamental value. However, it has shown potential to spread beyond its intended sites, raising concerns about its invasive tendencies. Proper management is recommended to prevent its establishment in non-native habitats."
}
