{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens var. bornmuelleri",
    "plant_slug": "acer-cinerascens-var-bornmuelleri",
    "plant_name_scientific": "acer cinerascens var. bornmuelleri",
    "intro": "Acer cinerascens var. bornmuelleri, commonly known as the Bornmueller's smokebark maple, is a deciduous tree native to the southeastern United States. It is characterized by its distinctive, ash-gray bark that peels in thin, papery layers, giving it a unique visual appearance. The leaves are opposite, ovate to elliptic, with serrated margins and a dark green upper surface that turns vibrant red or orange in the fall. It produces small, red flowers in early spring followed by winged seeds. This variety is valued for its ornamental bark and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens var. bornmuelleri is primarily native to the southern United States, specifically Texas and northeastern Mexico. This variant of the red maple is found in regions with moist, well-drained soils, often near streams and in woodland areas. It thrives in humid climates and is commonly associated with riparian zones and bottomlands. The plant is known for its distinctive red foliage and is a valuable species for ecological restoration projects. Its native range is limited, making it a rare and specialized species within its habitat.",
    "distribution_introduced_art_desc": "Acer cinerascens var. bornmuelleri was mainly introduced to specific regions in the southeastern United States, particularly in Georgia and Florida. It was introduced primarily as an ornamental plant due to its distinctive foliage and adaptability to various soil conditions. This variety is known for its unique silver-green leaves that turn vibrant red in the fall, making it a popular choice for landscaping. However, it has also been found growing in the wild, raising concerns about its potential invasive behavior. Its distribution is now expanding beyond its original introduction sites, prompting further ecological study."
}
