{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer chunii",
    "plant_slug": "acer-chunii",
    "plant_name_scientific": "acer chunii",
    "intro": "Acer chunii, commonly known as the Chinese maple, is a deciduous tree native to China. It belongs to the genus Acer in the family Sapindaceae, characterized by its opposite, simple leaves and showy flowers. The tree typically grows to a height of 8–12 meters, featuring a rounded crown and smooth, gray bark. Its leaves are palmately lobed, turning vibrant shades of red and yellow in autumn, making it a popular ornamental species. Acer chunii is well-suited for urban environments due to its tolerance of pollution and compact growth habit.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer chunii"
    },
    "taxonomy_art_desc": "Acer chunii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some extinct relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Sapindales, which consists of flowering plants with diverse forms, including trees, shrubs, and herbs. Its family is Sapindaceae, commonly known as the soapberry family, which includes plants with showy flowers and often toxic fruits. Its genus is Acer, which refers to the maple trees, known for their distinctive leaves and sap. Its species is Acer chunii, a specific type of maple native to China, characterized by its unique foliage and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer chunii is primarily native to China South-Central and China Southeast. This species is found in regions that include parts of southern and central China. It typically grows in mountainous areas with temperate climates. The plant is well adapted to the local environmental conditions of these regions. It is commonly found in forests and woodland areas within its native range.",
    "distribution_introduced_art_desc": "Acer chunii was mainly introduced to the United States as an ornamental tree due to its attractive foliage and adaptability to various climates. It is commonly found in gardens and urban landscapes across the eastern and central regions of the country. The plant's introduction has been associated with horticultural trade and landscape design efforts. However, it is not considered invasive and has not spread widely into natural ecosystems. Its presence is primarily confined to cultivated areas where it is intentionally planted."
}
