{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer amplum",
    "plant_slug": "acer-amplum",
    "plant_name_scientific": "acer amplum",
    "intro": "Acer amplum, commonly known as the mountain maple, is a deciduous tree native to Europe and western Asia. It typically grows in mountainous regions and thrives in cool, moist environments. The tree has a rounded crown and produces small, palmate leaves that turn yellow in the fall. Its flowers are inconspicuous, and it produces samaras, or winged seeds, for dispersal. The bark is smooth and grayish-brown, becoming fissured with age.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer amplum"
    },
    "taxonomy_art_desc": "Acer amplum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Sapindales, a group of flowering plants that includes trees and shrubs with often fragrant flowers. Its family is Sapindaceae, commonly known as the soapberry family, which includes plants with showy flowers and often toxic fruits. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive sap. Its species is Acer amplum, a specific type of maple native to Europe, characterized by its large, heart-shaped leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer amplum is primarily native to China South-Central, China Southeast, and Vietnam. This species is commonly found in mountainous regions within these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with mixed forests and is known for its ornamental value. Its distribution reflects its adaptation to the diverse ecosystems of Southeast Asia.",
    "distribution_introduced_art_desc": "Acer amplum was mainly introduced to the northeastern United States as an ornamental tree due to its attractive fall color and unique, weeping growth habit. It has been planted in urban and suburban landscapes, particularly in areas with moist, well-drained soils. Despite its aesthetic appeal, it has shown potential to spread beyond cultivated areas into natural habitats. Its introduction has raised concerns among ecologists due to its invasive tendencies in certain regions. However, it remains a popular choice for landscaping in regions where it is non-invasive."
}
