{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circumlobatum f. insulare",
    "plant_slug": "acer-circumlobatum-f-insulare",
    "plant_name_scientific": "acer circumlobatum f. insulare",
    "intro": "Acer circumlobatum f. insulare, commonly known as the island maple, is a unique variant of the maple tree native to the Pacific Northwest of North America. This plant is characterized by its distinctive foliage, featuring palmately lobed leaves that are often smaller and more rounded compared to the typical species. The leaves are typically bright green in summer and turn vibrant red or orange in autumn, adding ornamental value to the landscape. It thrives in moist, well-drained soils and is often found in coastal or island environments. Due to its limited distribution, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circumlobatum f. insulare is primarily native to the western United States, particularly in California. It is found in the coastal regions of Northern California, including the Monterey Peninsula and the Santa Cruz Mountains. This variety thrives in moist, cool climates and is often associated with coastal scrub and chaparral habitats. It is also present in parts of Oregon and southern Vancouver Island in Canada. Due to its limited range, it is considered a rare and localized species.",
    "distribution_introduced_art_desc": "Acer circumlobatum f. insulare was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique foliage and aesthetic appeal. The introduction occurred in the late 19th century by European settlers. It has since become naturalized in several regions of the country. However, it is not considered invasive and poses minimal ecological risk."
}
