{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. microphyllum",
    "plant_slug": "acer-campestre-f-microphyllum",
    "plant_name_scientific": "acer campestre f. microphyllum",
    "intro": "Acer campestre f. microphyllum, commonly known as the dwarf maple, is a compact variant of the common maple. It is characterized by its small, ovate leaves that are typically less than 5 centimeters in length. The plant produces delicate, yellowish-green flowers in early spring, followed by red or orange samaras. It thrives in well-drained soils and partial shade, making it suitable for rock gardens or as a specimen plant. Its slow growth rate and ornamental foliage make it a popular choice for small spaces and urban landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. microphyllum is primarily native to parts of Europe, including the British Isles, Scandinavia, and the Iberian Peninsula. This variety of the common horse chestnut is also found in some regions of North Africa and the Middle East. It typically grows in woodland edges, hedgerows, and open areas with well-drained soils. The plant is adapted to temperate climates and can tolerate a range of environmental conditions. Its small leaves and distinctive growth habit make it a notable species within its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. microphyllum was mainly introduced to urban and suburban landscapes for ornamental purposes due to its compact size and attractive foliage. It is commonly used in landscaping as a hedge or specimen plant because of its tolerance to pruning and adaptability to various soil conditions. This distribution is primarily found in temperate regions of North America, where it has been cultivated since the early 20th century. Its introduction has led to its establishment in some natural areas, raising concerns about its potential invasiveness. Despite its ornamental value, its spread outside of cultivated settings requires monitoring to prevent ecological disruption."
}
