{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. sanguineum",
    "plant_slug": "acer-dasycarpum-f-sanguineum",
    "plant_name_scientific": "acer dasycarpum f. sanguineum",
    "intro": "Acer dasycarpum f. sanguineum, commonly known as the blood red maple, is a variant of the hairy maple native to the mountainous regions of central and eastern Asia. This ornamental tree is characterized by its striking red foliage, which becomes more vibrant in the autumn season. The leaves are typically palmately lobed, with a rough texture and a deep crimson hue. It produces small, clustered flowers in early spring, followed by distinctive, hairy samaras that aid in seed dispersal. Due to its aesthetic appeal, it is often cultivated in gardens and parks for its seasonal color display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. sanguineum is primarily native to the mountainous regions of central and eastern China, including areas such as Sichuan, Yunnan, and Shaanxi provinces. This plant thrives in temperate climates with high altitudes, often growing in mixed forests and on rocky slopes. It is particularly adapted to the humid and cool conditions found in these regions. The species is known for its distinctive red leaves, which make it a popular ornamental plant. However, its natural range is relatively restricted compared to other maple species.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. sanguineum was mainly introduced to areas with temperate climates and well-drained soils, where it thrives in full sun to partial shade. This distribution is primarily due to its ornamental value, as its vibrant red foliage makes it a popular choice for landscaping. It is commonly found in urban and suburban gardens across North America, particularly in regions with mild winters. The plant's adaptability to different soil types and its ability to tolerate urban conditions have contributed to its widespread introduction. However, it is important to note that its spread can sometimes lead to ecological impacts in native habitats."
}
