{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer circinatum f. fulvum",
    "plant_slug": "acer-circinatum-f-fulvum",
    "plant_name_scientific": "acer circinatum f. fulvum",
    "intro": "Acer circinatum f. fulvum, commonly known as the golden flame maple, is a cultivar of the Pacific silver fir maple. It is characterized by its vibrant orange to red foliage that turns brilliant yellow in the fall. The leaves are palmately lobed, with a serrated margin and a hairy underside. This plant thrives in moist, well-drained soils and partial to full sun. It is often used in landscaping for its striking seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer circinatum f. fulvum is primarily native to the Pacific Northwest region of North America. It is found in areas such as western Washington and northern California. This plant typically grows in moist, shaded environments like forests and along stream banks. It is part of the maple family and is known for its distinctive yellow leaves. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acer circinatum f. fulvum was mainly introduced to enhance ornamental value in gardens and landscapes due to its vibrant fall coloration. It is commonly found in regions with temperate climates, particularly in the Pacific Northwest of North America. This cultivar is favored for its unique yellow to orange foliage, which stands out against the typical red hues of the parent species. It has been widely cultivated for its aesthetic appeal in both residential and public green spaces. However, it is important to note that its introduction may have ecological implications in non-native environments."
}
