{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer bernardinum",
    "plant_slug": "acer-bernardinum",
    "plant_name_scientific": "acer bernardinum",
    "intro": "Acer bernardinum, commonly known as the Mexican maple, is a small deciduous tree native to the mountainous regions of Mexico. It belongs to the Acer genus, which includes various maple species, and is characterized by its palmate leaves with five lobes. The plant typically grows at elevations between 1,500 and 3,000 meters, preferring well-drained soils in temperate climates. Its flowers are small and inconspicuous, appearing in early spring, while its fruit is a samara, which aids in seed dispersal. The tree is valued for its ornamental value and is often cultivated in gardens for its vibrant autumn foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer bernardinum is primarily native to the southeastern United States, specifically found in parts of Georgia, North Carolina, and South Carolina. It thrives in moist, acidic soils along stream banks and in wetlands. This species is commonly associated with the Appalachian region and is often found in areas with high humidity and moderate temperatures. It is a small to medium-sized maple tree that plays an important role in local ecosystems. Due to habitat loss, it is considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Acer bernardinum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in forested or woodland environments. It thrives in regions with a temperate climate, making it suitable for USDA hardiness zones 5 through 8. The plant is commonly found in the eastern United States, particularly in the Appalachian region, where it has been introduced as part of native vegetation restoration efforts. Its distribution has been influenced by both natural spread and human-assisted planting in ecological landscaping. However, its introduction has also raised concerns about potential invasiveness in non-native habitats."
}
