{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer austriacum var. trifidum",
    "plant_slug": "acer-austriacum-var-trifidum",
    "plant_name_scientific": "acer austriacum var. trifidum",
    "intro": "Acer austriacum var. trifidum, commonly known as the three-lobed maple, is a variant of the European maple characterized by its distinctive trifid leaves. The leaves are deeply lobed into three distinct segments, giving the plant its common name. It is a deciduous tree that typically grows in moist, shaded environments in temperate regions. The tree produces small, red or orange samaras as seeds, which are dispersed by wind. Its botanical features make it a notable species in both horticulture and ecological studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer austriacum var. trifidum is primarily native to the mountainous regions of Central Europe, particularly the Alps. It is found in countries such as Austria, Germany, Switzerland, and Italy. This variety thrives in cool, moist environments at higher elevations. It is commonly associated with forested areas and rocky slopes. Its native distribution is limited to these specific geographic and ecological conditions.",
    "distribution_introduced_art_desc": "Acer austriacum var. trifidum was mainly introduced to North America as an ornamental plant due to its unique trifid leaf lobes and aesthetic appeal. It has been cultivated in gardens and landscapes across the eastern United States and parts of Canada. The introduction has led to its establishment in some natural areas, raising concerns about its potential invasiveness. Despite its ornamental value, its spread outside cultivated areas remains limited. It is primarily found in moist, shaded environments similar to its native habitat in Europe."
}
