{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. saniculifolium",
    "plant_slug": "acer-campestre-f-saniculifolium",
    "plant_name_scientific": "acer campestre f. saniculifolium",
    "intro": "Acer campestre f. saniculifolium, commonly known as the Saniculifolium whitebeam, is a rare and distinctive cultivar of the European whitebeam. It is characterized by its unique, finely toothed leaves that resemble those of the sanicle plant, giving it its common name. The plant is a deciduous tree or shrub with a compact, rounded growth habit. It produces small, yellowish-green flowers in early spring, followed by red or orange berries in the fall. This cultivar is valued for its ornamental appeal and is often used in horticulture for its attractive foliage and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. saniculifolium is primarily native to southeastern Europe and parts of western Asia. This plant is found in regions such as the Balkans, northern Greece, and western Turkey. It thrives in temperate climates and is commonly found in open woodlands and rocky areas. The subspecies is known for its distinctive, saniculifolium-like leaves that set it apart from other forms of Acer campestre. Its distribution is closely linked to specific soil types and microclimates in its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. saniculifolium was mainly introduced to ornamental horticulture due to its unique foliage and adaptability to various soil conditions. It is often cultivated in gardens and parks for its aesthetic appeal and hardy nature. This variety is particularly valued for its heart-shaped leaves that turn vibrant shades of red and yellow in the fall. It thrives in temperate climates and is relatively resistant to pests and diseases. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
