{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinnamomifolium var. microphyllum",
    "plant_slug": "acer-cinnamomifolium-var-microphyllum",
    "plant_name_scientific": "acer cinnamomifolium var. microphyllum",
    "intro": "Acer cinnamomifolium var. microphyllum, commonly known as the dwarf cinnamon leaf maple, is a small deciduous tree or shrub native to the mountainous regions of eastern Asia. It is characterized by its finely divided, palmate leaves that resemble those of the cinnamon tree, giving it its common name. The plant typically grows to a height of less than 3 meters, with a compact, bushy form. Its leaves turn vibrant shades of red and orange in the fall, adding ornamental value to gardens. It prefers well-drained soil and partial to full sun, making it a popular choice for ornamental horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinnamomifolium var. microphyllum is primarily native to the mountainous regions of eastern Asia, particularly in China, Korea, and Japan. This variety thrives in cool, humid climates at higher elevations where it can be found growing in mixed forests and along stream banks. It is commonly associated with temperate deciduous forests and is often found in areas with well-drained, acidic soils. The plant is known for its small, dark green leaves and vibrant autumn foliage, making it a notable species in its native habitat. Due to its specific ecological requirements, it is not widely cultivated outside of its natural range.",
    "distribution_introduced_art_desc": "Acer cinnamomifolium var. microphyllum was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the early 20th century as an ornamental plant due to its unique foliage and aesthetic appeal. This species has since become naturalized in several areas, particularly in moist, shaded environments. Its introduction has raised concerns due to its potential to outcompete native vegetation. However, it is currently considered a minor invasive species with limited ecological impact."
}
