{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer australe",
    "plant_slug": "acer-australe",
    "plant_name_scientific": "acer australe",
    "intro": "Acer australe, commonly known as the Australian maple, is a small to medium-sized deciduous tree native to southeastern Australia. It is characterized by its palmate leaves, which are typically 5-9 lobes and turn vibrant yellow in autumn. The tree produces small, yellowish-green flowers in spring, followed by winged samaras that aid in seed dispersal. It thrives in a range of soil types but prefers well-drained soils and full sun. Acer australe is valued for its ornamental value and is often planted in gardens and parks for its seasonal color and structural beauty.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer australe is primarily native to eastern Australia, including regions such as New South Wales, Victoria, and parts of South Australia. It is commonly found in coastal and near-coastal areas, particularly in heathlands and dry sclerophyll forests. This species thrives in sandy or gravelly soils and is often associated with dunes and rocky outcrops. It is an important component of the local flora in these regions. The plant is well adapted to the Mediterranean climate of southeastern Australia, with dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acer australe was mainly introduced to New Zealand and parts of Australia as an ornamental tree due to its aesthetic value and adaptability to various climates. It is commonly found in urban landscapes, parks, and along roadsides where it thrives in well-drained soils. Although it is not considered invasive in its introduced range, it can spread through bird-dispersed seeds and may naturalize in certain areas. The plant is valued for its vibrant autumn foliage and ability to tolerate urban conditions. However, its distribution is limited compared to its native range in eastern North America."
}
