{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer barbatum",
    "plant_slug": "acer-barbatum",
    "plant_name_scientific": "acer barbatum",
    "intro": "Acer barbatum, commonly known as the Japanese maple, is a deciduous tree native to Japan and Korea. It is characterized by its striking, palmate leaves that turn vibrant shades of red, orange, and yellow in autumn. The plant belongs to the Sapindaceae family and is valued for its ornamental qualities in gardens and landscapes. It typically grows to a height of 6 to 15 meters, with a spreading, upright form. The flowers are small and inconspicuous, appearing in clusters before the leaves emerge in spring.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer barbatum is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in cool, temperate climates and is commonly found in forested areas at high altitudes. This species is particularly associated with the Himalayas and the northern parts of the Korean Peninsula. It prefers well-drained soils and is often found in mixed hardwood forests. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer barbatum was mainly introduced to regions with temperate climates, particularly in North America and parts of Asia. It thrives in well-drained soils and requires full sun to partial shade for optimal growth. This plant is often cultivated for its ornamental value due to its vibrant fall foliage. It has been introduced to various botanical gardens and urban landscapes for its aesthetic appeal. However, it is important to monitor its spread to prevent potential ecological impacts in non-native areas."
}
