{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. trichopodum",
    "plant_slug": "acer-campestre-f-trichopodum",
    "plant_name_scientific": "acer campestre f. trichopodum",
    "intro": "Acer campestre f. trichopodum, commonly known as the hairy-leaved horse chestnut, is a variant of the common horse chestnut. It is characterized by its dense, hairy pubescence on the leaves, which gives it a distinctive appearance. The plant is a deciduous tree or shrub with palmate leaves that turn yellow in autumn. It produces white, bell-shaped flowers in spring, followed by spiny, red-brown fruits. This cultivar is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. trichopodum is primarily native to southern and central Europe, including countries such as France, Spain, Italy, and parts of the Balkans. It is commonly found in woodlands, hedgerows, and rocky areas where it thrives in well-drained soils. This variety is known for its distinctive, finely toothed leaves and is often used in landscaping for its ornamental value. It prefers temperate climates and is adapted to a range of environmental conditions. Despite its ornamental appeal, it is not widely cultivated beyond its native range.",
    "distribution_introduced_art_desc": "Acer campestre f. trichopodum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in woodland edges, hedgerows, and along riverbanks. This variety is known for its dense, compact growth habit and its ability to thrive in a variety of environmental conditions. It has been widely used in landscaping for its ornamental value and hardiness. However, its introduction has raised concerns about its potential to spread beyond cultivated areas and impact native plant communities."
}
