{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. suberosum",
    "plant_slug": "acer-campestre-var-suberosum",
    "plant_name_scientific": "acer campestre var. suberosum",
    "intro": "Acer campestre var. suberosum, commonly known as the hairy maple, is a variant of the common maple that exhibits distinct botanical features. It is characterized by its dense, hairy foliage, which gives it a unique appearance compared to other maple species. The leaves are typically ovate or elliptical, with a serrated margin and a dark green upper surface. It produces small, yellowish-green flowers in early spring, followed by winged seeds that disperse by wind. This variant is often found in moist, shaded environments and is valued for its ornamental qualities in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. suberosum is primarily native to southern and central Europe, including countries such as France, Spain, Italy, and parts of the Balkans. It is commonly found in woodland edges, open forests, and rocky slopes. This variety of maple is adapted to temperate climates and can thrive in a range of soil types. It is often seen in the Iberian Peninsula and extends into southern France and northern Italy. Its natural distribution reflects its preference for well-drained soils and mild, humid conditions.",
    "distribution_introduced_art_desc": "Acer campestre var. suberosum was mainly introduced to enhance biodiversity and provide ecological benefits in urban and suburban landscapes. It is valued for its adaptability to various soil types and its ability to thrive in partial shade to full sun conditions. This variety is often used in landscaping due to its ornamental value, including its distinctive bark and seasonal foliage. It has been introduced to regions where it can contribute to soil stabilization and support local wildlife. However, its spread requires careful management to prevent potential invasiveness in non-native environments."
}
