{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum var. stenocarpum",
    "plant_slug": "acer-cappadocicum-var-stenocarpum",
    "plant_name_scientific": "acer cappadocicum var. stenocarpum",
    "intro": "Acer cappadocicum var. stenocarpum, commonly known as the narrow-fruit maple, is a deciduous tree native to the mountains of Turkey. It is characterized by its distinctive, elongated, and often twisted trunk, which gives it a striking, almost sculptural appearance. The leaves are palmately lobed, typically with five to seven deep, pointed lobes, and turn vibrant shades of red and orange in autumn. Its small, clustered flowers appear in early spring before the leaves emerge, and it produces small, round, woody fruits. This variety is valued for its ornamental qualities and is often cultivated in gardens for its unique form and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum var. stenocarpum is primarily native to the southeastern United States, specifically the Appalachian Mountains. This variant is found in regions spanning from Virginia through North Carolina and into Tennessee. It thrives in moist, well-drained soils along stream banks and in rocky ravines. The plant is commonly associated with mixed hardwood forests and is often found in areas with high humidity. Its distribution is limited to specific microhabitats that provide the right balance of light, moisture, and soil conditions.",
    "distribution_introduced_art_desc": "Acer cappadocicum var. stenocarpum was mainly introduced to the United States as an ornamental tree due to its unique foliage and aesthetic appeal. It is commonly found in the eastern and central regions of the country, where it is cultivated in gardens and parks. This variety is known for its narrow, elongated leaves that turn vibrant shades of red and orange in the fall. Despite its ornamental value, it has shown some invasive tendencies in certain areas, leading to concerns about its ecological impact. Proper management is recommended to prevent its spread into natural habitats."
}
