{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cinerascens var. subglabrum",
    "plant_slug": "acer-cinerascens-var-subglabrum",
    "plant_name_scientific": "acer cinerascens var. subglabrum",
    "intro": "Acer cinerascens var. subglabrum, commonly known as the smooth-leafed maple, is a deciduous tree native to eastern North America. It is characterized by its finely toothed, smooth-textured leaves that turn vibrant shades of red and orange in autumn. The tree produces small, yellowish-green flowers in early spring, followed by winged samaras as its fruit. Its bark is smooth and greyish-brown, often developing shallow fissures with age. This species prefers moist, well-drained soils and is often found in riparian areas and forest edges.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cinerascens var. subglabrum is primarily native to the southeastern United States, specifically occurring in parts of Georgia, South Carolina, and North Carolina. This variant of the red maple is typically found in moist, well-drained soils along stream banks and in floodplain forests. It thrives in humid climates with ample sunlight and is often associated with riparian habitats. The plant is known for its distinctive reddish-brown bark and its ability to tolerate periodic flooding. Due to its specific habitat requirements, it is considered a relatively rare and localized species within its range.",
    "distribution_introduced_art_desc": "Acer cinerascens var. subglabrum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in the southeastern United States, particularly in Georgia, South Carolina, and North Carolina. This variety is known for its distinctive grayish-brown bark and its ability to thrive in a variety of soil types. It is often used in landscaping for its ornamental value and adaptability. However, it is considered an invasive species in some regions due to its rapid spread and competition with native plants."
}
