{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer changhuaense",
    "plant_slug": "acer-changhuaense",
    "plant_name_scientific": "acer changhuaense",
    "intro": "Acer changhuaense, commonly known as the Changhua maple, is a deciduous tree native to China. It is characterized by its palmate leaves that turn vibrant shades of red and yellow in the fall. The plant belongs to the Sapindaceae family and is known for its ornamental value. It typically grows in mountainous regions and thrives in temperate climates. Its unique leaf patterns and seasonal color changes make it a popular choice for horticultural cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer changhuaense is primarily native to China, specifically the provinces of Yunnan and Sichuan. It is commonly found in mountainous regions at elevations ranging from 1,500 to 3,000 meters. This species thrives in temperate climates with well-drained soils and ample sunlight. It is often associated with secondary forests and rocky slopes in its natural habitat. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acer changhuaense was mainly introduced to the eastern and central regions of China, including provinces such as Zhejiang, Jiangxi, and Fujian. It thrives in areas with warm, humid climates and is commonly found in mountainous regions with well-drained soil. This species is often cultivated for its ornamental value due to its vibrant autumn foliage. It is also used in traditional Chinese medicine for its potential health benefits. However, its distribution is limited to specific ecological niches, making it a rare and localized species."
}
