{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. pendulum",
    "plant_slug": "acer-dasycarpum-f-pendulum",
    "plant_name_scientific": "acer dasycarpum f. pendulum",
    "intro": "Acer dasycarpum f. pendulum, commonly known as the weeping maple, is a unique variant of the hairy maple characterized by its cascading branches that create a striking, flowing appearance. This cultivar exhibits the typical features of the species, including palmate leaves with five lobes and small, clustered flowers in early spring. The foliage turns vibrant shades of red and yellow in autumn, adding ornamental value to gardens and landscapes. It thrives in well-drained soil and partial shade, making it suitable for temperate climates. Due to its distinctive form, it is often used as a specimen tree or in ornamental horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. pendulum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. This species thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,000 meters above sea level. It is commonly found in mixed forests and along stream sides in these regions. The plant is well adapted to the moist, well-drained soils typical of its native habitat. Its unique pendulous growth habit makes it a distinctive feature of the local flora.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. pendulum was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in full sun to partial shade. It is commonly found in gardens and landscapes that provide adequate space for its vigorous growth and cascading form. This cultivar is particularly valued for its ornamental value, showcasing attractive foliage and unique pendulous branches. It is often used in horticultural settings to add visual interest and structure to gardens. Due to its adaptability, it has been introduced to various parts of the world, including North America and Europe."
}
