{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. pubescens",
    "plant_slug": "acer-campestre-var-pubescens",
    "plant_name_scientific": "acer campestre var. pubescens",
    "intro": "Acer campestre var. pubescens, commonly known as the pubescent field maple, is a deciduous shrub or small tree native to Europe. It is characterized by its pubescent (hairy) young shoots and leaves that are typically ovate to elliptic in shape. The plant produces small, yellowish-green flowers in early spring, followed by winged seeds called samaras. It thrives in well-drained soils and is often found in woodland edges or open areas. Its ornamental value comes from its attractive foliage and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. pubescens is primarily native to northern Europe, including parts of Great Britain, Ireland, and northern France. It is also found in regions of Scandinavia, such as Norway and Sweden. This variety of the European hedge maple thrives in temperate climates and is commonly found in woodlands, hedgerows, and along stream banks. Its distribution extends into parts of central Europe, including the Czech Republic and Poland. It is well adapted to moist, well-drained soils and can tolerate partial shade.",
    "distribution_introduced_art_desc": "Acer campestre var. pubescens was mainly introduced to Europe and parts of Asia through horticultural trade and botanical exploration during the 18th and 19th centuries. It was valued for its ornamental qualities, including its distinctive hairy leaves and adaptability to various soil conditions. The plant has since become naturalized in several regions, often found in woodlands and along roadsides. Its introduction has led to its use in landscaping and ecological restoration projects. However, it is considered an invasive species in some areas due to its rapid spread and competitive nature."
}
