{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatum subsp. multiserratum",
    "plant_slug": "acer-caudatum-subsp-multiserratum",
    "plant_name_scientific": "acer caudatum subsp. multiserratum",
    "intro": "Acer caudatum subsp. multiserratum, commonly known as the multi-toothed maple, is a deciduous tree native to the southeastern United States. It is characterized by its distinctive, palmately lobed leaves that are finely toothed along the margins. The tree produces small, yellowish-green flowers in early spring, followed by winged seeds that are dispersed by wind. Its bark is smooth and grayish-brown, with shallow furrows that become more pronounced with age. This species is valued for its ornamental appeal and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatum subsp. multiserratum is primarily native to the southeastern United States, specifically occurring in parts of Georgia, Florida, and South Carolina. It is commonly found in moist, well-drained soils within hardwood forests and along stream banks. This subspecies thrives in humid climates and is often associated with rocky or sandy habitats. It is particularly common in the Appalachian Mountains region, where it grows as a small to medium-sized tree. Due to its limited distribution, it is considered a rare and locally endemic species in its native range.",
    "distribution_introduced_art_desc": "Acer caudatum subsp. multiserratum was mainly introduced to the southeastern United States, particularly in regions with moist, well-drained soils. It is commonly found in forested areas and along stream banks, where it thrives in partial to full shade. This subspecies is valued for its ornamental value, with its distinctive, finely toothed leaves and vibrant fall coloration. It has been cultivated in botanical gardens and private collections across the country. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
