{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. aureomarginatum",
    "plant_slug": "acer-dasycarpum-f-aureomarginatum",
    "plant_name_scientific": "acer dasycarpum f. aureomarginatum",
    "intro": "Acer dasycarpum f. aureomarginatum, commonly known as the golden-margin maple, is a variant of the hairy maple, characterized by its distinctive golden-yellow margins on the leaves. This plant is a deciduous tree or shrub native to the Himalayas, thriving in temperate climates with well-drained soils. Its leaves are typically palmately lobed, with a serrated margin and a vibrant green upper surface. The flowers are small and inconspicuous, appearing in early spring before the leaves emerge, while the tree produces small, red samaras in the fall. It is valued in horticulture for its ornamental foliage, particularly the striking golden edges that enhance its visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. aureomarginatum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. This variety is commonly found in temperate forests at elevations ranging from 1,500 to 3,000 meters above sea level. It thrives in well-drained soils and cooler climates, often growing in mixed hardwood forests. The plant is known for its distinctive golden-yellow margins on its leaves, which make it a popular ornamental species. Due to its specific habitat requirements, it is relatively rare in the wild and is often cultivated in botanical gardens and arboreta.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. aureomarginatum was mainly introduced to regions with temperate climates, where it thrives in well-drained soils and moderate humidity. This variety is often cultivated in gardens and parks for its ornamental value, particularly its striking yellow leaf margins. It is commonly found in parts of Europe and North America, where it has been introduced for landscaping purposes. The plant is relatively low maintenance and can tolerate a range of environmental conditions. However, it is not typically found in its native habitat, as it is a cultivated form of the species."
}
