{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer cappadocicum f. tricaudatum",
    "plant_slug": "acer-cappadocicum-f-tricaudatum",
    "plant_name_scientific": "acer cappadocicum f. tricaudatum",
    "intro": "Acer cappadocicum f. tricaudatum, commonly known as the three-tailed maple, is a rare and distinctive cultivar of the maple tree. It is characterized by its unique trifoliate leaves, which consist of three elongated, lobed segments that resemble a tail, giving it its common name. The plant is a deciduous tree or shrub, typically growing in temperate regions with well-drained soils. Its foliage turns vibrant shades of red and orange in the fall, making it a popular ornamental plant. This cultivar is valued for its ornamental appeal and is often cultivated in gardens and parks for its aesthetic features.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer cappadocicum f. tricaudatum is primarily native to the mountainous regions of central and southeastern Turkey, particularly in the Cappadocia area. This unique form of the horse chestnut is found in rocky and semi-arid habitats at elevations ranging from 1,000 to 2,000 meters. It is often associated with limestone soils and is commonly found in open woodlands and scrublands. The plant's distribution is limited to a few specific locations within Turkey, making it a rare and localized species. Due to its restricted range, it is considered an endemic variety with limited natural habitat.",
    "distribution_introduced_art_desc": "Acer cappadocicum f. tricaudatum was mainly introduced to ornamental horticulture due to its unique and visually striking foliage. This form is characterized by its trifoliate leaves, which give it a distinctive appearance compared to the typical two-leaf form of the species. It is often cultivated in gardens and landscapes for its aesthetic value rather than for ecological or agricultural purposes. Despite its ornamental appeal, it is not widely naturalized in the wild and remains primarily a cultivated plant. Its introduction has been limited to specific regions where it is grown as a specialty plant."
}
