{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre f. jovanovicii",
    "plant_slug": "acer-campestre-f-jovanovicii",
    "plant_name_scientific": "acer campestre f. jovanovicii",
    "intro": "Acer campestre f. jovanovicii, commonly known as the Jovanović's hedge maple, is a compact, shrub-like form of the common maple. It features small, ovate leaves with serrated edges and a striking display of red or orange foliage in autumn. The plant produces small, yellowish-green flowers in early spring, followed by winged samaras. It is well-suited for urban environments due to its tolerance of pollution and compact growth habit. Botanically, it is characterized by its dense branching and ability to thrive in a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre f. jovanovicii is primarily native to Southeastern Europe, specifically the Balkan Peninsula. This subspecies is found in countries such as Serbia, Bosnia and Herzegovina, Croatia, and parts of Bulgaria. It thrives in mountainous and forested regions with well-drained soils. The plant is often associated with mixed deciduous forests and rocky slopes. Its distribution is limited to specific habitats within this geographic region.",
    "distribution_introduced_art_desc": "Acer campestre f. jovanovicii was mainly introduced to Europe and parts of Asia as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in urban environments, parks, and along roadsides where it thrives in disturbed soils and full sun. This distribution has been facilitated by its hardiness and ability to tolerate pollution, making it a popular choice for landscaping. However, its introduction has also led to concerns about its potential invasiveness in certain regions. The plant's spread is often linked to human activity, including horticultural practices and accidental seed dispersal."
}
