{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum f. macrophyllum",
    "plant_slug": "acer-dasycarpum-f-macrophyllum",
    "plant_name_scientific": "acer dasycarpum f. macrophyllum",
    "intro": "Acer dasycarpum f. macrophyllum, commonly known as the giant maple, is a variant of the hairy maple. It is characterized by its large, heart-shaped leaves that can reach up to 15 centimeters in length. The plant is native to the mountainous regions of China and is typically found in temperate climates. Its bark is smooth and grayish-brown, becoming fissured with age. The species is valued for its ornamental value and is often cultivated in gardens for its striking foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum f. macrophyllum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. This plant thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,500 meters above sea level. It is commonly found in forests and rocky slopes, where it benefits from well-drained soil and moderate rainfall. The species is known for its distinctive large leaves and is often used in horticulture for its ornamental value. Its native distribution is closely associated with the biodiversity-rich areas of the Sichuan Basin and the eastern Himalayas.",
    "distribution_introduced_art_desc": "Acer dasycarpum f. macrophyllum was mainly introduced to regions with temperate climates that provide adequate moisture and well-drained soils. This distribution is primarily observed in parts of Asia, particularly in China, where it thrives in mountainous areas. The introduction of this plant has been largely driven by its ornamental value and adaptability to different environmental conditions. It is often cultivated in gardens and parks for its attractive foliage and seasonal color changes. However, its spread outside its native range is limited due to specific climate requirements and potential ecological constraints."
}
