{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer caudatum var. georgei",
    "plant_slug": "acer-caudatum-var-georgei",
    "plant_name_scientific": "acer caudatum var. georgei",
    "intro": "Acer caudatum var. georgei, commonly known as the George's Weeping Maple, is a unique variant of the Weeping Maple, characterized by its pendulous branches and delicate, elongated leaves. This cultivar is prized for its ornamental value, with its cascading foliage creating a striking visual effect in gardens and landscapes. It thrives in temperate climates and requires well-drained soil and partial to full sunlight. The leaves turn vibrant shades of red and orange in the fall, adding seasonal interest. However, it is relatively slow-growing and may require support due to its weak wood structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer caudatum var. georgei is primarily native to the southeastern United States, specifically found in parts of Georgia, South Carolina, and North Carolina. This variety is typically found in moist, well-drained soils in lowland forests and along stream banks. It thrives in areas with high humidity and is often associated with mixed hardwood forests. The plant is known for its distinctive, weeping form and red fall color. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Acer caudatum var. georgei was mainly introduced to specific regions in the southern United States, particularly in Georgia and South Carolina. It was introduced as an ornamental plant due to its unique weeping form and striking foliage. The distribution is limited to areas with moist, well-drained soils and partial to full sun exposure. It has been cultivated in botanical gardens and private collections since the early 20th century. However, it is not considered invasive and remains a rare and sought-after species in the horticultural trade."
}
