{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer dasycarpum var. pulverulentum",
    "plant_slug": "acer-dasycarpum-var-pulverulentum",
    "plant_name_scientific": "acer dasycarpum var. pulverulentum",
    "intro": "Acer dasycarpum var. pulverulentum, commonly known as the powdered maple, is a deciduous tree native to the Himalayas. It is characterized by its small, densely packed leaves that give it a distinctive, almost powdered appearance. The plant produces small, yellowish-green flowers in early spring, followed by red, fuzzy samaras that are typical of the maple family. It thrives in cool, moist climates and is often found at high elevations. The tree is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer dasycarpum var. pulverulentum is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude environments, typically at elevations ranging from 2,000 to 3,500 meters. This variety is often found in moist, well-drained soils within temperate forests and shrublands. Its distribution is closely associated with areas characterized by cool, humid climates and significant rainfall. The plant is well adapted to the rugged terrain and harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acer dasycarpum var. pulverulentum was mainly introduced to specific regions in China, particularly in the provinces of Shaanxi, Gansu, and Sichuan, where it thrives in mountainous areas with cool climates. It is commonly found in forests and on rocky slopes at elevations ranging from 1,500 to 3,000 meters. This variety is valued for its ornamental value, with distinctive red foliage in the fall and its ability to withstand harsh environmental conditions. It has also been cultivated in some parts of Europe and North America for its aesthetic appeal and adaptability. However, its introduction outside its native range is limited due to its specific ecological requirements."
}
