{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer chunii subsp. chunii",
    "plant_slug": "acer-chunii-subsp-chunii",
    "plant_name_scientific": "acer chunii subsp. chunii",
    "intro": "Acer chunii subsp. chunii, commonly known as the Chinese maple, is a deciduous tree native to China. It typically grows to a height of 8–12 meters, featuring a rounded crown and smooth, gray bark. The leaves are opposite, ovate to elliptic, and turn vibrant shades of red and yellow in autumn. It produces small, yellowish-green flowers in early spring, followed by samaroid fruits. This species is valued for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer chunii"
    },
    "taxonomy_art_desc": "Acer chunii subsp. chunii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their floral structures and diverse growth forms. Its order is Sapindales, which consists of flowering plants with a wide range of morphological diversity, including trees, shrubs, and vines. Its family is Sapindaceae, commonly known as the soapberry family, which includes plants with showy flowers and fruits that often contain toxic compounds. Its genus is Acer, which includes maple trees known for their distinctive leaves and samaras, commonly found in temperate regions. Its species is Acer chunii, a specific maple species native to China, characterized by its unique leaf shape and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer chunii subsp. chunii is primarily native to China Southeast. This species is commonly found in the mountainous regions of southern China, particularly in provinces such as Guangdong, Guangxi, and Fujian. It thrives in humid, subtropical climates with well-drained soils. The plant is often associated with secondary forests and rocky slopes. Its natural distribution is limited to specific ecological niches within this geographic region.",
    "distribution_introduced_art_desc": "Acer chunii subsp. chunii was mainly introduced to the western United States, particularly in California. It is commonly found in areas with mild, wet winters and dry summers, such as coastal regions and mountainous areas. This species is often cultivated as an ornamental tree due to its vibrant fall foliage and graceful appearance. It has been introduced to various landscapes, including parks, gardens, and along roadsides. However, its spread outside of its native range is limited due to its specific climatic requirements."
}
