{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer coriaceifolium",
    "plant_slug": "acer-coriaceifolium",
    "plant_name_scientific": "acer coriaceifolium",
    "intro": "Acer coriaceifolium, commonly known as the Japanese maple, is a deciduous tree native to Japan. It is characterized by its delicate, palmately lobed leaves that turn vibrant shades of red and orange in autumn. The tree typically grows to a height of 6 to 12 meters, with a rounded crown and smooth, grey bark. It prefers well-drained soil and partial shade, making it a popular ornamental plant in gardens. Its botanical features make it a valuable species for both ecological and aesthetic purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Sapindaceae",
        "genus": "Acer",
        "species": "Acer coriaceifolium"
    },
    "taxonomy_art_desc": "Acer coriaceifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, often with compound leaves and fruits that are capsules or drupes. Its family is Sapindaceae, commonly known as the soapberry family, which includes trees and shrubs with alternate leaves and often showy flowers. Its genus is Acer, commonly known as maples, which are deciduous trees or shrubs with opposite leaves and distinctive samaras. Its species is Acer coriaceifolium, a specific type of maple known for its thick, leathery leaves and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer coriaceifolium is primarily native to China South-Central and China Southeast. This species is found in the mountainous regions of these areas. It thrives in temperate climates with well-drained soils. The plant is commonly associated with forested landscapes in its native range. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acer coriaceifolium was mainly introduced to North America as an ornamental tree due to its unique foliage and autumn coloration. It has been planted in various regions, including the northeastern United States and parts of Canada, where it thrives in moist, well-drained soils. The plant is often found in urban and suburban landscapes, where it is valued for its aesthetic appeal. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
