{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acer campestre var. saniculifolium",
    "plant_slug": "acer-campestre-var-saniculifolium",
    "plant_name_scientific": "acer campestre var. saniculifolium",
    "intro": "Acer campestre var. saniculifolium, commonly known as the Saniculifolium horse chestnut, is a variant of the common horse chestnut. It is characterized by its distinctive, finely toothed, saniculifolium-like leaves that resemble those of the Sanicula genus. The plant typically grows as a small to medium-sized tree or shrub, reaching heights of up to 10 meters. It produces white, bell-shaped flowers in clusters during the spring, followed by spiny, chestnut-like fruits. This variety is often cultivated for its ornamental value and is adapted to a range of soil types and light conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acer campestre var. saniculifolium is primarily native to Central and Eastern Europe, including parts of Germany, Poland, and the Czech Republic. This variety of the common maple is typically found in moist, shaded woodlands and along stream banks. It thrives in temperate climates with well-drained soils. The plant is often associated with mountainous regions and is considered a relict species in some areas. Its distribution is limited and it is not widely cultivated outside its native range.",
    "distribution_introduced_art_desc": "Acer campestre var. saniculifolium was mainly introduced to ornamental horticulture and landscape design due to its unique foliage and adaptability. It is valued for its attractive, finely cut leaves that provide visual interest throughout the growing season. This variety is often used in gardens and urban environments where its compact size and resilience make it a desirable choice. It has been cultivated in various regions with temperate climates, including parts of Europe and North America. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
